{
  "ch_prehistoric_01": {
    "title": "العصر الحجري القديم",
    "theory": "بدأ العصر الحجري القديم منذ حوالي 700,000 عام. استُخدمت الأدوات الحجرية المشذبة (الفؤوس اليدوية، القواطع) وعاش الناس في الكهوف أو الملاجئ على ضفاف الأنهار. عاشوا على الصيد والجمع في مجموعات.\n\n• المواقع المهمة: جيونغوك-ري في يونتشون (فؤوس آشولية)، سوكجانغ-ري في غونجو، غومونمورو في سانغوون، دوروبونغ في تشونغوون\n• الخصائص: حياة بدوية، مجتمع متساوٍ، استخدام النار"
  },
  "ch_prehistoric_02": {
    "title": "العصر الحجري الحديث",
    "theory": "بدأ العصر الحجري الحديث منذ حوالي 10,000 عام (حوالي 8000 ق.م). استُخدمت الأدوات الحجرية المصقولة والفخار المزخرف بنقش المشط. بدأت الزراعة وتربية الحيوانات، مما أدى إلى حياة مستقرة في البيوت شبه المدفونة.\n\n• المواقع المهمة: أمسا-دونغ في سيول، دونغسام-دونغ في بوسان، أوسان-ري في يانغيانغ\n• المعتقدات: الأرواحية، الطوطمية، الشامانية\n• الخصائص: المغازل وإبر العظام (النسيج البدائي)، أكوام الأصداف"
  },
  "ch_prehistoric_03": {
    "title": "العصر البرونزي",
    "theory": "بدأ العصر البرونزي حوالي 2000-1500 ق.م. استُخدم البرونز بشكل رئيسي للأسلحة والأدوات الطقسية، بينما ظلت الأدوات الزراعية من الحجر (سكاكين حجرية على شكل هلال). تكثفت زراعة الأرز وظهرت الطبقات الاجتماعية.\n\n• الفخار: فخار بدون زخرفة، فخار طراز ميسونغ-ري\n• الأدوات البرونزية: خناجر على شكل المندولين، مرايا بنقوش خشنة\n• المقابر: الدولمن (نوع الطاولة/نوع لوحة الشطرنج)، مقابر الصناديق الحجرية\n• المجتمع: مجتمع الزعماء، الإيمان بالشعب المختار"
  },
  "ch_prehistoric_04": {
    "title": "العصر الحديدي",
    "theory": "بدأ العصر الحديدي حوالي القرن الخامس والرابع ق.م. استُخدم الحديد للأدوات الزراعية والأسلحة، مما زاد الإنتاجية الزراعية وكثّف حروب الغزو. توسعت التجارة مع الصين.\n\n• الأدوات الحديدية: أدوات زراعية حديدية (مناجل، معاول)، أسلحة حديدية\n• الأدوات البرونزية: خناجر رفيعة، مرايا بنقوش دقيقة (طراز كوري)\n• المقابر: مقابر خشبية، مقابر الجرار\n• التغييرات: تدفق العملات الصينية (مينغداوتشيان، بانليانغ)، استخدام الكتابة بالفرشاة"
  },
  "ch_gojoseon_01": {
    "title": "تأسيس وتطور غوجوسون",
    "theory": "تأسست غوجوسون عام 2333 ق.م على يد دانغون وانغغوم (وفقاً لسامغوك يوسا). تطورت في منطقة لياونينغ وشمال شبه الجزيرة الكورية على أساس ثقافة البرونز.\n\n• التطور: دانغون جوسون ← غيجا جوسون (أسطوري) ← ويمان جوسون\n• ويمان جوسون: تأسست عام 194 ق.م بعد أن أطاح ويمان بالملك جون\n• الذروة: تبني ثقافة الحديد، التجارة الوسيطة بين هان وجين\n• السقوط: غزو الإمبراطور وو من هان عام 108 ق.م، إنشاء القيادات الأربع لهان"
  },
  "ch_gojoseon_02": {
    "title": "مجتمع وثقافة غوجوسون",
    "theory": "حافظت غوجوسون على النظام الاجتماعي من خلال القوانين الثمانية (بومغوم 8 جو). ثلاثة بنود فقط معروفة اليوم.\n\n• القوانين الثمانية (المعروفة):\n  - من يقتل يُعدم\n  - من يجرح الآخرين يعوض بالحبوب\n  - من يسرق يصبح عبداً (فدية 500,000 قطعة)\n\n• الأهمية: احترام الحياة، حماية الملكية الخاصة، أهمية العمالة\n• المجتمع: مجتمع طبقي، وجود قوانين عرفية جنائية"
  },
  "ch_gojoseon_03": {
    "title": "نمو الممالك المختلفة",
    "theory": "بعد سقوط غوجوسون، نمت عدة ممالك في منشوريا وشبه الجزيرة الكورية.\n\n• بويو: اتحاد 5 قبائل، يونغو (مهرجان ديسمبر)، دفن الأتباع، كتاب واحد 12 قانون\n• غوغوريو: اتحاد 5 قبائل، دونغمينغ (أكتوبر)، سوأوكجي (نظام الصهر المقيم)\n• أوكجو: جزية لغوغوريو، عادة تربية العروس الصغيرة، غولجانغجي (مقبرة عائلية مشتركة)\n• دونغيي: موتشون (أكتوبر)، الزواج الخارجي، تشيكهوا (تعويض عن انتهاك الحدود)\n• سامهان: ماهان، جينهان، بيونهان، سودو (مكان مقدس مع تشونغون)، مهرجانات مايو وأكتوبر"
  },
  "ch_three_kingdoms_01": {
    "title": "تأسيس ونمو غوغوريو",
    "theory": "تأسست غوغوريو عام 37 ق.م على يد جومونغ في جولبون. تطورت في المناطق الجبلية لنهر يالو لتصبح دولة فاتحة.\n\n• الملك تيجو: فتح أوكجو، محاولة التوسع نحو لياودونغ\n• الملك غوغوكتشون: جينديبوب (مساعدة الفقراء)، إعادة تنظيم نظام الـ 5 بو\n• الملك دونغتشون: أزمة بسبب غزو غوانتشيوجيان من وي\n• الخصائص: مجلس الجيغا، غيونغدانغ (تعليم الشباب)، سوأوكجي"
  },
  "ch_three_kingdoms_02": {
    "title": "ذروة غوغوريو",
    "theory": "في القرنين الرابع والخامس، أصبحت غوغوريو قوة في شرق آسيا.\n\n• الملك سوسوريم: تبني البوذية (372)، تأسيس تيهاك، إصدار القانون\n• الملك غوانغايتو: توسع إقليمي (منشوريا، شمال شبه الجزيرة)، مساعدة شيلا (هزيمة الوا)\n• الملك جانغسو: نقل العاصمة إلى بيونغيانغ (427)، سياسة التوسع جنوباً، السيطرة على حوض نهر هان\n• نصب الملك غوانغايتو: سجلات تاريخ غوغوريو، تقع في جيلين، منشوريا\n• أقصى إقليم: من منشوريا إلى وسط شبه الجزيرة (حتى تشونغجو)"
  },
  "ch_three_kingdoms_03": {
    "title": "المقاومة الخارجية وسقوط غوغوريو",
    "theory": "في القرنين السادس والسابع، حاربت غوغوريو غزوات سوي وتانغ.\n\n• أولجي موندوك: معركة سالسو (612)، هزيمة 300,000 جندي من الإمبراطور يانغ من سوي\n• يون غيسومون: بناء السور العظيم ذو الألف لي، هزيمة الإمبراطور تايزونغ من تانغ (معركة أنسي، 645)\n• المقاومة الخارجية: صد 4 غزوات سوي، 3 غزوات تانغ\n• السقوط: 668، فتحت بتحالف شيلا-تانغ\n• الأسباب: انقسام الطبقة الحاكمة، صراعات السلطة بعد وفاة يون غيسومون"
  },
  "ch_three_kingdoms_04": {
    "title": "تأسيس ونمو بيكجي",
    "theory": "تأسست بيكجي عام 18 ق.م على يد أونجو في ويريي (حوض نهر هان). تطورت على أساس حوض نهر هان.\n\n• الملك غوي: تنظيم نظام الرتب والزي الرسمي، إصدار القانون، 6 جوابيونغ\n• الملك غونتشوغو: توحيد ماهان، هجوم على غوغوريو (موت الملك غوغوغوون)\n• الإقليم: التوسع نحو لياوشي، شاندونغ، كيوشو (سيف السبع فروع)\n• الخصائص: تجارة بحرية متطورة، تبادل مع سلالات الجنوب"
  },
  "ch_three_kingdoms_05": {
    "title": "ذروة ونهضة بيكجي",
    "theory": "وصلت بيكجي إلى ذروتها في القرن الرابع تحت الملك غونتشوغو، لكنها تراجعت بسبب توسع غوغوريو جنوباً.\n\n• الملك غونتشوغو: فتح ماهان، السيطرة على هوانغهي-دو وجولا-دو، إهداء سيف السبع فروع لليابان\n• الملك غايرو: سقوط هانسونغ (475)، قُتل على يد الملك جانغسو من غوغوريو\n• النقل إلى أونغجين (475): نقل العاصمة إلى غونغجو\n• الملك موريونغ: النهضة، إرسال 22 دامنو (حكام محليون)، تبادل مع ليانغ\n• الملك سونغ: النقل إلى سابي (538)، اسم البلد نامبويو، محاولة استعادة حوض هان (وفاة في غوانسانسونغ)"
  },
  "ch_three_kingdoms_06": {
    "title": "حركة الترميم وسقوط بيكجي",
    "theory": "في القرن السابع، فُتحت بيكجي بتحالف شيلا-تانغ.\n\n• الملك أويجا: هجوم على شيلا (سقوط دايياسونغ)، فوضى سياسية في نهاية الحكم\n• السقوط: 660، سقوط سابيسونغ بتحالف شيلا-تانغ (كيم يوسين، سو دينغفانغ)\n• حركة الترميم: بقيادة بوكسين، دوتشيم، هوكتشي سانغجي، بدعم اليابان\n• معركة بيكغانغ (663): هزيمة البحرية اليابانية، فشل حركة الترميم\n• الأهمية: هاجر بعض لاجئي بيكجي إلى اليابان وشيلا، ناشرين الثقافة"
  },
  "ch_three_kingdoms_07": {
    "title": "تأسيس وتطور شيلا",
    "theory": "تأسست شيلا عام 57 ق.م على يد باك هيوكغوسي في ساروغوك (غيونغجو). كانت الأبطأ بين الممالك الثلاث في التطور.\n\n• الملك نيمول: تأسيس التوارث الوراثي لعشيرة كيم، لقب ماريبغان\n• الملك بوبهونغ: الاعتراف الرسمي بالبوذية (استشهاد إيتشادون)، إصدار القانون، تنظيم نظام غولبوم، ضم غومغوان غايا\n• الملك جينهونغ: إعادة تنظيم الهوارانغدو، السيطرة على حوض هان، فتح سهل هامهونغ ودايغايا\n• نصب التفتيش: نصب بوكهانسان، نصب تشانغنيونغ، نصب ماأون-ريونغ، نصب هوانغتشو-ريونغ"
  },
  "ch_three_kingdoms_08": {
    "title": "ذروة شيلا وتوحيد الممالك الثلاث",
    "theory": "في القرن السابع، تحالفت شيلا مع تانغ لتوحيد الممالك الثلاث.\n\n• الملكة سوندوك: بناء تشومسونغداي، باغودا من 9 طوابق في هوانغنيونغسا\n• الملك تيجونغ مويول (كيم تشون-تشو): أول ملك جينغول، تحالف مع تانغ\n• الملك مونمو: بعد سقوط بيكجي (660) وغوغوريو (668)، طرد تانغ\n• حرب شيلا-تانغ: معارك ميسو-سونغ وغيبولبو (676)، هزيمة تانغ\n• الأهمية: التوحيد جنوب خط ديدونغ-وونسان، أساس الثقافة الوطنية"
  },
  "ch_three_kingdoms_09": {
    "title": "تأسيس وتطور غايا",
    "theory": "كانت غايا مملكة اتحادية تطورت في حوض نهر ناكدونغ. ازدهرت بفضل إنتاج الحديد والتجارة البحرية.\n\n• غايا الأولى: مركزها غومغوان غايا (غيمهي)، خلافة بيونهان\n• غايا اللاحقة: مركزها دايغايا (غوريونغ)، ذروة في القرنين الخامس والسادس\n• الخصائص: تصدير الحديد (إلى اليابان وليلانغ)، مملكة اتحادية (فشل التوحيد)\n• السقوط: غومغوان غايا (532، الملك بوبهونغ)، دايغايا (562، الملك جينهونغ)\n• الثقافة: غاياغوم (القيثارة)، دروع حديدية، عادة دفن الأتباع"
  },
  "ch_three_kingdoms_10": {
    "title": "البوذية والفكر في الممالك الثلاث",
    "theory": "ساهمت البوذية في تعزيز السلطة الملكية والتوحيد الوطني.\n\n• غوغوريو: 372، جلبها سوندو من تشين الأمامية (الملك سوسوريم)\n• بيكجي: 384، جلبها مالانانتا من جين الشرقية (الملك تشيمنيو)\n• شيلا: 527، اعترف بها رسمياً بعد استشهاد إيتشادون (الملك بوبهونغ)\n• الخصائص: بوذية حماية الدولة، تبني على المستوى الوطني"
  },
  "ch_three_kingdoms_11": {
    "title": "مقابر ومواقع الممالك الثلاث",
    "theory": "تُظهر مقابر الممالك الثلاث الخصائص الثقافية لكل مملكة.\n\n• غوغوريو: مقابر الحجارة المكدسة ← مقابر الممرات، جداريات (مقابر الراقصين، المصارعين، العمودين)\n• بيكجي: مقابر الممرات، مقبرة الملك موريونغ (مقبرة من الطوب)، لوحات الحراس الأربعة\n• شيلا: مقابر تراكم الخشب والحجارة (مقبرة الحصان السماوي، هوانغنام دايتشونغ)، تيجان ذهبية مكتشفة\n• شيلا الموحدة: مقابر الممرات (تأثير الحرق)\n• بالهي: مقبرة الأميرة جونغهيو (مقبرة ممرات)، خلافة غوغوريو"
  },
  "ch_three_kingdoms_12": {
    "title": "فنون وعلوم الممالك الثلاث",
    "theory": "طورت الممالك الثلاث فنوناً وتقنيات علمية أصيلة.\n\n• غوغوريو: جداريات جنائزية (الحراس الأربعة)، مشهد صيد من مقبرة الراقصين\n• بيكجي: مبخرة برونزية مذهبة، تماثيل بوذا المنحوتة في صخرة سوسان، باغودا ميريوكسا الحجرية\n• شيلا: تشومسونغداي (أقدم مرصد في شرق آسيا)، باغودا من 9 طوابق في هوانغنيونغسا، تيجان ذهبية\n• العلوم: رصد فلكي، استخدام التقويم، تطوير بناء السفن\n• النقل إلى اليابان: أجيكغي ووني (الحروف الصينية، الكونفوشية)، دامجينغ (الورق، الحبر، الألوان)"
  },
  "ch_north_south_states_01": {
    "title": "سياسة شيلا الموحدة",
    "theory": "أسست شيلا الموحدة سلطة ملكية قوية ونظاماً مركزياً.\n\n• الملك سينمون: إلغاء نوغوب، توزيع غوانريوجون، تأسيس غوكهاك، 9 مقاطعات و5 عواصم ثانوية\n• نظام الحكم: جيبسابو (المؤسسة العليا)، سانغديدونغ (ممثل الأرستقراطية)\n• الإدارة المحلية: 9 مقاطعات، 5 عواصم ثانوية، أويساجونغ (مفتشون)، هيانغ، بوغوك (مناطق إدارية خاصة)\n• الجيش: 9 سودانغ (جيش مركزي)، 10 جونغ (جيش محلي)\n• الفترة المتأخرة: صراعات على العرش، صعود الأمراء المحليين، مقاومة دوأوبوم 6"
  },
  "ch_north_south_states_02": {
    "title": "اقتصاد شيلا الموحدة",
    "theory": "تطور اقتصاد شيلا الموحدة بفضل التوسع الإقليمي.\n\n• النظام العقاري: غوانريوجون (حقوق التحصيل للموظفين)، جونغجون (أراضي الفلاحين)\n• وثيقة مينجونغ: تعداد القرى (السكان، الأراضي، الماشية) كل 3 سنوات، اكتُشفت في شوسوئين في اليابان\n• التجارة: أسواق شرق وغرب غيونغجو، موانئ دولية (تشونغهيجين، ميناء أولسان)\n• جانغ بوغو: تأسيس تشونغهيجين (828)، السيطرة البحرية، تجارة وسيطة تانغ-شيلا-اليابان\n• الحرف: صناعة الذهب والفضة، نسج الحرير"
  },
  "ch_north_south_states_03": {
    "title": "مجتمع شيلا الموحدة",
    "theory": "كانت شيلا الموحدة مجتمع طبقات قائم على نظام غولبوم.\n\n• نظام غولبوم: سونغغول ← جينغول ← دوأوبوم 6 إلى 1، قيود على الرتب الرسمية والحياة اليومية\n• جينغول: أعلى أرستقراطية، حق وراثة العرش، دوأوبوم 5 وأقل محدودون في الرتب\n• دوأوبوم 6: مهن في الدراسات والدين، طلاب في الصين، مثقفون نقديون\n• اضطرابات متأخرة: صراعات على العرش، نزاعات داخلية للجينغول، مقاومة دوأوبوم 6\n• صعود الأمراء المحليين: نمو مستقل للقوى المحلية، أساس الممالك الثلاث اللاحقة"
  },
  "ch_north_south_states_04": {
    "title": "ثقافة شيلا الموحدة",
    "theory": "دمجت شيلا الموحدة ثقافات الممالك الثلاث لتطوير ثقافة وطنية.\n\n• البوذية: مدرسة هوايوم (أويسانغ)، تطور المدارس العقائدية، شعبية السون (الفترة المتأخرة)\n• وونهيو: فكر هواجينغ، نشر البوذية، موايغا\n• العمارة: بولغوكسا، سوكغورام (بوذا الرئيسي)، باغودات دابوتاب وسوكغاتاب\n• الأجراس: جرس الملك سونغدوك (جرس إيميلي)، جرس سانغوونسا\n• الأدب: هيانغا (تشويونغا، جيمانغميغا)، سول تشونغ (تنظيم الإيدو)"
  },
  "ch_north_south_states_05": {
    "title": "تأسيس وسياسة بالهي",
    "theory": "تأسست بالهي عام 698 على يد داي جويونغ في دونغموسان. كانت دولة أسسها الناجون من غوغوريو والموهي.\n\n• داي جويونغ: جنرال سابق من غوغوريو، التأسيس بعد النصر على تانغ\n• الملك مو: صراع مع تانغ، هجوم جانغ مونهيو على شبه جزيرة شاندونغ\n• الملك مون: علاقات ودية مع تانغ، نقل العاصمة إلى سانغغيونغ، تنظيم 3 سونغ 6 بو\n• الملك سون: أقصى إقليم، لقب 'المملكة المزدهرة في الشرق'\n• السقوط: 926، فتحت من قبل الخيتان"
  },
  "ch_north_south_states_06": {
    "title": "مجتمع وثقافة بالهي",
    "theory": "ورثت بالهي ثقافة غوغوريو وتلقت أيضاً تأثير تانغ.\n\n• الحكومة: 3 سونغ 6 بو (نظام تانغ)، 5 عواصم، 15 ولاية، 62 منطقة\n• إرث غوغوريو: الأوندول، فوانيس حجرية، تماثيل بوذا الجالسة، هيكل مقبرة الأميرة جونغهيو\n• تأثير تانغ: جوجاغام (التعليم الكونفوشي)، المشاركة في امتحانات بينغونغكوا\n• العلاقات الخارجية: تبادل مع تانغ وشيلا واليابان، طريق شيلا (طريق تجاري)\n• التراث الثقافي: آثار سانغغيونغ يونغتشونبو، مقابر الأميرتين جونغهي وجونغهيو"
  },
  "ch_goryeo_01": {
    "title": "تأسيس ونظام حكم غوريو",
    "theory": "عام 918، أطاح وانغ غون بغونغيي وأسس غوريو. وحد الممالك الثلاث اللاحقة (936) ودمج الأمراء المحليين.\n\n• دمج الأمراء: سياسة زواجية (29 زوجة)، منح الألقاب، نظام غيين، نظام ساسيمغوان\n• التعليمات العشر: نصائح تُركت للملوك المستقبليين\n• نظام الحكم: 2 سونغ (جونغسومونهاسونغ، سانغسو-سونغ)، 6 بو، تشونغتشووون، سامسا\n• دوبيونغماسا، سيكموكدوغام: مؤسسات خاصة بغوريو\n• الإدارة المحلية: 5 دو، 2 غي، هيانغ، بوغوك، سو (مناطق إدارية خاصة)"
  },
  "ch_goryeo_02": {
    "title": "تشكيل وتراجع المجتمع الأرستقراطي",
    "theory": "هيمنت الأرستقراطية من العائلات الكبيرة على الفترة المبكرة من غوريو.\n\n• الأرستقراطية: احتكار المناصب عبر الامتحانات والإيمسو، وراثة غونغأومجون\n• ثورة يي جاغيوم (1126): محاولة احتكار السلطة من قبل عشيرة الأم\n• ثورة ميوتشونغ (1135): اقتراح نقل العاصمة إلى سوغيونغ ولقب إمبراطوري، قمعها كيم بو-سيك\n• الخصائص: تشكيل عائلات كبيرة مثل يي من غيونغوون، زيجات مغلقة\n• التراجع: ضعف السلطة الملكية، تمييز متزايد ضد العسكريين"
  },
  "ch_goryeo_03": {
    "title": "تشكيل وتطور النظام العسكري",
    "theory": "عام 1170، قاد جونغ جونغ-بو وآخرون انقلاباً عسكرياً، مؤسسين النظام العسكري.\n\n• الأسباب: سوء حكم الملك أويجونغ، التمييز ضد العسكريين (حادثة بوهيونوون)\n• التطور: جونغ جونغ-بو ← غيونغ دي-سونغ ← يي أوي-مين ← تشوي تشونغ-هون\n• نظام تشوي: غيوجونغدوغام (أعلى سلطة)، سامبيولتشو (جيش خاص)، جونغبانغ (التحكم في التعيينات)\n• ثورات فلاحية: ثورة مانجوك، ثورة مانغي ومانغسوي\n• النتائج: ضعف السلطة الملكية، احتكار السلطة من قبل العسكريين"
  },
  "ch_goryeo_04": {
    "title": "المقاومة ضد المغول وسامبيولتشو",
    "theory": "في القرن الثالث عشر، قاومت غوريو الغزوات المغولية (يوان).\n\n• النقل إلى غانغهوا (1232): إرادة المقاومة للنظام العسكري، 39 عاماً من المقاومة\n• المقاومة الشعبية: قلعة تشورين (كيم يون-هو)، قلعة تشونغجو، قلعة غويجو\n• تريبيتاكا كوريانا: صلاة لصد المغول بقوة بوذا\n• العودة إلى غيغيونغ (1270): الملك وونجونغ، انهيار النظام العسكري\n• مقاومة سامبيولتشو: بي جونغ-سون، جيندو ← جزيرة جيجو، قُمعت عام 1273"
  },
  "ch_goryeo_05": {
    "title": "فترة تدخل يوان والعائلات القوية",
    "theory": "خلال فترة تدخل يوان (1270-1356)، عانت غوريو من التدخل الداخلي ليوان.\n\n• التدخل: إنشاء سكرتارية جونغدونغ، إرسال داروغاتشي، مطالب بالجزية والصقور\n• العائلة الملكية: زيجات مع أميرات يوان، ملوك نشأوا في يوان\n• تخفيض الألقاب: وانغ ← تشونغريول-وانغ، بيها ← جونها، 6 بو ← 4 سا\n• العائلات القوية: موالية ليوان، ملاك كبار للأراضي، سيطرة على دوبيونغأويساسا\n• التغييرات الاجتماعية: الموضة المغولية، إدخال القطن والبارود"
  },
  "ch_goryeo_06": {
    "title": "إصلاحات الملك غونغمين والعلماء الجدد",
    "theory": "اتبع الملك غونغمين (1351-1374) سياسة معادية ليوان وتعزيز السلطة الملكية.\n\n• السياسة المعادية ليوان: إلغاء سكرتارية جونغدونغ، استعادة سانغسونغ، التخلي عن ألقاب وتقويم يوان\n• الإصلاحات الداخلية: جونمينبيونجونغدوغام (استعادة أراضي العائلات القوية)، توظيف سيندون\n• العلماء الجدد: خريجو الامتحانات، كونفوشيون جدد، نقاد العائلات القوية\n• الحدود: غزوات العمائم الحمراء والقراصنة اليابانيين، فوضى سياسية بعد إزالة سيندون\n• يي سونغ-غي: الانسحاب من ويهوا-دو (1388)، التحالف مع العلماء الجدد"
  },
  "ch_goryeo_07": {
    "title": "اقتصاد غوريو",
    "theory": "كان لغوريو اقتصاد يركز على الزراعة وتجارة دولية متطورة.\n\n• النظام العقاري: جونسي-غوا (حقوق التحصيل للموظفين والعسكريين)، غونغأومجون (إرث للرتبة الخامسة وما فوق)\n• الزراعة: دورة سنتين مع 3 محاصيل، تطوير الأسمدة، نونغسانغجيبيو (دليل زراعي من يوان)\n• التجارة: أسواق غيغيونغ، بيوكراندو (ميناء دولي)، تجار من العرب (ديسيكغوكين)\n• الحرف: الحرف الرسمية، سو (إنتاج متخصص)\n• العملة: غونوون جونغبو، سبائك فضية (هوالغوك)، تداول محدود"
  },
  "ch_goryeo_08": {
    "title": "نظام الطبقات والمجتمع في غوريو",
    "theory": "كانت غوريو مجتمع طبقات مع أرستقراطيين وطبقة وسطى وفلاحين وعبيد.\n\n• الأرستقراطيون: عائلات كبيرة، عائلات قوية، احتكار الامتحانات والإيمسو\n• الطبقة الوسطى: هيانغني (إدارة محلية)، نامبان (طبقة عسكرية)، موظفون\n• الفلاحون: فلاحون (بيكجونغ)، أعباء ضريبية، سخرة وجزية\n• العبيد: عبيد (إيلتشونجوكتشون)، سكان هيانغ وبوغوك وسو\n• الخصائص: مكانة مرتفعة نسبياً للنساء، إمكانية إعادة زواج النساء الأرستقراطيات"
  },
  "ch_goryeo_09": {
    "title": "البوذية في غوريو",
    "theory": "في غوريو، كانت البوذية دين الدولة وأثرت على المجتمع بأكمله.\n\n• بوذية الدولة: يوندونغهوي وبالغوانهوي (احتفالات وطنية)، امتحانات رهبانية\n• المدارس: مدارس عقائدية (هوايوم، بوبسانغ)، مدرسة سون (جوغيجونغ)\n• أويتشون: تأسيس مدرسة تشونتي، غيوغوانغيومسو، تجميع سوكجانغغيونغ\n• جينول: إعادة تنظيم جوغيجونغ، جونغهييسانغسو، دونو جومسو، حركة إصلاح سوسونسا\n• تريبيتاكا: أول تريبيتاكا (صلاة لصد الخيتان)، تريبيتاكا كوريانا (صلاة لصد المغول)"
  },
  "ch_goryeo_10": {
    "title": "الكونفوشية والمؤلفات التاريخية في غوريو",
    "theory": "في نهاية غوريو، أُدخلت الكونفوشية الجديدة وأصبحت الأساس الأيديولوجي للعلماء الجدد.\n\n• الكونفوشية: غوكجاغام (أعلى مؤسسة تعليمية)، تنظيم الامتحانات\n• الكونفوشية الجديدة: أدخلها آن هيانغ (الملك تشونغنيول)، نقلها بيك إي-جونغ، يي جيهيون، يي سيك، جونغ مونغجو\n• المؤلفات التاريخية: سامغوك ساغي (كيم بو-سيك، أقدم عمل تاريخي موجود، منظور كونفوشي)\n• سامغوك يوسا (إيليون)، جيوانغ أونغي (يي سونغهيو): روايات دانغون، الوعي الوطني\n• السجلات الملكية السبعة: لم تعد موجودة"
  },
  "ch_goryeo_11": {
    "title": "علوم وطباعة غوريو",
    "theory": "امتلكت غوريو تقنيات طباعة ومعادن على مستوى عالمي.\n\n• الطباعة: تريبيتاكا كوريانا (أكبر مجموعة ألواح خشبية موجودة)، جيكجي (أقدم كتاب مطبوع بحروف معدنية موجود)\n• السيلادون بالترصيع: تطور في القرن الثاني عشر، تقنية أصيلة لغوريو\n• البوصلة: تطوير الملاحة\n• البارود: تشوي مو-سون، إنشاء مكتب الأسلحة النارية، هزيمة القراصنة اليابانيين\n• أخرى: رصد فلكي، بحث تقويمي، تطور طبي"
  },
  "ch_goryeo_12": {
    "title": "فنون غوريو",
    "theory": "طورت غوريو فنوناً أصيلة قائمة على الثقافة البوذية والأرستقراطية.\n\n• السيلادون: سيلادون نقي ← سيلادون بالترصيع (القرن 12)، مزهرية ميبيونغ بنقش السحب والكركي\n• الرسم البوذي: ألوان زاهية، غوانغيونغبيونسانغدو\n• العمارة: طراز جوسيمبو (غونغناكجون في بونغجونغسا، موريانغسوجون في بوسوكسا)\n• الباغودات: أنماط متنوعة (باغودا ثمانية الأضلاع من 9 طوابق في وولجونغسا، باغودا من 10 طوابق في غيونغتشونسا)\n• الحرف: تقنية ترصيع الفضة، لكر مرصع بالصدف"
  },
  "ch_joseon_early_01": {
    "title": "تأسيس ونظام حكم جوسون",
    "theory": "عام 1392، أسس يي سونغ-غي جوسون. كانت الكونفوشية الجديدة أيديولوجية الحكم.\n\n• التأسيس: الانسحاب من ويهوا-دو (1388) ← تنفيذ قانون غواجون ← تأسيس جوسون\n• الملك تيجو: نقل العاصمة إلى هانيانغ، بناء قصر غيونغبوك\n• الملك تيجونغ: نظام التقرير المباشر لـ 6 وزارات، إلغاء الجيوش الخاصة، قانون لوحات الهوية\n• نظام الحكم: أويجونغبو و6 وزارات، 3 مكاتب (ساهونبو، ساغانوون، هونغمونغوان)\n• الإدارة المحلية: 8 مقاطعات، إرسال حكام وقضاة، السيطرة على الهيانغني"
  },
  "ch_joseon_early_02": {
    "title": "سياسة من سيجونغ إلى سونغجونغ",
    "theory": "أسس ملوك جوسون الأوائل السياسة الكونفوشية وطوروا الثقافة.\n\n• الملك سيجونغ: جيبهيونجون، هونمينجونغأوم، إنشاء 4 حاميات و6 مراكز، نظام مداولات أويجونغبو\n• الملك سيجو: إلغاء جيبهيونجون، نظام التقرير المباشر لـ 6 وزارات، بدء تجميع غيونغغوك ديجون\n• الملك سونغجونغ: إكمال وإصدار غيونغغوك ديجون، إنشاء هونغمونغوان، توظيف الساريم\n• الاتجاه السياسي: التوازن بين السلطة الملكية والوزارية\n• جيبهيونجون: مؤسسة البحث الأكاديمي للملك سيجونغ"
  },
  "ch_joseon_early_03": {
    "title": "صعود الساريم والتطهيرات",
    "theory": "بعد الملك سونغجونغ، نما الساريم لكنهم دخلوا في صراع مع الهونغو، مما تسبب في التطهيرات.\n\n• الساريم: سلالة كيم جونغ-جيك، قاعدة ريفية، سووون وهيانغياك، أهمية الدراسة الأخلاقية\n• الهونغو: القوى المُكرَّمة للملك سيجو، السيطرة على السياسة المركزية\n• التطهيرات الأربع الكبرى: موأو (1498)، غابجا (1504)، غيميو (1519)، أولسا (1545)\n• تطهير موأو: نص جنائزي لكيم جونغ-جيك، الملك يونسانغون\n• تطهير غيميو: إصلاحات جو غوانغجو (هيولليانغكوا، إلغاء سوغيوكسو)، الملك جونغجونغ"
  },
  "ch_joseon_early_04": {
    "title": "بداية سياسة الفصائل",
    "theory": "في عهد الملك سونجو، بدأ الساريم الحاكم سياسة الفصائل.\n\n• تشكيل الفصائل: مسألة تعيين إيجو جونرانغ، دونغين (كيم هيو-وون) وسوين (سيم أوي-غيوم)\n• انقسام الدونغين: تمرد جونغ يو-ريب ← نامين (معتدلون) وبوكين (متطرفون)\n• سوين: سلالة يي إي وسونغ هون، منطقة غيهو\n• دونغين: سلالة يي هوانغ، منطقة يونغنام\n• الخصائص: قاعدة أكاديمية وإقليمية، نقد وسيطرة متبادلة، أهمية الرأي العام"
  },
  "ch_joseon_early_05": {
    "title": "حرب إيمجين",
    "theory": "عام 1592، اندلعت حرب إيمجين إثر الغزو الياباني لجوسون.\n\n• الأسباب: طموحات تويوتومي هيديوشي القارية\n• المرحلة الأولى: سقوط بوسان ودونغني، سقوط هانسونغ في 20 يوماً\n• البحرية: إنجازات يي سون-سين (معارك هانسان-دو وميونغنيانغ)\n• جيوش العدالة: غواك جي-أو، جو هون، غو غيونغ-ميونغ، الأستاذ سوسان، الأستاذ ساميونغ\n• النتائج: تدمير الأراضي، نقص السكان، نهب ثقافي، تطور ثقافي لليابان"
  },
  "ch_joseon_early_06": {
    "title": "الغزو المانشوري ونظرية الحملة شمالاً",
    "theory": "عام 1636، اندلع الغزو المانشوري إثر غزو تشينغ.\n\n• غزو جونغميو (1627): غزو جين اللاحقة، إقامة علاقات أخوية\n• الغزو المانشوري (1636): غزو تشينغ، المقاومة في قلعة نامهان، إذلال سامجوندو\n• النتائج: الخضوع لتشينغ، الأمراء سوهيون وبونغريم رهائن، نصب سامجوندو\n• نظرية الحملة شمالاً: الملك هيوجونغ وسونغ سي-يول، مشروع معاقبة تشينغ، لم يتحقق\n• التأثير: وعي معاد لتشينغ، نظرية التعلم من الشمال (تبني ثقافة تشينغ)"
  },
  "ch_joseon_early_07": {
    "title": "اقتصاد جوسون المبكر",
    "theory": "أسس جوسون المبكر نظاماً اقتصادياً يركز على الزراعة.\n\n• النظام العقاري: قانون غواجون (أراضي غيونغغي)، قانون جيكجون (الملك سيجو)، نظام غوانسو-غوانغوب (الملك سونغجونغ)\n• الزراعة: نونغسا جيكسول (الملك سيجونغ)، نظاما تصنيف يونبون 9 دونغ وجونبون 6 دونغ، دورة سنتين مع 3 محاصيل\n• التجارة: أسواق سيجون (جونغنو)، إشراف غيونغسيسو، تداول محدود للجوهوا وجوسون تونغبو\n• الحرف: مركزة حول الحرف الرسمية، نظام تسجيل الحرفيين\n• المناجم: استخراج الفضة والنحاس، تكرير الذهب والفضة"
  },
  "ch_joseon_early_08": {
    "title": "نظام الطبقات والمجتمع في جوسون المبكر",
    "theory": "كانت جوسون مجتمع طبقات مع يانغبان وطبقة وسطى وفلاحين وعبيد.\n\n• يانغبان: موظفون مدنيون وعسكريون، امتحانات وإيمسو، امتيازات إعفاء\n• الطبقة الوسطى: موظفون تقنيون (مترجمون، أطباء، رياضيون)، أبناء المحظيات\n• الفلاحون: فلاحون، تجار، حرفيون، أعباء ضريبية وسخرة\n• العبيد: عبيد (إيلتشونجوكتشون)، بيكجونغ، مهرجون، إلخ.\n• العائلة: تعزيز النظام البطريركي، تجميع الأنساب، نشر نظام جونغبوب"
  },
  "ch_joseon_early_09": {
    "title": "الكونفوشية الجديدة والتعليم في جوسون المبكر",
    "theory": "كانت الكونفوشية الجديدة أيديولوجية الحكم والمعيار الاجتماعي لجوسون.\n\n• الكونفوشية الجديدة: نظرية اللي والتشي (ثنائية يي هوانغ، أحادية يي إي)\n• المؤسسات التعليمية: سونغغيونغوان (أعلى تعليم)، 4 مدارس (ثانوية)، هيانغغيو (محلية)\n• سووون: مؤسسات تعليمية للساريم، أول سووون بيكوندونغ من جو سي-بونغ\n• الامتحانات: امتحانات مدنية وعسكرية وتقنية، سينغوون وجينسا (امتحانات تمهيدية)\n• الطقوس: غاريه (طقوس تشو شي)، نشر احتفالات البلوغ والزواج والجنازة والتذكار"
  },
  "ch_joseon_early_10": {
    "title": "المؤلفات التاريخية والجغرافية في جوسون المبكر",
    "theory": "أجرت جوسون مشاريع تجميع متنوعة تحت إدارة الدولة.\n\n• المؤلفات التاريخية: سجلات جوسون (اليونسكو)، غوريوسا وغوريوسا جوليو\n• المؤلفات الجغرافية: دونغغوك يوجي سونغنام، سينجونغ دونغغوك يوجي سونغنام\n• القوانين: غيونغغوك ديجون (الملك سونغجونغ)، ديجون سونغنوك وديجون هوسونغنوك\n• المؤلفات الطقسية: غوكجو أوريوي (من سيجونغ إلى سونغجونغ)\n• المؤلفات الزراعية: نونغسا جيكسول (الملك سيجونغ)"
  },
  "ch_joseon_early_11": {
    "title": "علوم وتقنيات جوسون المبكر",
    "theory": "شهدت حقبة الملك سيجونغ عصراً ذهبياً للعلوم والتقنيات.\n\n• الفلك: هونتشونأوي، غانأوي، أنغبويلغو، جاغيونغنو (جانغ يونغ-سيل)\n• مقياس المطر: أول أداة لقياس هطول الأمطار في العالم\n• الطباعة: حروف غيميجا وغابينجا (حروف معدنية)، الملك سيجونغ\n• الخرائط: هونيل غانغني يوكدي غوكدو جيدو (أقدم خريطة عالمية موجودة)\n• الطب: هيانغياك جيبسونغبانغ (الملك سيجونغ)، أويبانغ يوتشوي، دونغأوي بوغام (الملك غوانغهيغون)"
  },
  "ch_joseon_early_12": {
    "title": "فنون جوسون المبكر",
    "theory": "عكست فنون جوسون المبكر الأيديولوجية الكونفوشية الجديدة.\n\n• الرسم: آن غيون (حلم الرحلة إلى أرض الخوخ)، غانغ هوي-آن، تطور الرسم الأدبي\n• الخزف: بونتشونغ ← البورسلين الأبيض (القرن 16)، جمال بسيط ورصين\n• العمارة: عمارة كونفوشية (قصور، جونغميو)، سونغنييمون، قصر غيونغبوك\n• الموسيقى: تنظيم الموسيقى الطقسية (باك يون)، تدوين جونغغانبو (الملك سيجونغ)\n• الحرف: أعمال الخشب، لكر مرصع بالصدف"
  },
  "ch_joseon_late_01": {
    "title": "انحطاط سياسة الفصائل",
    "theory": "في نهاية القرن السابع عشر، انحطت سياسة الفصائل إلى احتكار حزب واحد.\n\n• جدل طقوس الجنازة: مسألة الحداد بعد وفاة الملك هيوجونغ، سوين ضد نامين\n• تغيير غيونغشين (1680): إبعاد النامين، سلطة السوين\n• تغيير غيسا (1689): إبعاد السوين، سلطة النامين، إعدام سونغ سي-يول\n• تغيير غابسول (1694): إبعاد النامين، سلطة السوين (نورون وسورون)\n• النتائج: فقدان وظيفة السيطرة المتبادلة، احتكار حزب واحد"
  },
  "ch_joseon_late_02": {
    "title": "سياسة التوازن",
    "theory": "نفذ الملكان يونغجو وجونغجو سياسة التوازن للتغلب على مساوئ الفصائل.\n\n• الملك يونغجو: توازن معتدل (توظيف المعتدلين)، إضعاف سلطة إيجو جونرانغ، قانون غيونيوك\n• الملك جونغجو: توازن صارم (قائم على الكفاءة)، إنشاء غيوجانغغاك، جانغيونغيونغ، قلعة سوون هواسونغ\n• إصلاحات جونغجو: نظام تشوغيمونسين، السماح لأبناء المحظيات، إلغاء امتيازات الأسواق (سينهيتونغونغ)\n• الحدود: نمو العائلات القوية، أساس نفوذ العشائر الأمومية\n• الأهمية: تعزيز السلطة الملكية، نهضة ثقافية"
  },
  "ch_joseon_late_03": {
    "title": "سياسة العشائر القوية",
    "theory": "بعد الملك سونجو، احتكرت العشائر الأمومية السلطة في سياسة العشائر القوية.\n\n• العشائر القوية: كيم من أندونغ (الملك سونجو)، جو من بونغيانغ (الملكان هونجونغ وتشولجونغ)\n• فوضى الإدارات الثلاث: فوضى في الضريبة العقارية والخدمة العسكرية ونظام قروض الحبوب\n• ثورات فلاحية: ثورة هونغ غيونغ-ني (1811)، ثورة إيمسول الفلاحية (1862، جينجو)\n• اضطرابات اجتماعية: نبوءات وتوقعات شعبية، ثورات متكررة\n• النتائج: ضعف السلطة الملكية، تراخي الانضباط الوطني، تأخر التحديث"
  },
  "ch_joseon_late_04": {
    "title": "التغييرات الاقتصادية في جوسون المتأخر",
    "theory": "في جوسون المتأخر، تطور اقتصاد السوق والنقد.\n\n• الزراعة: انتشار الشتل، مزارع كبيرة (فلاحون أغنياء)، محاصيل تجارية (تبغ، جينسنغ، قطن)\n• الحرف: الخصخصة، نظام الائتمان (توفير المواد الخام من التجار)\n• التجارة: تجار خاصون (خارج الأسواق الرسمية)، تجار سونغ ومان وغيسونغ، أسواق كل 5 أيام\n• العملة: تداول وطني لسانغبيونغ تونغبو (الملك سوكجونغ)\n• المناجم: نظام امتيازات التعدين (إدارة خاصة للمناجم)"
  },
  "ch_joseon_late_05": {
    "title": "اضطراب نظام الطبقات في جوسون المتأخر",
    "theory": "في جوسون المتأخر، زعزع نظام الطبقات وظهرت تغييرات اجتماعية.\n\n• طبقة اليانغبان: زيادة اليانغبان المتدهورين، يانغبان ريفيون وفقراء\n• الطبقة الوسطى: حركات ارتقاء اجتماعي، مطالبة بحقوق الامتحانات، عرائض\n• أبناء المحظيات: مطالبة بالإذن، الوصول إلى مناصب غومسوغوان في غيوجانغغاك\n• الطبقة الفلاحية: ارتقاء اجتماعي عبر شراء الألقاب وشهادات الجدارة\n• العبيد: تحرير العبيد العموميين (الملك سونجو، 1801)، انخفاض عدد العبيد"
  },
  "ch_joseon_late_06": {
    "title": "تطور السيلهاك",
    "theory": "في القرنين السابع عشر والثامن عشر، تطور السيلهاك (الدراسات العملية) المُروِّج للإصلاحات الاجتماعية.\n\n• مدرسة غيونغسي تشيونغ (زراعية): يو هيونغ-وون (بانغيي سوروك)، يي إيك (سونغهو ساسول)، جونغ ياك-يونغ (مونغمين سيمسو، غيونغسي يوبيو)\n• مدرسة إيونغ هوسينغ (تجارية): يو سو-وون، باك جي-وون (يوميات ريهي)، باك جي-غا (خطاب التعلم من الشمال)، هونغ دي-يونغ\n• جونغ ياك-يونغ: رافعة (قلعة سوون هواسونغ)، نظاما يوجونجي وجونغجونجي، مونغمين سيمسو\n• التأثير: إثراء وطني وتعزيز عسكري، استقرار الشعب، تشكيل الوعي الحديث\n• الحدود: لم تتبناه الطبقة الحاكمة"
  },
  "ch_joseon_late_07": {
    "title": "تطور الدراسات الوطنية",
    "theory": "في جوسون المتأخر، زاد الاهتمام بالثقافة والتاريخ الوطنيين.\n\n• الدراسات اللغوية: سين غيونغ-جون (هونمينجونغأوم أونهي)، يو هوي (أونمونجي)\n• المؤلفات التاريخية: آن جونغ-بوك (دونغسا غانغموك)، يي غونغ-إيك (يولليوسيل غيسول)، هان تشي-يون (هيدونغ يوكسا)\n• المؤلفات الجغرافية: جونغ سانغ-غي (دونغغوك جيدو)، كيم جونغ-هو (ديدونغ يوجيدو)\n• الموسوعات: يي إيك (سونغهو ساسول)، يي دوك-مو (تشونغجانغ غوانجون سو)\n• الخصائص: بحث تجريبي وموضوعي، استكشاف الهوية الوطنية"
  },
  "ch_joseon_late_08": {
    "title": "تطور الثقافة الشعبية",
    "theory": "في جوسون المتأخر، تطورت الثقافة الشعبية بفضل التحسن الاقتصادي للطبقات الدنيا.\n\n• الأدب: روايات بالهانغول (هونغ غيل-دونغ، تشونهيانغجون)، بانسوري، ساسول سيجو\n• الرسم: لوحات النوع (كيم هونغ-دو، سين يون-بوك)، لوحات شعبية، مناظر واقعية (جونغ سون)\n• العروض: رقصات الأقنعة (أقنعة بونغسان)، بانسوري، دمى كوكدو\n• الخصائص: سخرية من اليانغبان، نقد اجتماعي، فكاهة\n• كيم جونغ-هوي: خط تشوسا، سيهان-دو (لوحة أدبية)"
  },
  "ch_joseon_late_09": {
    "title": "علوم وتقنيات جوسون المتأخر",
    "theory": "في جوسون المتأخر، تطورت العلوم والتقنيات تحت تأثير السيلهاك.\n\n• الخرائط: جونغ سانغ-غي (دونغغوك جيدو، مقياس 100 لي)، كيم جونغ-هو (ديدونغ يوجيدو، حفر خشبي)\n• الطب: هو جون (دونغأوي بوغام)، جونغ ياك-يونغ (ماغوا هويتونغ)\n• الفلك: هونغ دي-يونغ (نظرية دوران الأرض)، تبني الفلك الغربي\n• الزراعة: باك سي-دانغ (سيكغيونغ)، ابتكارات تقنية زراعية\n• التقنيات: رافعة (جونغ ياك-يونغ)، عجلة مائية (روجت لها مدرسة التعلم من الشمال)"
  },
  "ch_joseon_late_10": {
    "title": "ظهور أديان جديدة",
    "theory": "في جوسون المتأخر، ظهرت أديان وأفكار جديدة.\n\n• الكاثوليكية: أُدخلت في القرن 17 كدراسات غربية، تعميد يي سونغ-هون (1784)، اضطهادات سينهي وغيهي\n• دونغهاك: تأسست عام 1860 على يد تشوي جي-أو، إينيتشون (الإنسان هو السماء)، معاداة الإقطاع والإمبريالية\n• الأفكار النبوية: جونغامروك، نبوءات وتوقعات شعبية\n• الإيمان بمايتريا: أمل خلاص الشعب\n• الخصائص: نقد التناقضات الاجتماعية، فكر مساواتي"
  },
  "ch_modern_01": {
    "title": "إصلاحات الديوونغون",
    "theory": "أجرى الديوونغون هونغسون إصلاحات لتعزيز السلطة الملكية واستقرار الشعب.\n\n• تعزيز السلطة الملكية: إعادة بناء قصر غيونغبوك، إلغاء بيبيونسا، استعادة سامغونبو\n• نهاية سياسة العشائر: إبعاد عشيرة كيم من أندونغ، توظيف المواهب\n• إصلاحات الإدارات الثلاث: هوبوجي (ضريبة عسكرية لليانغبان)، ساتشانغجي (استبدال قروض الحبوب)\n• إلغاء السووون: الإبقاء على 47 فقط، إلغاء امتيازات الإعفاء\n• رفض العلاقات التجارية: الحملة الفرنسية (1866)، الحملة الأمريكية (1871)، نصب المقاومة"
  },
  "ch_modern_02": {
    "title": "الانفتاح والمعاهدات غير المتكافئة",
    "theory": "عام 1876، انفتحت جوسون بمعاهدة غانغهوا.\n\n• حادثة أونيو (1875): سفينة حربية يابانية تنتهك مياه غانغهوا\n• معاهدة غانغهوا (1876): أول معاهدة حديثة، معاهدة غير متكافئة\n  - فتح بوسان ووونسان وإنتشون، حق خارج الإقليم، حقوق المسح الساحلي\n• معاهدة شوفيلت (1882): شرط الدولة الأكثر رعاية، وساطة\n• معاهدات لاحقة مع بريطانيا وألمانيا وروسيا وفرنسا\n• التأثير: فرصة للتحديث، بداية الاستغلال الاقتصادي"
  },
  "ch_modern_03": {
    "title": "حركة التحديث والمقاومة المحافظة",
    "theory": "بعد الانفتاح، تصادم الإصلاحيون والمحافظون.\n\n• الإصلاحيون: الانفتاح، تبني الثقافة الغربية، التحديث\n  - إصلاحيون معتدلون (دونغدو سوغي): كيم هونغ-جيب، أو يون-جونغ\n  - إصلاحيون راديكاليون (الحضارة): كيم أوك-غيون، باك يونغ-هيو، هونغ يونغ-سيك\n• المقاومة المحافظة: الدفاع عن الكونفوشية، رفض القوى الأجنبية\n  - يي هانغ-نو، غي جونغ-جين، تشوي إيك-هيون (نظرية وحدة اليابان والغرب)\n• تونغني غيموا-مون: هيئة تعزيز سياسات التحديث"
  },
  "ch_modern_04": {
    "title": "تمرد إيمو وانقلاب غابسين",
    "theory": "في الثمانينيات، مرت جوسون بفترة اضطرابات سياسية.\n\n• تمرد إيمو (1882): ثورة الجنود التقليديين، عودة الديوونغون للسلطة\n  - تدخل تشينغ، اختطاف الديوونغون إلى الصين، معاهدة جيمولبو\n• انقلاب غابسين (1884): انقلاب الإصلاحيين الراديكاليين، 14 مادة إصلاحية\n  - 3 أيام في السلطة، فشل بتدخل تشينغ، نفي كيم أوك-غيون\n• النتائج: تعزيز تدخل تشينغ، نظرية تحييد جوسون\n• معاهدتا هانسونغ وتيانجين: توازن القوى بين اليابان وتشينغ"
  },
  "ch_modern_05": {
    "title": "حركة فلاحي دونغهاك",
    "theory": "عام 1894، قاد فلاحو دونغهاك حركة معادية للإقطاع والإمبريالية.\n\n• السياق: فوضى الإدارات الثلاث، الاستغلال الاقتصادي الياباني، حركة إعادة اعتبار المؤسس\n• الانتفاضة الأولى: ثورة غوبو (جون بونغ-جون)، انتصارات هوانغتوهيون وهوانغنيونغتشون\n• هدنة جونجو: 12 مادة إصلاحية، إنشاء جيبغانغسو\n• الانتفاضة الثانية: مقاومة احتلال اليابان لقصر غيونغبوك، هزيمة في أوغومتشي\n• الأهمية: معاداة الإقطاع والإمبريالية، التأثير على إصلاحات غابو"
  },
  "ch_modern_06": {
    "title": "إصلاحات غابو وأولمي",
    "theory": "من 1894 إلى 1896، أُجريت إصلاحات حديثة.\n\n• إصلاحات غابو (1894): غونغوك غيموتشو، إلغاء الامتحانات، إلغاء نظام الطبقات\n  - معيار الفضة، توحيد الأوزان والمقاييس، إنشاء محاكم\n• إصلاحات أولمي (1895): التقويم الشمسي، مرسوم قص الشعر، إنشاء مدارس ابتدائية\n• حادثة أولمي (1895): اغتيال الملكة ميونغسونغ من قبل اليابان\n• اللجوء إلى المفوضية الروسية (1896): هروب الملك غوجونغ إلى المفوضية الروسية\n• الحدود: بقيادة اليابان، مقاومة شعبية (جيش العدالة أولمي)"
  },
  "ch_modern_07": {
    "title": "نادي الاستقلال والإمبراطورية الكورية",
    "theory": "في نهاية التسعينيات، تطورت حركات الاستقلال والتحديث.\n\n• نادي الاستقلال (1896): سو جي-بيل، صحيفة دونغنيب سينمون، بناء بوابة الاستقلال\n  - جمعية مانمين غونغدونغهوي، حركة برلمانية، 6 مواد هونأوي\n• الإمبراطورية الكورية (1897): تتويج الملك غوجونغ إمبراطوراً، إصلاحات غوانغمو\n  - غوبونسينتشا (التحديث القائم على التقاليد)\n  - مسح الأراضي، إصدار سندات الملكية، إنشاء وونسوبو\n• الحدود: إصلاحات محافظة، تفاقم الاستغلال الأجنبي"
  },
  "ch_modern_08": {
    "title": "حركة جيوش العدالة المعادية لليابان",
    "theory": "بعد الانفتاح، قاومت حركات جيوش العدالة الغزو الياباني.\n\n• جيش العدالة أولمي (1895): مقاومة مرسوم الشعر واغتيال الملكة، بقيادة العلماء\n  - يو إين-سوك، يي سو-أونغ وآخرون\n• جيش العدالة أولسا (1905): مقاومة معاهدة أولسا، مين جونغ-سيك، تشوي إيك-هيون\n• جيش العدالة جونغمي (1907): مقاومة حل الجيش، انضمام الجنود المُسرَّحين\n  - جيش الـ 13 مقاطعة (يي إين-يونغ)، عملية اقتحام سيول\n• الحدود: أُضعف بحملة التهدئة اليابانية في الجنوب (1909)"
  },
  "ch_modern_09": {
    "title": "حركة الإصلاح الوطني",
    "theory": "تطورت حركة تهدف لاستعادة السيادة عبر تطوير القدرات الوطنية.\n\n• منظمات: جمعية بوآن (معارضة امتيازات الأراضي البور)، هونجونغ يونغو-هوي، ديهان جاغانغهوي\n• سينمينهوي (1907): آن تشانغ-هو، يانغ غي-تاك، جمعية سرية، هدف جمهوري\n  - مدرستا أوسان ودييسونغ، مكتبة تيغوك، شركة جاغي\n• التعليم: إنشاء مدارس خاصة، تعليم وطني\n• الصحافة: هوانغسونغ سينمون، ديهان مييل سينبو (بيثيل)، حركة سداد الدين الوطني\n• الحدود: التركيز على تطوير القدرات، القمع الياباني"
  },
  "ch_modern_10": {
    "title": "عملية فقدان السيادة",
    "theory": "اغتصبت اليابان سيادة جوسون تدريجياً.\n\n• معاهدة أولسا (1905): حرمان من الحقوق الدبلوماسية، إنشاء الإقامة العامة (إيتو هيروبومي)\n• مبعوثون سريون إلى لاهاي (1907): يي جون، يي سانغ-سول، يي وي-جونغ، تنازل قسري لغوجونغ\n• معاهدة جونغمي 7 مواد (1907): حرمان من الشؤون الداخلية، حل الجيش\n• مذكرة غيو (1909): حرمان من الحقوق القضائية والشرطية\n• الضم (29 أغسطس 1910): معاهدة ضم اليابان-كوريا، فقدان السيادة\n• المقاومة: اغتيال إيتو هيروبومي من قبل آن جونغ-غون (1909)"
  },
  "ch_japanese_occupation_01": {
    "title": "الحكم العسكري في العقد 1910",
    "theory": "في العقد 1910، مارست اليابان حكماً عسكرياً بالدرك.\n\n• الحكومة العامة لكوريا: حاكم عام (جنرال جيش أو بحرية)، سيطرة تشريعية وقضائية وتنفيذية\n• شرطة الدرك: سلطة الحكم الموجز (العقوبة البدنية)، مراقبة الكوريين\n• مسح الأراضي (1910-1918): نظام الإعلان، مصادرة الأراضي غير المُعلَن عنها\n  - إنشاء شركة التنمية الشرقية، زيادة الملاك اليابانيين\n• قانون الشركات: نظام الترخيص، قمع رأس المال الوطني\n• التعليم: تعليم التجهيل، تقييد تدريس اللغة الكورية"
  },
  "ch_japanese_occupation_02": {
    "title": "الحكم الثقافي في العقد 1920",
    "theory": "بعد حركة 1 مارس، نفذت اليابان حكماً ثقافياً (سياسة تهدئة خادعة).\n\n• الشرطة العادية: إلغاء الدرك، في الواقع زيادة الأفراد والمعدات الشرطية\n• الصحافة والاجتماعات: ترخيص تشوسون إيلبو ودونغ-آ إيلبو (مع رقابة)، أنشطة جمعية اللغة الكورية\n• التعليم: ترخيص مؤسسات جامعية (جامعة كييجو الإمبراطورية، 1924)، توسيع المدارس الابتدائية\n• خطة زيادة إنتاج الأرز: زيادة الإنتاج للتصدير لليابان، نقص الغذاء في كوريا\n• الحدود: تشكيل متعاونين، تقسيم الأمة"
  },
  "ch_japanese_occupation_03": {
    "title": "سياسة الاستيعاب في العقدين 1930-40",
    "theory": "منذ الثلاثينيات، فرضت اليابان سياسة استيعاب لدعم المجهود الحربي.\n\n• التياباُن: قسم الرعية الإمبراطورية، العبادة الإجبارية في الأضرحة الشنتوية، الانحناء للقصر الإمبراطوري\n• تدمير الثقافة الوطنية: حظر اللغة الكورية، قمع جمعية اللغة الكورية (1942)\n• تغيير الأسماء اليابانية (1940): فرض أسماء يابانية\n• الاستغلال البشري: نظام التطوع ← التجنيد، طلاب متطوعون، عمل قسري\n• استغلال النساء: تعبئة قسرية كـ\"نساء راحة\" للجيش الياباني\n• الاستغلال المادي: نظام المصادرة، مصادرة قسرية للمعادن"
  },
  "ch_japanese_occupation_04": {
    "title": "حركة 1 مارس",
    "theory": "كانت حركة 1 مارس 1919 أكبر حركة وطنية تحت الاحتلال الياباني.\n\n• السياق: مبدأ ويلسون لتقرير المصير، إعلان استقلال 8 فبراير (طوكيو)، شائعات تسميم غوجونغ\n• التطور: 1 مارس في حديقة تابغول، قراءة إعلان الاستقلال، مظاهرات مانسي\n  - من طلاب ورجال دين إلى جميع الطبقات، توسع وطني ثم دولي (غاندو، بريموريي)\n• القمع الياباني: مجزرة جيآم-ري، حريق قلعة سوون\n• الأهمية: تأسيس الحكومة المؤقتة، الانتقال من اللاعنف إلى الكفاح المسلح\n• التأثير: حركة 4 مايو في الصين، الحركة اللاعنفية في الهند"
  },
  "ch_japanese_occupation_05": {
    "title": "الحكومة المؤقتة لجمهورية كوريا",
    "theory": "عام 1919، أُسست الحكومة المؤقتة لجمهورية كوريا في شنغهاي.\n\n• التأسيس: شنغهاي (حكومة موحدة)، نظام جمهوري ديمقراطي، الرئيس يي سونغ-مان\n• الأنشطة: نظام يونتونغجي ومكتب النقل، صحيفة دونغنيب سينمون، مكتب التأريخ\n• الأزمة: عزل يي سونغ-مان، انقسام في المؤتمر الوطني للممثلين (1923)\n• قيادة كيم غو: الفيلق الوطني الكوري، اغتيال يون بونغ-غيل (1932)\n• النقل إلى تشونغتشينغ (1940): إنشاء جيش التحرير الكوري، إعلان الحرب على اليابان\n• الأهمية: مركز حركة الاستقلال، تقليد جمهوري ديمقراطي"
  },
  "ch_japanese_occupation_06": {
    "title": "الكفاح المسلح والفيلق الوطني الكوري",
    "theory": "منذ العشرينيات، تطورت أعمال مسلحة فردية.\n\n• فيلق العدالة (1919): كيم وون-بونغ، سين تشي-هو (إعلان الثورة الكورية)، كفاح عنيف\n  - باك جي-هيوك (مركز شرطة بوسان)، كيم إيك-سانغ (الحكومة العامة)، نا سوك-جو (شركة التنمية الشرقية)\n• الفيلق الوطني الكوري (1931): نظمه كيم غو، عمليات خاصة\n  - يي بونغ-تشانغ: هجوم بالقنابل على الإمبراطور الياباني (1932، فشل)\n  - يون بونغ-غيل: هجوم في حديقة هونغكو في شنغهاي (1932)، تصفية جنرالات يابانيين\n• الأهمية: إظهار إرادة الاستقلال، محفز للدعم الصيني"
  },
  "ch_japanese_occupation_07": {
    "title": "حرب الاستقلال المسلحة",
    "theory": "منذ العشرينيات، تطورت حرب استقلال مسلحة في منشوريا والصين.\n\n• معركة بونغودونغ (1920): هونغ بوم-دو وجيش الاستقلال الكوري، انتصار كبير على الجيش الياباني\n• انتصار تشونغسان-ري (1920): كيم جوا-جين والإدارة العسكرية الشمالية، أكبر انتصار\n• مجزرة غاندو (1920): مجزرة كوريين في غاندو من قبل الجيش الياباني\n• حادثة سفوبودني (1921): تضحية مقاتلي الاستقلال من قبل الجيش الأحمر السوفياتي\n• توحيد الحكومات الثلاث: تشاموي-بو، جونغوي-بو، سينمين-بو ← غوكمين-بو، هيوكسين أويهوي\n• جيش التحرير الكوري (1940): تحت الحكومة المؤقتة، التحضير لعملية التسلل"
  },
  "ch_japanese_occupation_08": {
    "title": "الحركات الاجتماعية والاقتصادية الوطنية",
    "theory": "تحت الاحتلال الياباني، تطورت حركات اجتماعية واقتصادية متنوعة.\n\n• حركة المنتجات الوطنية (1920): جو مان-سيك، استخدام المنتجات المحلية، \"حياتي بمنتجاتي\"\n• حركة الجامعة الوطنية (1922): يي سانغ-جي، جمع التبرعات، عرقلة يابانية\n• الحركة الفلاحية: نزاعات المزارعة (نزاع مزارعة أمتي-دو)\n• الحركة العمالية: إضراب وونسان العام (1929)، الاتحاد العام للعمال الكوريين\n• سينغانهوي (1927): حزب وطني موحد، تحالف يسار-يمين، دعم حركة طلاب غوانغجو"
  },
  "ch_japanese_occupation_09": {
    "title": "حركة الحفاظ على الثقافة الوطنية",
    "theory": "تحت الاحتلال الياباني، استمرت جهود الحفاظ على الثقافة والهوية الوطنية.\n\n• الدراسات اللغوية: جمعية اللغة الكورية (قواعد الإملاء الموحدة للهانغول، اللغة المعيارية)، تأسيس يوم الهانغول\n• الدراسات التاريخية: باك أون-سيك (تاريخ كوريا المؤلم)، سين تشي-هو (التاريخ القديم لكوريا)، تأريخ قومي\n• حركة الدراسات الكورية: جونغ إين-بو (الدراسات الكورية)، مون إيل-بيونغ، آن جي-هونغ\n• التعليم: مدارس وطنية خاصة (أوسان، دييسونغ)، حركة المدارس الليلية\n• الدين: تشوندوغيو، دييجونغغيو، البوذية الوون، إيقاظ الوعي الوطني"
  },
  "ch_japanese_occupation_10": {
    "title": "أنشطة الكوريين في الخارج",
    "theory": "تحت الاحتلال الياباني، شارك الكوريون في الخارج أيضاً في حركة الاستقلال.\n\n• منشوريا: سوغاندو (غيونغهاكسا، مدرسة سينهونغ العسكرية)، بوكغاندو (مدرسة ميونغدونغ، مجزرة غاندو)\n• بريموريي: غوونأوبوي، الحكومة العسكرية لتحرير كوريا، حادثة سفوبودني\n• أمريكا: الجمعية الوطنية الكورية، باك يونغ-مان (تدريب عسكري)، يي سونغ-مان (أنشطة دبلوماسية)\n• هاواي: العمل في مزارع قصب السكر، دعم مالي للاستقلال\n• اليابان: إعلان استقلال 8 فبراير، حركة طلابية"
  },
  "ch_contemporary_01": {
    "title": "التحرير والانقسام",
    "theory": "في 15 أغسطس 1945، جاء التحرير، لكن شبه الجزيرة الكورية انقسمت.\n\n• التحرير: استسلام اليابان غير المشروط، ثمرة حركة الاستقلال\n• الانقسام: احتلال أمريكي وسوفياتي مقسم عند خط العرض 38\n• اللجنة التحضيرية لتأسيس الدولة: يو أون-هيونغ، إعلان الجمهورية الشعبية (غير معترف بها من الحكومة العسكرية الأمريكية)\n• مؤتمر وزراء خارجية موسكو (1945): تأسيس حكومة مؤقتة، وصاية 5 سنوات\n  - مؤيد للوصاية (يسار) ضد معارض للوصاية (يمين)\n• اللجنة المشتركة الأمريكية-السوفياتية: فشل، نقل إلى الأمم المتحدة"
  },
  "ch_contemporary_02": {
    "title": "تأسيس حكومة جمهورية كوريا",
    "theory": "عام 1948، أُسست حكومة جمهورية كوريا.\n\n• قرار الأمم المتحدة: انتخابات عامة تناسبية مع السكان، رفض سوفياتي\n• مفاوضات الشمال-الجنوب (1948): كيم غو، كيم غيو-سيك، زيارة بيونغيانغ، فشل\n• انتخابات 10 مايو العامة (1948): تحت إشراف الأمم المتحدة، تشكيل الجمعية التأسيسية\n• الدستور التأسيسي: جمهورية ديمقراطية، نظام رئاسي مختلط مع عناصر برلمانية\n• تأسيس الحكومة (15 أغسطس 1948): يي سونغ-مان أول رئيس\n• اعتراف الأمم المتحدة: الحكومة الشرعية الوحيدة في شبه الجزيرة الكورية"
  },
  "ch_contemporary_03": {
    "title": "الحرب الكورية",
    "theory": "في 25 يونيو 1950، اندلعت الحرب إثر الغزو الكوري الشمالي.\n\n• السياق: إعلان خط أتشيسون، الاستعدادات الحربية الكورية الشمالية\n• التطور: غزو كوري شمالي ← خط دفاع ناكدونغ ← إنزال إنتشون ← استعادة سيول\n  ← التقدم نحو يالو ← تدخل صيني ← انسحاب 4 يناير ← جمود عند خط 38\n• الهدنة (27 يوليو 1953): بانمونجوم، حالة هدنة حالية\n• الخسائر: ملايين الضحايا، 10 ملايين عائلة منفصلة، تدمير الأراضي\n• التأثير: تعزيز الأيديولوجية المعادية للشيوعية، ترسيخ الانقسام"
  },
  "ch_contemporary_04": {
    "title": "حكومة يي سونغ-مان وثورة 19 أبريل",
    "theory": "ضد الحكم الطويل لحكومة يي سونغ-مان، اندلعت ثورة 19 أبريل.\n\n• حكومة يي سونغ-مان: سياسة معادية للشيوعية، تعديل بالاستخراج (1952)، تعديل الأربعة المُقرَّبة (1954)\n• انتخابات 15 مارس المزورة (1960): تزوير انتخابي للحزب الليبرالي للرئاسة ونائب الرئاسة\n• ثورة 19 أبريل: مظاهرات ماسان ← اكتشاف جثة كيم جو-يول ← امتداد وطني\n  - مطالب ديمقراطية من طلاب ومواطنين، الأحكام العرفية، مظاهرة الأساتذة\n• النتيجة: استقالة يي سونغ-مان، حكومة هو جونغ الانتقالية، الجمهورية الثانية (حكومة تشانغ ميون)\n• الأهمية: حركة ديمقراطية للطلاب والمواطنين، أول ثورة ديمقراطية"
  },
  "ch_contemporary_05": {
    "title": "حكومة بارك تشونغ-هي",
    "theory": "عام 1961، أُسست حكومة بارك تشونغ-هي عبر انقلاب عسكري.\n\n• انقلاب 16 مايو (1961): استيلاء الجيش على السلطة، المجلس الأعلى لإعادة البناء الوطني\n• الجمهورية الثالثة (1963): نظام رئاسي، خطط التنمية الاقتصادية الخمسية\n• اتفاقية كوريا-اليابان (1965): تطبيع العلاقات، مظاهرات 3 يونيو (معارضة)\n• نظام يوشين (1972): يوشين أكتوبر، سلطة المراسيم الطارئة، المؤتمر الوطني للتوحيد\n• انتفاضة بوسان-ماسان الديمقراطية (1979): مظاهرات في بوسان وماسان\n• حادثة 26 أكتوبر (1979): اغتيال بارك تشونغ-هي"
  },
  "ch_contemporary_06": {
    "title": "حكومة تشون دو-هوان وحركة الديمقراطية",
    "theory": "عام 1980، استولت المجموعة العسكرية الجديدة بقيادة تشون دو-هوان على السلطة.\n\n• حادثة 12 ديسمبر (1979): استيلاء المجموعة الجديدة على القيادة العسكرية\n• حركة الديمقراطية 18 مايو (1980): غوانغجو، مقاومة توسيع الأحكام العرفية، تنظيم ميليشيات مدنية\n  - قمع عسكري من المجموعة الجديدة، مئات الضحايا\n• الجمهورية الخامسة: رئيس منتخب غير مباشر، ولاية واحدة 7 سنوات\n• انتفاضة يونيو (1987): مطالب إلغاء دستور هوهون والانتخاب المباشر، تضحية لي هان-يول\n• إعلان 29 يونيو: قبول تعديل الانتخاب المباشر، رو تي-وو\n• الأهمية: نقطة تحول حاسمة نحو الديمقراطية"
  },
  "ch_contemporary_07": {
    "title": "تطور الديمقراطية",
    "theory": "منذ 1987، تطورت الديمقراطية مع تناوب سلمي للسلطة.\n\n• الجمهورية السادسة (1988): انتخاب رئاسي مباشر، ولاية واحدة 5 سنوات\n• حكومة رو تي-وو: دبلوماسية الشمال، علاقات مع الاتحاد السوفياتي والصين، انضمام الكوريتين للأمم المتحدة (1991)\n• حكومة كيم يونغ-سام: حكومة مدنية، نظام الأسماء الحقيقية المصرفية، تصحيح تاريخي، أزمة صندوق النقد الدولي\n• حكومة كيم دي-جونغ: أول تناوب سلمي، قمة بين الكوريتين (2000)، إعلان 15 يونيو\n• منذ ذلك الحين: انتخابات ديمقراطية، تقدم في حقوق الإنسان وحرية الصحافة"
  },
  "ch_contemporary_08": {
    "title": "التنمية الاقتصادية والتغييرات الاجتماعية",
    "theory": "شهدت جمهورية كوريا نمواً اقتصادياً سريعاً وتغييرات اجتماعية.\n\n• التنمية الاقتصادية: الخطط الخمسية الأولى إلى الرابعة (1962-1981)\n  - من الصناعة الخفيفة إلى الصناعة الثقيلة والكيميائية، نمو مدفوع بالصادرات\n• معجزة الهان: من مستفيد إلى مانح للمساعدات، عضوية OECD (1996)\n• أزمة صندوق النقد الدولي (1997): أزمة عملة، إعادة هيكلة، تم تجاوزها\n• التغييرات الاجتماعية: التحضر، الأسرة النووية، الشيخوخة، قوة تكنولوجية\n• الثقافة: الموجة الكورية (كي-بوب، دراما، سينما)، صدى عالمي"
  },
  "ch_contemporary_09": {
    "title": "تطور سياسة التوحيد",
    "theory": "تطورت سياسة التوحيد للحكومة الكورية الجنوبية عبر الزمن.\n\n• يي سونغ-مان: نظرية التوحيد بالزحف شمالاً (التوحيد بالقوة)\n• بارك تشونغ-هي: الإعلان المشترك في 4 يوليو (1972)، الاستقلال، السلام، الوحدة الوطنية الكبرى\n• تشون دو-هوان: لقاء العائلات المنفصلة (1985)\n• رو تي-وو: دبلوماسية الشمال، الاتفاق الأساسي بين الكوريتين (1991)\n• كيم دي-جونغ: سياسة الشمس المشرقة، سياحة جبل غومغانغ، أول قمة بين الكوريتين (2000)\n• منذ ذلك الحين: المنطقة الصناعية في غيسونغ، القمتان الثانية والثالثة"
  },
  "ch_contemporary_10": {
    "title": "تطور كوريا الشمالية والعلاقات بين الكوريتين",
    "theory": "منذ الانقسام، تطور النظام الكوري الشمالي والعلاقات بين الكوريتين.\n\n• النظام الكوري الشمالي: كيم إيل-سونغ ← كيم جونغ-إيل ← كيم جونغ-أون، توارث على 3 أجيال\n  - أيديولوجية جوتشي، سياسة سونغون (الأولوية العسكرية)، التطوير النووي\n• العلاقات بين الكوريتين: مواجهة (1950-1970) ← حوار (1970-) ← مصالحة وتعاون (1990-)\n  - تناوب التوترات والانفراج\n• أحداث مهمة: اعتداء رانغون (1983)، تشونان (2010)، يونبيونغ (2010)\n• التبادلات بين الكوريتين: لقاءات العائلات المنفصلة، سياحة جبل غومغانغ، المنطقة الصناعية في غيسونغ\n• التحديات: إرساء السلام، التحضير للتوحيد، المصالحة الوطنية"
  }
}
