{
  "ch_prehistoric_01": {
    "title": "Paleolitico",
    "theory": "Il Paleolitico iniziò circa 700.000 anni fa. Venivano utilizzati strumenti in pietra scheggiata (bifacciali, chopper) e si viveva in grotte o ripari lungo i fiumi. Si sopravviveva con la caccia e la raccolta, vivendo in gruppi.\n\n• Siti importanti: Jeongok-ri a Yeoncheon (bifacciali acheuleani), Seokjang-ri a Gongju, Geomeunmoru a Sangwon, Durubong a Cheongwon\n• Caratteristiche: Vita nomade, società egualitaria, uso del fuoco"
  },
  "ch_prehistoric_02": {
    "title": "Neolitico",
    "theory": "Il Neolitico iniziò circa 10.000 anni fa (circa 8000 a.C.). Venivano utilizzati strumenti in pietra levigata e ceramica a decorazione a pettine. L'agricoltura e l'allevamento iniziarono, portando a una vita sedentaria in case semi-interrate.\n\n• Siti importanti: Amsa-dong a Seul, Dongsam-dong a Busan, Osan-ri a Yangyang\n• Credenze: Animismo, totemismo, sciamanesimo\n• Caratteristiche: Fusaiole e aghi d'osso (tessitura primitiva), cumuli di conchiglie"
  },
  "ch_prehistoric_03": {
    "title": "Età del bronzo",
    "theory": "L'Età del bronzo iniziò intorno al 2000-1500 a.C. Il bronzo veniva utilizzato principalmente per armi e oggetti rituali, mentre gli strumenti agricoli erano ancora in pietra (coltelli in pietra a forma di mezzaluna). La risicoltura si intensificò e emersero le classi sociali.\n\n• Ceramica: Ceramica senza decorazione, ceramica stile Misong-ri\n• Oggetti in bronzo: Pugnali a forma di mandolino, specchi a motivi grossolani\n• Tombe: Dolmen (tipo tavola/tipo scacchiera), tombe a cassa di pietra\n• Società: Società di capi, credenza nel popolo eletto"
  },
  "ch_prehistoric_04": {
    "title": "Età del ferro",
    "theory": "L'Età del ferro iniziò intorno al V-IV secolo a.C. Il ferro veniva utilizzato per strumenti agricoli e armi, aumentando la produttività agricola e intensificando le guerre di conquista. Il commercio con la Cina si espanse.\n\n• Oggetti in ferro: Strumenti agricoli in ferro (falci, zappe), armi in ferro\n• Oggetti in bronzo: Pugnali affilati, specchi a motivi fini (stile coreano)\n• Tombe: Tombe in legno, tombe a giara\n• Cambiamenti: Afflusso di monete cinesi (Mingdaoqian, Banliang), uso della scrittura a pennello"
  },
  "ch_gojoseon_01": {
    "title": "Fondazione e sviluppo di Gojoseon",
    "theory": "Gojoseon fu fondato nel 2333 a.C. da Dangun Wanggeom (secondo il Samguk Yusa). Si sviluppò nella regione del Liaoning e nel nord della penisola coreana sulla base della cultura del bronzo.\n\n• Sviluppo: Dangun Joseon → Gija Joseon (leggendario) → Wiman Joseon\n• Wiman Joseon: Fondato nel 194 a.C. dopo che Wiman rovesciò il re Jun\n• Apogeo: Adozione della cultura del ferro, commercio intermediario tra Han e Jin\n• Caduta: Invasione dell'imperatore Wu di Han nel 108 a.C., istituzione delle Quattro Comanderie di Han"
  },
  "ch_gojoseon_02": {
    "title": "Società e cultura di Gojoseon",
    "theory": "Gojoseon manteneva l'ordine sociale attraverso gli 8 Articoli di legge (Beomgeum 8jo). Solo 3 articoli sono noti oggi.\n\n• Gli 8 Articoli (noti):\n  - Chi uccide sarà giustiziato\n  - Chi ferisce altri dovrà compensare con cereali\n  - Chi ruba diventerà schiavo (riscatto di 500.000 monete)\n\n• Significato: Rispetto della vita, protezione della proprietà privata, importanza della manodopera\n• Società: Società di classi, esistenza di leggi consuetudinarie penali"
  },
  "ch_gojoseon_03": {
    "title": "Crescita dei vari regni",
    "theory": "Dopo la caduta di Gojoseon, diversi regni si svilupparono in Manciuria e nella penisola coreana.\n\n• Buyeo: Confederazione di 5 tribù, Yeonggo (festival di dicembre), sepoltura dei seguaci, 1 libro 12 leggi\n• Goguryeo: Confederazione di 5 tribù, Dongmaeng (ottobre), Seookje (sistema del genero residente)\n• Okjeo: Tributo a Goguryeo, usanza di allevamento della giovane sposa, Goljangje (tomba familiare comune)\n• Dongye: Mucheon (ottobre), esogamia clanica, Chaekhwa (compensazione per violazione di confine)\n• Samhan: Mahan, Jinhan, Byeonhan, Sodo (luogo sacro con Cheongun), festival di maggio e ottobre"
  },
  "ch_three_kingdoms_01": {
    "title": "Fondazione e crescita di Goguryeo",
    "theory": "Goguryeo fu fondato nel 37 a.C. da Jumong a Jolbon. Si sviluppò nelle regioni montuose del fiume Yalu diventando uno stato conquistatore.\n\n• Re Taejo: Conquista di Okjeo, tentativo di espansione verso il Liaodong\n• Re Gogukcheon: Jindebeop (aiuto ai poveri), riorganizzazione del sistema dei 5 Bu\n• Re Dongcheon: Crisi per l'invasione di Guanqiujian di Wei\n• Caratteristiche: Consiglio dei Jega, Gyeongdang (educazione dei giovani), Seookje"
  },
  "ch_three_kingdoms_02": {
    "title": "Apogeo di Goguryeo",
    "theory": "Nel IV-V secolo, Goguryeo divenne una potenza dell'Asia orientale.\n\n• Re Sosurim: Adozione del buddismo (372), fondazione del Taehak, promulgazione del codice giuridico\n• Re Gwanggaeto: Espansione territoriale (Manciuria, nord della penisola), aiuto a Silla (sconfitta dei Wa)\n• Re Jangsu: Trasferimento della capitale a Pyongyang (427), politica di espansione verso sud, controllo del bacino del fiume Han\n• Stele del re Gwanggaeto: Archivi della storia di Goguryeo, situata a Jilin, Manciuria\n• Territorio massimo: Dalla Manciuria al centro della penisola (fino a Chungju)"
  },
  "ch_three_kingdoms_03": {
    "title": "Resistenza esterna e caduta di Goguryeo",
    "theory": "Nel VI-VII secolo, Goguryeo combatté le invasioni Sui e Tang.\n\n• Eulji Mundeok: Battaglia di Salsu (612), sconfitta di 300.000 soldati dell'imperatore Yang di Sui\n• Yeon Gaesomun: Costruzione della Grande Muraglia di mille li, sconfitta dell'imperatore Taizong di Tang (battaglia di Ansi, 645)\n• Resistenza straniera: Respinte 4 invasioni Sui, 3 invasioni Tang\n• Caduta: 668, conquistato dall'alleanza Silla-Tang\n• Cause: Divisione della classe dirigente, lotte di potere dopo la morte di Yeon Gaesomun"
  },
  "ch_three_kingdoms_04": {
    "title": "Fondazione e crescita di Baekje",
    "theory": "Baekje fu fondato nel 18 a.C. da Onjo a Wirye (bacino del fiume Han). Si sviluppò sulla base del bacino del fiume Han.\n\n• Re Goi: Organizzazione del sistema di ranghi e uniformi ufficiali, promulgazione del codice giuridico, 6 Jwapyeong\n• Re Geunchogo: Unificazione di Mahan, attacco a Goguryeo (morte del re Gogugwon)\n• Territorio: Espansione verso Liaoxi, Shandong, Kyushu (spada a sette rami)\n• Caratteristiche: Commercio marittimo sviluppato, scambi con le dinastie del Sud"
  },
  "ch_three_kingdoms_05": {
    "title": "Apogeo e rinascita di Baekje",
    "theory": "Baekje raggiunse l'apogeo nel IV secolo sotto il re Geunchogo, ma declinò a causa dell'espansione verso sud di Goguryeo.\n\n• Re Geunchogo: Conquista di Mahan, controllo di Hwanghae-do e Jeolla-do, dono della spada a sette rami al Giappone\n• Re Gaero: Caduta di Hanseong (475), ucciso dal re Jangsu di Goguryeo\n• Trasferimento a Ungjin (475): Spostamento della capitale a Gongju\n• Re Muryeong: Rinascita, invio di 22 Damno (governatori locali), scambi con Liang\n• Re Seong: Trasferimento a Sabi (538), nome del paese Nambuyeo, tentativo di riconquistare il bacino Han (morte a Gwansanseong)"
  },
  "ch_three_kingdoms_06": {
    "title": "Movimento di restaurazione e caduta di Baekje",
    "theory": "Nel VII secolo, Baekje fu conquistato dall'alleanza Silla-Tang.\n\n• Re Uija: Attacco a Silla (caduta di Daeyaseong), disordine politico alla fine del regno\n• Caduta: 660, caduta di Sabiseong per l'alleanza Silla-Tang (Kim Yu-sin, Su Dingfang)\n• Movimento di restaurazione: Guidato da Boksin, Dochim, Heukchi Sangji, con il supporto del Giappone\n• Battaglia di Baekgang (663): Sconfitta della marina giapponese, fallimento del movimento di restaurazione\n• Significato: Alcuni rifugiati di Baekje emigrarono in Giappone e Silla, diffondendo la cultura"
  },
  "ch_three_kingdoms_07": {
    "title": "Fondazione e sviluppo di Silla",
    "theory": "Silla fu fondato nel 57 a.C. da Bak Hyeokgeose a Saroguk (Gyeongju). Fu il più lento dei Tre Regni a svilupparsi.\n\n• Re Naemul: Stabilimento della successione ereditaria del clan Kim, titolo di Maripgan\n• Re Beopheung: Riconoscimento ufficiale del buddismo (martirio di Ichadon), promulgazione del codice giuridico, organizzazione del sistema Golpum, annessione di Geumgwan Gaya\n• Re Jinheung: Riorganizzazione dell'Hwarangdo, controllo del bacino del Han, conquista della piana di Hamheung e Daegaya\n• Stele di ispezione: Stele di Bukhansan, stele di Changnyeong, stele di Maun-ryeong, stele di Hwangcho-ryeong"
  },
  "ch_three_kingdoms_08": {
    "title": "Apogeo di Silla e unificazione dei Tre Regni",
    "theory": "Nel VII secolo, Silla si alleò con Tang per unificare i Tre Regni.\n\n• Regina Seondeok: Costruzione di Cheomseongdae, pagoda a 9 piani di Hwangnyongsa\n• Re Taejong Muyeol (Kim Chun-chu): Primo re Jingol, alleanza con Tang\n• Re Munmu: Dopo la caduta di Baekje (660) e Goguryeo (668), espulsione di Tang\n• Guerra Silla-Tang: Battaglie di Maeso-seong e Gibeolpo (676), sconfitta di Tang\n• Significato: Unificazione a sud della linea Daedong-Wonsan, base della cultura nazionale"
  },
  "ch_three_kingdoms_09": {
    "title": "Fondazione e sviluppo di Gaya",
    "theory": "Gaya era un regno confederato che si sviluppò nel bacino del fiume Nakdong. Prosperò grazie alla produzione di ferro e al commercio marittimo.\n\n• Gaya anteriore: Centrato su Geumgwan Gaya (Gimhae), successione di Byeonhan\n• Gaya posteriore: Centrato su Daegaya (Goryeong), apogeo nel V-VI secolo\n• Caratteristiche: Esportazione di ferro (verso Giappone e Lelang), regno confederato (fallimento dell'unificazione)\n• Caduta: Geumgwan Gaya (532, re Beopheung), Daegaya (562, re Jinheung)\n• Cultura: Gayageum (cetra), armature in ferro, usanza di sepoltura dei seguaci"
  },
  "ch_three_kingdoms_10": {
    "title": "Buddismo e pensiero dei Tre Regni",
    "theory": "Il buddismo contribuì al rafforzamento del potere reale e all'unificazione nazionale.\n\n• Goguryeo: 372, portato da Sundo dal Qin anteriore (re Sosurim)\n• Baekje: 384, portato da Malananta dal Jin orientale (re Chimnyu)\n• Silla: 527, riconosciuto ufficialmente dopo il martirio di Ichadon (re Beopheung)\n• Caratteristiche: Buddismo protettore dello stato, adozione a livello nazionale"
  },
  "ch_three_kingdoms_11": {
    "title": "Tombe e siti dei Tre Regni",
    "theory": "Le tombe dei Tre Regni mostrano le caratteristiche culturali di ogni regno.\n\n• Goguryeo: Cairn → tombe a corridoio, affreschi (tombe dei Danzatori, dei Lottatori, dei Due Pilastri)\n• Baekje: Tombe a corridoio, tomba del re Muryeong (tomba in mattoni), pitture dei Quattro Guardiani\n• Silla: Tombe ad accumulo di legno e pietre (tomba del Cavallo celeste, Hwangnam Daechong), corone d'oro scoperte\n• Silla unificato: Tombe a corridoio (influenza della cremazione)\n• Balhae: Tomba della principessa Jeonghyo (tomba a corridoio), successione di Goguryeo"
  },
  "ch_three_kingdoms_12": {
    "title": "Arti e scienze dei Tre Regni",
    "theory": "I Tre Regni svilupparono arti e tecnologie scientifiche originali.\n\n• Goguryeo: Affreschi funerari (Quattro Guardiani), scena di caccia della tomba dei Danzatori\n• Baekje: Brucia-profumi in bronzo dorato, Buddha scolpiti nella roccia di Seosan, pagoda in pietra di Mireuksa\n• Silla: Cheomseongdae (più antico osservatorio dell'Asia orientale), pagoda a 9 piani di Hwangnyongsa, corone d'oro\n• Scienze: Osservazione astronomica, uso del calendario, sviluppo della costruzione navale\n• Trasmissione al Giappone: Ajikgi e Wani (caratteri cinesi, confucianesimo), Damjing (carta, inchiostro, colori)"
  },
  "ch_north_south_states_01": {
    "title": "Politica di Silla unificato",
    "theory": "Silla unificato stabilì un forte potere reale e un sistema centralizzato.\n\n• Re Sinmun: Abolizione del Nogeup, distribuzione del Gwanryojeon, fondazione del Gukhak, 9 province e 5 capitali secondarie\n• Sistema di governo: Jipsabu (massima istituzione), Sangdaedeung (rappresentante dell'aristocrazia)\n• Amministrazione locale: 9 province, 5 capitali secondarie, Oesajeong (ispettori), Hyang, Bugok (distretti amministrativi speciali)\n• Esercito: 9 Seodang (esercito centrale), 10 Jeong (esercito locale)\n• Periodo tardo: Lotte per il trono, ascesa dei signori locali, resistenza dei Duupum 6"
  },
  "ch_north_south_states_02": {
    "title": "Economia di Silla unificato",
    "theory": "L'economia di Silla unificato si sviluppò grazie all'espansione territoriale.\n\n• Sistema fondiario: Gwanryojeon (diritti di riscossione per i funzionari), Jeongjeon (terre dei contadini)\n• Documento Minjeong: Censimento dei villaggi (popolazione, terre, bestiame) ogni 3 anni, scoperto allo Shōsōin in Giappone\n• Commercio: Mercati est e ovest di Gyeongju, porti internazionali (Cheonghaejin, porto di Ulsan)\n• Jang Bogo: Fondazione di Cheonghaejin (828), controllo marittimo, commercio intermediario Tang-Silla-Giappone\n• Artigianato: Lavorazione dell'oro e dell'argento, tessitura della seta"
  },
  "ch_north_south_states_03": {
    "title": "Società di Silla unificato",
    "theory": "Silla unificato era una società di caste basata sul sistema Golpum.\n\n• Sistema Golpum: Seonggol → Jingol → Duupum 6 a 1, restrizioni sui ranghi ufficiali e la vita quotidiana\n• Jingol: Massima aristocrazia, diritto di successione al trono, Duupum 5 e inferiori limitati nei ranghi\n• Duupum 6: Carriere negli studi e nella religione, studenti in Cina, intellettuali critici\n• Disordini tardi: Lotte per il trono, conflitti interni dei Jingol, resistenza dei Duupum 6\n• Ascesa dei signori locali: Crescita autonoma dei poteri locali, base dei Tre Regni posteriori"
  },
  "ch_north_south_states_04": {
    "title": "Cultura di Silla unificato",
    "theory": "Silla unificato fuse le culture dei Tre Regni per sviluppare una cultura nazionale.\n\n• Buddismo: Scuola Hwaeom (Uisang), sviluppo delle scuole dottrinali, popolarità del Seon (periodo tardo)\n• Wonhyo: Pensiero Hwajaeng, diffusione del buddismo, Muaega\n• Architettura: Bulguksa, Seokguram (Buddha principale), pagode Dabotap e Seokgatap\n• Campane: Campana del re Seongdeok (campana Emille), campana di Sangwonsa\n• Letteratura: Hyangga (Cheoyongga, Jemangmaega), Seol Chong (organizzazione dell'Idu)"
  },
  "ch_north_south_states_05": {
    "title": "Fondazione e politica di Balhae",
    "theory": "Balhae fu fondato nel 698 da Dae Joyeong a Dongmosan. Era un paese fondato dai sopravvissuti di Goguryeo e dai Mohe.\n\n• Dae Joyeong: Ex generale di Goguryeo, fondazione dopo la vittoria contro Tang\n• Re Mu: Conflitto con Tang, attacco di Jang Munhyu sulla penisola di Shandong\n• Re Mun: Relazioni amichevoli con Tang, trasferimento della capitale a Sanggyeong, organizzazione dei 3 Seong 6 Bu\n• Re Seon: Territorio massimo, titolo di 'Regno prospero dell'Est'\n• Caduta: 926, conquistato dai Khitan"
  },
  "ch_north_south_states_06": {
    "title": "Società e cultura di Balhae",
    "theory": "Balhae ereditò la cultura di Goguryeo ricevendo anche l'influenza di Tang.\n\n• Governo: 3 Seong 6 Bu (sistema Tang), 5 capitali, 15 prefetture, 62 distretti\n• Eredità di Goguryeo: Ondol, lanterne in pietra, statue di Buddha seduto, struttura della tomba della principessa Jeonghyo\n• Influenza Tang: Jujagam (educazione confuciana), partecipazione agli esami Bingongkwa\n• Relazioni esterne: Scambi con Tang, Silla e Giappone, via di Silla (rotta commerciale)\n• Patrimonio culturale: Rovine di Sanggyeong Yongcheonbu, tombe delle principesse Jeonghye e Jeonghyo"
  },
  "ch_goryeo_01": {
    "title": "Fondazione e sistema di governo di Goryeo",
    "theory": "Nel 918, Wang Geon rovesciò Gungye e fondò Goryeo. Unificò i Tre Regni posteriori (936) e integrò i signori locali.\n\n• Integrazione dei signori: Politica matrimoniale (29 mogli), concessione di cognomi, sistema Giin, sistema Sasimgwan\n• 10 Istruzioni: Consigli lasciati ai futuri re\n• Sistema di governo: 2 Seong (Jungseomunhaseong, Sangseo-seong), 6 Bu, Chungcheowon, Samsa\n• Dobyeongmasa, Sikmokdogam: Istituzioni proprie di Goryeo\n• Amministrazione locale: 5 Do, 2 Gye, Hyang, Bugok, So (distretti amministrativi speciali)"
  },
  "ch_goryeo_02": {
    "title": "Formazione e declino della società aristocratica",
    "theory": "Il primo periodo di Goryeo era dominato dall'aristocrazia delle grandi famiglie.\n\n• Aristocrazia: Monopolio dei posti attraverso esami e Emseo, eredità del Gongeumjeon\n• Rivolta di Yi Jagyeom (1126): Tentativo di monopolio del potere da parte del clan materno\n• Rivolta di Myocheong (1135): Proposta di trasferimento della capitale a Seogyeong e titolo imperiale, repressa da Kim Bu-sik\n• Caratteristiche: Formazione di grandi famiglie come gli Yi di Gyeongwon, matrimoni chiusi\n• Declino: Indebolimento del potere reale, discriminazione crescente verso i militari"
  },
  "ch_goryeo_03": {
    "title": "Formazione e sviluppo del regime militare",
    "theory": "Nel 1170, Jeong Jung-bu e altri guidarono un colpo di stato militare, stabilendo il regime militare.\n\n• Cause: Cattivo governo del re Uijong, discriminazione verso i militari (incidente di Bohyeonwon)\n• Sviluppo: Jeong Jung-bu → Gyeong Dae-seung → Yi Ui-min → Choe Chung-heon\n• Regime Choe: Gyojeongdogam (massima istanza di potere), Sambyeolcho (esercito privato), Jeongbang (controllo delle nomine)\n• Rivolte contadine: Rivolta di Manjeok, rivolta di Mangi e Mangsoi\n• Risultati: Indebolimento del potere reale, monopolio del potere da parte dei militari"
  },
  "ch_goryeo_04": {
    "title": "Resistenza contro i Mongoli e Sambyeolcho",
    "theory": "Nel XIII secolo, Goryeo resistette alle invasioni mongole (Yuan).\n\n• Trasferimento a Ganghwa (1232): Volontà di resistenza del regime militare, 39 anni di resistenza\n• Resistenza popolare: Fortezza di Cheorin (Kim Yun-hu), fortezza di Chungju, fortezza di Gwiju\n• Tripitaka Koreana: Preghiera per respingere i Mongoli attraverso il potere del Buddha\n• Ritorno a Gaegyeong (1270): Re Wonjong, crollo del regime militare\n• Resistenza del Sambyeolcho: Bae Jung-son, Jindo → isola di Jeju, repressa nel 1273"
  },
  "ch_goryeo_05": {
    "title": "Periodo di intervento Yuan e famiglie potenti",
    "theory": "Durante il periodo di intervento Yuan (1270-1356), Goryeo subì l'ingerenza interna di Yuan.\n\n• Intervento: Istituzione del Segretariato di Jeongdong, invio di Darugachi, richieste di tributo e falconeria\n• Famiglia reale: Matrimoni con principesse Yuan, re cresciuti a Yuan\n• Declassamento dei titoli: Wang → Chungyeol-wang, Pyeha → Jeonha, 6 Bu → 4 Sa\n• Famiglie potenti: Pro-Yuan, grandi proprietari terrieri, controllo del Dopyeonguisasa\n• Cambiamenti sociali: Moda mongola, introduzione del cotone e della polvere da sparo"
  },
  "ch_goryeo_06": {
    "title": "Riforme del re Gongmin e i nuovi letterati",
    "theory": "Il re Gongmin (1351-1374) perseguì una politica anti-Yuan e il rafforzamento del potere reale.\n\n• Politica anti-Yuan: Abolizione del Segretariato di Jeongdong, recupero di Ssangseong, abbandono dei titoli e del calendario Yuan\n• Riforme interne: Jeonminbyeonjeongdogam (recupero delle terre delle famiglie potenti), impiego di Sindon\n• Nuovi letterati: Diplomati agli esami, neo-confuciani, critici delle famiglie potenti\n• Limiti: Invasioni dei Turbanti rossi e dei pirati giapponesi, caos politico dopo l'eliminazione di Sindon\n• Yi Seong-gye: Ritirata di Wihwa-do (1388), alleanza con i nuovi letterati"
  },
  "ch_goryeo_07": {
    "title": "Economia di Goryeo",
    "theory": "Goryeo aveva un'economia centrata sull'agricoltura e un commercio internazionale sviluppato.\n\n• Sistema fondiario: Jeonsi-gwa (diritti di riscossione per funzionari e militari), Gongeumjeon (eredità per i 5° rango e superiori)\n• Agricoltura: Rotazione su 2 anni con 3 colture, sviluppo dei fertilizzanti, Nongsangjibyo (manuale agricolo di Yuan)\n• Commercio: Mercati di Gaegyeong, Byeokrando (porto internazionale), mercanti d'Arabia (Daesikgukin)\n• Artigianato: Artigianato ufficiale, So (produzione specializzata)\n• Moneta: Geonwon Jungbo, lingotti d'argento (Hwalgok), circolazione limitata"
  },
  "ch_goryeo_08": {
    "title": "Sistema di caste e società di Goryeo",
    "theory": "Goryeo era una società di caste con aristocratici, classe media, contadini e servi.\n\n• Aristocratici: Grandi famiglie, famiglie potenti, monopolio degli esami e dell'Emseo\n• Classe media: Hyangni (amministrazione locale), Namban (classe militare), impiegati\n• Contadini: Contadini (Baekjeong), oneri fiscali, corvée e tributi\n• Servi: Schiavi (Ilcheonjeukcheon), abitanti di Hyang, Bugok, So\n• Caratteristiche: Status relativamente alto delle donne, possibilità di nuovo matrimonio per le donne aristocratiche"
  },
  "ch_goryeo_09": {
    "title": "Buddismo di Goryeo",
    "theory": "A Goryeo, il buddismo era la religione di stato e influenzava tutta la società.\n\n• Buddismo di stato: Yeondeunghoe e Palgwanhoe (cerimonie nazionali), esami monastici\n• Scuole: Scuole dottrinali (Hwaeom, Beopsang), scuola Seon (Jogyejong)\n• Uicheon: Fondazione della scuola Cheontae, Gyogwangyeomsu, compilazione del Sokjanggyeong\n• Jinul: Riorganizzazione del Jogyejong, Jeonghyessangsu, Dono Jeomsu, movimento di riforma di Suseonsa\n• Tripitaka: Primo Tripitaka (preghiera per respingere i Khitan), Tripitaka Koreana (preghiera per respingere i Mongoli)"
  },
  "ch_goryeo_10": {
    "title": "Confucianesimo e opere storiche di Goryeo",
    "theory": "Alla fine di Goryeo, il neo-confucianesimo fu introdotto e divenne la base ideologica dei nuovi letterati.\n\n• Confucianesimo: Gukjagam (massima istituzione educativa), organizzazione degli esami\n• Neo-confucianesimo: Introdotto da An Hyang (re Chungnyeol), trasmesso da Baek I-jeong, Yi Jehyeon, Yi Saek, Jeong Mongju\n• Opere storiche: Samguk Sagi (Kim Bu-sik, più antica opera storica esistente, prospettiva confuciana)\n• Samguk Yusa (Ilyeon), Jewang Ungi (Yi Seunghyu): Racconti di Dangun, coscienza nazionale\n• 7 Annali reali: Non esistono più"
  },
  "ch_goryeo_11": {
    "title": "Scienze e stampa di Goryeo",
    "theory": "Goryeo possedeva tecnologie di stampa e metallurgia di livello mondiale.\n\n• Stampa: Tripitaka Koreana (più grande collezione di tavole in legno esistente), Jikji (più antico libro stampato con caratteri metallici esistente)\n• Celadon a intarsio: Sviluppato nel XII secolo, tecnica originale di Goryeo\n• Bussola: Sviluppo della navigazione\n• Polvere da sparo: Choe Mu-seon, istituzione dell'Ufficio delle armi da fuoco, sconfitta dei pirati giapponesi\n• Altro: Osservazione astronomica, ricerca calendariale, sviluppo medico"
  },
  "ch_goryeo_12": {
    "title": "Arti di Goryeo",
    "theory": "Goryeo sviluppò arti originali basate sulla cultura buddista e aristocratica.\n\n• Celadon: Celadon puro → celadon a intarsio (XII s.), vaso Maebyeong a motivo di nuvole e gru\n• Pittura buddista: Colori vivaci, Gwangyeongbyeonsangdo\n• Architettura: Stile Jusimpo (Geungnakjeon di Bongjeongsa, Muryangsujeon di Buseoksa)\n• Pagode: Stili vari (pagoda ottagonale a 9 piani di Woljeongsa, pagoda a 10 piani di Gyeongcheonsa)\n• Artigianato: Tecnica di intarsio d'argento, lacca intarsiata di madreperla"
  },
  "ch_joseon_early_01": {
    "title": "Fondazione e sistema di governo di Joseon",
    "theory": "Nel 1392, Yi Seong-gye fondò Joseon. Il neo-confucianesimo era l'ideologia di governo.\n\n• Fondazione: Ritirata di Wihwa-do (1388) → attuazione della legge Gwajeon → fondazione di Joseon\n• Re Taejo: Trasferimento della capitale a Hanyang, costruzione del palazzo Gyeongbok\n• Re Taejong: Sistema di rapporto diretto dei 6 ministeri, abolizione degli eserciti privati, legge sulle targhe d'identità\n• Sistema di governo: Uijeongbu e 6 ministeri, 3 Uffici (Saheonbu, Saganwon, Hongmungwan)\n• Amministrazione locale: 8 province, invio di governatori e magistrati, controllo degli Hyangni"
  },
  "ch_joseon_early_02": {
    "title": "Politica da Sejong a Seongjong",
    "theory": "I primi re di Joseon stabilirono la politica confuciana e svilupparono la cultura.\n\n• Re Sejong: Jiphyeonjeon, Hunminjeongeum, istituzione delle 4 guarnigioni e 6 posti, sistema di deliberazione dell'Uijeongbu\n• Re Sejo: Abolizione del Jiphyeonjeon, sistema di rapporto diretto dei 6 ministeri, inizio della compilazione del Gyeongguk Daejeon\n• Re Seongjong: Completamento e promulgazione del Gyeongguk Daejeon, istituzione dell'Hongmungwan, impiego dei Sarim\n• Direzione politica: Equilibrio tra potere reale e ministeriale\n• Jiphyeonjeon: Istituzione di ricerca accademica del re Sejong"
  },
  "ch_joseon_early_03": {
    "title": "Ascesa dei Sarim e le purghe",
    "theory": "Dopo il re Seongjong, i Sarim crebbero ma entrarono in conflitto con gli Hungu, causando le purghe.\n\n• Sarim: Lignaggio di Kim Jong-jik, base rurale, Seowon e Hyangyak, importanza dello studio morale\n• Hungu: Forze meritorie del re Sejo, controllo della politica centrale\n• 4 grandi purghe: Muo (1498), Gapja (1504), Gimyo (1519), Eulsa (1545)\n• Purga Muo: Testo funebre di Kim Jong-jik, re Yeonsangun\n• Purga Gimyo: Riforme di Jo Gwangjo (Hyeollyangkwa, abolizione del Sogyeokseo), re Jungjong"
  },
  "ch_joseon_early_04": {
    "title": "Inizio della politica delle fazioni",
    "theory": "Sotto il re Seonjo, i Sarim al potere iniziarono la politica delle fazioni.\n\n• Formazione delle fazioni: Questione di nomina del Ijo Jeonrang, Dongin (Kim Hyo-won) e Seoin (Sim Ui-gyeom)\n• Divisione dei Dongin: Ribellione di Jeong Yeo-rip → Namin (moderati) e Bukin (radicali)\n• Seoin: Lignaggio di Yi I e Seong Hon, regione Giho\n• Dongin: Lignaggio di Yi Hwang, regione Yeongnam\n• Caratteristiche: Base accademica e regionale, critica e controllo reciproci, importanza dell'opinione pubblica"
  },
  "ch_joseon_early_05": {
    "title": "Guerra Imjin",
    "theory": "Nel 1592, la guerra Imjin scoppiò a seguito dell'invasione giapponese di Joseon.\n\n• Cause: Ambizioni continentali di Toyotomi Hideyoshi\n• Fase iniziale: Caduta di Busan e Dongnae, Hanseong presa in 20 giorni\n• Marina: Imprese di Yi Sun-sin (battaglie di Hansan-do e Myeongnyang)\n• Eserciti di giustizia: Gwak Jae-u, Jo Heon, Go Gyeong-myeong, maestro Seosan, maestro Samyeong\n• Risultati: Devastazione del territorio, diminuzione della popolazione, saccheggio culturale, sviluppo culturale del Giappone"
  },
  "ch_joseon_early_06": {
    "title": "Invasione mancese e teoria della spedizione verso il Nord",
    "theory": "Nel 1636, l'invasione mancese scoppiò a seguito dell'invasione Qing.\n\n• Invasione Jeongmyo (1627): Invasione dei Jin posteriori, stabilimento di relazioni fraterne\n• Invasione mancese (1636): Invasione Qing, resistenza alla fortezza di Namhan, umiliazione di Samjeondo\n• Risultati: Sottomissione ai Qing, principi Sohyeon e Bongrim in ostaggio, stele di Samjeondo\n• Teoria della spedizione verso il Nord: Re Hyojong e Song Si-yeol, progetto di punire i Qing, mai realizzato\n• Influenza: Coscienza anti-Qing, teoria dell'apprendimento dal Nord (adozione della cultura Qing)"
  },
  "ch_joseon_early_07": {
    "title": "Economia del primo Joseon",
    "theory": "Il primo Joseon stabilì un sistema economico centrato sull'agricoltura.\n\n• Sistema fondiario: Legge Gwajeon (terre di Gyeonggi), legge Jikjeon (re Sejo), sistema Gwansu-gwangeup (re Seongjong)\n• Agricoltura: Nongsa Jikseol (re Sejong), sistemi di classificazione Yeonbun 9deung e Jeonbun 6deung, rotazione su 2 anni con 3 colture\n• Commercio: Mercati Sijeon (Jongno), supervisione del Gyeongsiseo, circolazione limitata del Jeohua e del Joseon Tongbo\n• Artigianato: Centrato sull'artigianato ufficiale, sistema di registrazione degli artigiani\n• Miniere: Estrazione di argento e rame, raffinazione dell'oro e dell'argento"
  },
  "ch_joseon_early_08": {
    "title": "Sistema di caste e società del primo Joseon",
    "theory": "Joseon era una società di caste con Yangban, classe media, contadini e servi.\n\n• Yangban: Funzionari civili e militari, esami e Emseo, privilegi di esenzione\n• Classe media: Funzionari tecnici (interpreti, medici, matematici), figli di concubine\n• Contadini: Contadini, mercanti, artigiani, oneri fiscali e corvée\n• Servi: Schiavi (Ilcheonjeukcheon), Baekjeong, saltimbanchi, ecc.\n• Famiglia: Rafforzamento del sistema patrilineare, compilazione di genealogie, diffusione del sistema Jongbeop"
  },
  "ch_joseon_early_09": {
    "title": "Neo-confucianesimo e educazione del primo Joseon",
    "theory": "Il neo-confucianesimo era l'ideologia di governo e la norma sociale di Joseon.\n\n• Neo-confucianesimo: Teoria del Li e del Qi (dualismo di Yi Hwang, monismo di Yi I)\n• Istituzioni educative: Seonggyungwan (massima educazione), 4 scuole (secondaria), Hyanggyo (locale)\n• Seowon: Istituzioni educative dei Sarim, primo Seowon Baekundong di Ju Se-bung\n• Esami: Esami civili, militari e tecnici, Saengwon e Jinsa (esami preliminari)\n• Rituali: Garye (rituali di Zhu Xi), diffusione delle cerimonie di passaggio, matrimonio, funerale e commemorazione"
  },
  "ch_joseon_early_10": {
    "title": "Opere storiche e geografiche del primo Joseon",
    "theory": "Joseon condusse vari progetti di compilazione sotto la direzione dello stato.\n\n• Opere storiche: Annali di Joseon (UNESCO), Goryeosa e Goryeosa Jeolyo\n• Opere geografiche: Dongguk Yeoji Seungnam, Sinjeung Dongguk Yeoji Seungnam\n• Codici giuridici: Gyeongguk Daejeon (re Seongjong), Daejeon Songnok e Daejeon Husongnok\n• Opere rituali: Gukjo Oryeui (da Sejong a Seongjong)\n• Opere agricole: Nongsa Jikseol (re Sejong)"
  },
  "ch_joseon_early_11": {
    "title": "Scienze e tecniche del primo Joseon",
    "theory": "L'era del re Sejong conobbe un'età d'oro delle scienze e delle tecniche.\n\n• Astronomia: Honcheonui, Ganui, Angbuilgu, Jagyeongnu (Jang Yeong-sil)\n• Pluviometro: Primo strumento di misurazione delle precipitazioni al mondo\n• Stampa: Caratteri Gyemija e Gapinja (caratteri metallici), re Sejong\n• Cartografia: Honil Gangni Yeokdae Gukdo Jido (più antica mappa del mondo esistente)\n• Medicina: Hyangyak Jipseongbang (re Sejong), Uibang Yuchwi, Dongui Bogam (re Gwanghaegun)"
  },
  "ch_joseon_early_12": {
    "title": "Arti del primo Joseon",
    "theory": "Le arti del primo Joseon riflettevano l'ideologia neo-confuciana.\n\n• Pittura: An Gyeon (Sogno di viaggio nel paese dei peschi), Gang Hui-an, sviluppo della pittura letterata\n• Ceramica: Buncheong → porcellana bianca (XVI s.), bellezza semplice e sobria\n• Architettura: Architettura confuciana (palazzi, Jongmyo), Sungnyemun, palazzo Gyeongbok\n• Musica: Organizzazione della musica rituale (Bak Yeon), notazione Jeongganbo (re Sejong)\n• Artigianato: Lavoro del legno, lacca intarsiata di madreperla"
  },
  "ch_joseon_late_01": {
    "title": "Degenerazione della politica delle fazioni",
    "theory": "Alla fine del XVII secolo, la politica delle fazioni degenerò in monopolio di un solo partito.\n\n• Controversia dei riti funebri: Questione di lutto dopo la morte del re Hyojong, Seoin vs Namin\n• Cambiamento Gyeongshin (1680): Estromissione dei Namin, potere dei Seoin\n• Cambiamento Gisa (1689): Estromissione dei Seoin, potere dei Namin, esecuzione di Song Si-yeol\n• Cambiamento Gapsul (1694): Estromissione dei Namin, potere dei Seoin (Noron e Soron)\n• Risultati: Perdita della funzione di controllo reciproco, monopolio di un solo partito"
  },
  "ch_joseon_late_02": {
    "title": "Politica dell'equilibrio",
    "theory": "I re Yeongjo e Jeongjo attuarono la politica di equilibrio per superare i mali delle fazioni.\n\n• Re Yeongjo: Equilibrio moderato (impiego dei moderati), indebolimento del potere del Ijo Jeonrang, legge Gyunyeok\n• Re Jeongjo: Equilibrio rigoroso (basato sulle competenze), istituzione del Gyujanggak, Jangyongyeong, fortezza di Suwon Hwaseong\n• Riforme di Jeongjo: Sistema Chogyemunsin, permesso ai figli di concubine, abolizione dei privilegi dei mercati (Sinhaetongong)\n• Limiti: Crescita delle famiglie potenti, base dell'influenza dei clan materni\n• Significato: Rafforzamento del potere reale, rinascita culturale"
  },
  "ch_joseon_late_03": {
    "title": "Politica dei potenti clan",
    "theory": "Dopo il re Sunjo, i clan materni monopolizzarono il potere nella politica dei potenti clan.\n\n• Clan potenti: Kim di Andong (re Sunjo), Jo di Pungyang (re Heonjong e Cheoljong)\n• Disordine delle tre amministrazioni: Disordini nell'imposta fondiaria, servizio militare e sistema dei prestiti di grano\n• Rivolte contadine: Rivolta di Hong Gyeong-nae (1811), rivolta contadina Imsul (1862, Jinju)\n• Disordini sociali: Profezie e predizioni popolari, rivolte frequenti\n• Risultati: Indebolimento del potere reale, rilassamento della disciplina nazionale, ritardo della modernizzazione"
  },
  "ch_joseon_late_04": {
    "title": "Cambiamenti economici del tardo Joseon",
    "theory": "Nel tardo Joseon, l'economia di mercato e monetaria si sviluppò.\n\n• Agricoltura: Diffusione del trapianto, grandi fattorie (contadini ricchi), colture commerciali (tabacco, ginseng, cotone)\n• Artigianato: Privatizzazione, sistema di credito (fornitura di materie prime dai mercanti)\n• Commercio: Mercanti privati (fuori dai mercati ufficiali), mercanti Song, Man, di Gaeseong, mercati dei 5 giorni\n• Moneta: Circolazione nazionale del Sangpyeong Tongbo (re Sukjong)\n• Miniere: Sistema di concessioni minerarie (gestione privata delle miniere)"
  },
  "ch_joseon_late_05": {
    "title": "Sconvolgimento del sistema di caste nel tardo Joseon",
    "theory": "Nel tardo Joseon, il sistema di caste si destabilizzò e apparvero cambiamenti sociali.\n\n• Classe Yangban: Aumento degli Yangban decaduti, Yangban rurali e poveri\n• Classe media: Movimenti di ascesa sociale, richiesta di diritti agli esami, petizioni\n• Figli di concubine: Richiesta di permesso, accesso ai posti di Geomseogwan al Gyujanggak\n• Classe contadina: Ascesa sociale tramite acquisto di titoli e certificati di merito\n• Schiavi: Liberazione degli schiavi pubblici (re Sunjo, 1801), diminuzione della popolazione servile"
  },
  "ch_joseon_late_06": {
    "title": "Sviluppo del Silhak",
    "theory": "Nel XVII-XVIII secolo, il Silhak (studi pratici) che promuoveva le riforme sociali si sviluppò.\n\n• Scuola Gyeongse Chiyong (agraria): Yu Hyeong-won (Bangye Surok), Yi Ik (Seongho Saseol), Jeong Yak-yong (Mongmin Simseo, Gyeongse Yupyo)\n• Scuola Iyong Husaeng (commerciale): Yu Su-won, Bak Ji-won (Diario di Rehe), Bak Je-ga (Discorso sull'apprendimento dal Nord), Hong Dae-yong\n• Jeong Yak-yong: Gru di sollevamento (fortezza di Suwon Hwaseong), sistema Yeojeonje e Jeongjeonje, Mongmin Simseo\n• Influenza: Arricchimento nazionale e rafforzamento militare, stabilità del popolo, formazione della coscienza moderna\n• Limiti: Non adottato dalla classe dirigente"
  },
  "ch_joseon_late_07": {
    "title": "Sviluppo degli studi nazionali",
    "theory": "Nel tardo Joseon, l'interesse per la cultura e la storia nazionali aumentò.\n\n• Studi linguistici: Sin Gyeong-jun (Hunminjeongeum Unhae), Yu Hui (Eonmunji)\n• Opere storiche: An Jeong-bok (Dongsa Gangmok), Yi Geung-ik (Yeollyeosil Gisul), Han Chi-yun (Haedong Yeoksa)\n• Opere geografiche: Jeong Sang-gi (Dongguk Jido), Kim Jeong-ho (Daedong Yeojido)\n• Enciclopedie: Yi Ik (Seongho Saseol), Yi Deok-mu (Cheongjang Gwanjeon Seo)\n• Caratteristiche: Ricerca empirica e oggettiva, esplorazione dell'identità nazionale"
  },
  "ch_joseon_late_08": {
    "title": "Sviluppo della cultura popolare",
    "theory": "Nel tardo Joseon, la cultura popolare si sviluppò grazie al miglioramento economico delle classi inferiori.\n\n• Letteratura: Romanzi in Hangeul (Hong Gil-dong, Chunhyangjeon), Pansori, Saseol Sijo\n• Pittura: Pitture di genere (Kim Hong-do, Sin Yun-bok), pitture popolari, paesaggi realistici (Jeong Seon)\n• Spettacoli: Danze mascherate (maschere di Bongsan), Pansori, marionette Kkokdu\n• Caratteristiche: Satira degli Yangban, critica sociale, umorismo\n• Kim Jeong-hui: Calligrafia Chusa, Sehan-do (pittura letterata)"
  },
  "ch_joseon_late_09": {
    "title": "Scienze e tecniche del tardo Joseon",
    "theory": "Nel tardo Joseon, le scienze e le tecniche si svilupparono sotto l'influenza del Silhak.\n\n• Cartografia: Jeong Sang-gi (Dongguk Jido, scala 100 li), Kim Jeong-ho (Daedong Yeojido, incisione su legno)\n• Medicina: Heo Jun (Dongui Bogam), Jeong Yak-yong (Magwa Hoetong)\n• Astronomia: Hong Dae-yong (teoria della rotazione terrestre), adozione dell'astronomia occidentale\n• Agricoltura: Bak Se-dang (Saekgyeong), innovazioni tecniche agricole\n• Tecniche: Gru di sollevamento (Jeong Yak-yong), ruota idraulica (promossa dalla Scuola dell'apprendimento dal Nord)"
  },
  "ch_joseon_late_10": {
    "title": "Comparsa di nuove religioni",
    "theory": "Nel tardo Joseon, nuove religioni e pensieri comparvero.\n\n• Cattolicesimo: Introdotto nel XVII s. come studi occidentali, battesimo di Yi Seung-hun (1784), persecuzioni Sinhae e Gihae\n• Donghak: Fondato nel 1860 da Choe Je-u, Innaecheon (l'uomo è il cielo), anti-feudalesimo e anti-imperialismo\n• Pensieri profetici: Jeongamrok, profezie e predizioni popolari\n• Fede in Maitreya: Speranza di salvezza del popolo\n• Caratteristiche: Critica delle contraddizioni sociali, pensiero egualitario"
  },
  "ch_modern_01": {
    "title": "Riforme del Daewongun",
    "theory": "Il Daewongun Heungseon condusse riforme per rafforzare il potere reale e stabilizzare il popolo.\n\n• Rafforzamento del potere reale: Ricostruzione del palazzo Gyeongbok, abolizione del Bibyeonsa, restaurazione del Samgunbu\n• Fine della politica dei clan: Estromissione del clan Kim di Andong, impiego di talenti\n• Riforme delle tre amministrazioni: Hopoje (imposta militare per gli Yangban), Sachangje (sostituzione del prestito di grano)\n• Abolizione dei Seowon: Solo 47 conservati, abolizione dei privilegi di esenzione\n• Rifiuto delle relazioni commerciali: Spedizione francese (1866), spedizione americana (1871), steli di resistenza"
  },
  "ch_modern_02": {
    "title": "Apertura e trattati ineguali",
    "theory": "Nel 1876, Joseon si aprì con il trattato di Ganghwa.\n\n• Incidente del Unyo (1875): Nave da guerra giapponese che viola le acque di Ganghwa\n• Trattato di Ganghwa (1876): Primo trattato moderno, trattato ineguale\n  - Apertura di Busan, Wonsan, Incheon, extraterritorialità, diritti di rilevamento costiero\n• Trattato di Shufeldt (1882): Clausola della nazione più favorita, mediazione\n• Trattati successivi con Gran Bretagna, Germania, Russia e Francia\n• Impatto: Opportunità di modernizzazione, inizio dello sfruttamento economico"
  },
  "ch_modern_03": {
    "title": "Movimento di modernizzazione e resistenza conservatrice",
    "theory": "Dopo l'apertura, riformatori e conservatori si scontrarono.\n\n• Riformatori: Apertura, adozione della cultura occidentale, modernizzazione\n  - Riformatori moderati (Dongdo Seogi): Kim Hong-jip, Eo Yun-jung\n  - Riformatori radicali (civilizzazione): Kim Ok-gyun, Bak Yeong-hyo, Hong Yeong-sik\n• Resistenza conservatrice: Difesa del confucianesimo, rifiuto delle potenze straniere\n  - Yi Hang-no, Gi Jeong-jin, Choe Ik-hyeon (teoria di unità del Giappone e dell'Occidente)\n• Tongni Gimua-mun: Organo di promozione delle politiche di modernizzazione"
  },
  "ch_modern_04": {
    "title": "Ammutinamento Imo e Colpo di Stato Gapsin",
    "theory": "Negli anni 1880, Joseon attraversò un periodo di sconvolgimenti politici.\n\n• Ammutinamento Imo (1882): Rivolta dei soldati tradizionali, ritorno al potere del Daewongun\n  - Intervento Qing, rapimento del Daewongun in Cina, trattato di Jemulpo\n• Colpo di Stato Gapsin (1884): Colpo dei riformatori radicali, 14 articoli di riforma\n  - 3 giorni al potere, fallimento per intervento Qing, esilio di Kim Ok-gyun\n• Risultati: Rafforzamento dell'ingerenza Qing, teoria della neutralizzazione di Joseon\n• Trattati di Hanseong e Tianjin: Equilibrio delle forze Giappone-Qing"
  },
  "ch_modern_05": {
    "title": "Movimento contadino Donghak",
    "theory": "Nel 1894, i contadini Donghak condussero un movimento anti-feudale e anti-imperialista.\n\n• Contesto: Disordine delle tre amministrazioni, sfruttamento economico giapponese, movimento di riabilitazione del fondatore\n• Prima sollevazione: Rivolta di Gobu (Jeon Bong-jun), vittorie di Hwangtohyeon e Hwangnyongchon\n• Armistizio di Jeonju: 12 articoli di riforma, istituzione dei Jipgangso\n• Seconda sollevazione: Resistenza all'occupazione giapponese del palazzo Gyeongbok, sconfitta a Ugeumchi\n• Significato: Anti-feudalesimo e anti-imperialismo, influenza sulle riforme Gabo"
  },
  "ch_modern_06": {
    "title": "Riforme Gabo e Eulmi",
    "theory": "Dal 1894 al 1896, furono condotte riforme moderne.\n\n• Riforme Gabo (1894): Gunguk Gimucheo, abolizione degli esami, abolizione del sistema di caste\n  - Standard argento, unificazione dei pesi e misure, istituzione di tribunali\n• Riforme Eulmi (1895): Calendario solare, decreto sul taglio dei capelli, creazione di scuole primarie\n• Incidente Eulmi (1895): Assassinio della regina Myeongseong da parte del Giappone\n• Rifugio alla legazione russa (1896): Fuga del re Gojong alla legazione russa\n• Limiti: Guidate dal Giappone, resistenza popolare (esercito di giustizia Eulmi)"
  },
  "ch_modern_07": {
    "title": "Club dell'Indipendenza e Impero Coreano",
    "theory": "Alla fine degli anni 1890, si svilupparono movimenti per l'indipendenza e la modernizzazione.\n\n• Club dell'Indipendenza (1896): Seo Jae-pil, giornale Dongnip Sinmun, costruzione della Porta dell'Indipendenza\n  - Assemblea popolare Manmin Gongdonghoe, movimento parlamentare, 6 articoli Heonui\n• Impero Coreano (1897): Incoronazione del re Gojong come imperatore, riforme Gwangmu\n  - Gubonsincha (modernizzazione basata sulla tradizione)\n  - Catasto, rilascio di titoli di proprietà, istituzione del Wonsubu\n• Limiti: Riforme conservatrici, aggravamento dello sfruttamento straniero"
  },
  "ch_modern_08": {
    "title": "Movimento degli eserciti di giustizia anti-giapponesi",
    "theory": "Dopo l'apertura, movimenti di eserciti di giustizia resistettero all'invasione giapponese.\n\n• Esercito di giustizia Eulmi (1895): Resistenza al decreto sui capelli e all'assassinio della regina, guidato dai letterati\n  - Yu In-seok, Yi So-eung e altri\n• Esercito di giustizia Eulsa (1905): Resistenza al trattato Eulsa, Min Jong-sik, Choe Ik-hyeon\n• Esercito di giustizia Jeongmi (1907): Resistenza allo scioglimento dell'esercito, adesione dei soldati sciolti\n  - Esercito delle 13 province (Yi In-yeong), operazione d'assalto su Seul\n• Limiti: Indebolito dalla campagna di pacificazione giapponese nel Sud (1909)"
  },
  "ch_modern_09": {
    "title": "Movimento di riforma patriottico",
    "theory": "Un movimento volto a recuperare la sovranità attraverso lo sviluppo delle capacità nazionali si sviluppò.\n\n• Organizzazioni: Associazione Boan (opposizione alle concessioni di terre incolte), Heonjeong Yeongu-hoe, Daehan Jaganghoe\n• Sinminhoe (1907): An Chang-ho, Yang Gi-tak, società segreta, obiettivo repubblicano\n  - Scuole Osan e Daeseong, libreria Taegeuk, azienda Jagi\n• Educazione: Creazione di scuole private, educazione nazionale\n• Stampa: Hwangseong Sinmun, Daehan Maeil Sinbo (Bethell), movimento di rimborso del debito nazionale\n• Limiti: Enfasi sullo sviluppo delle capacità, repressione giapponese"
  },
  "ch_modern_10": {
    "title": "Processo di perdita della sovranità",
    "theory": "Il Giappone usurpò progressivamente la sovranità di Joseon.\n\n• Trattato Eulsa (1905): Privazione dei diritti diplomatici, istituzione della Residenza generale (Ito Hirobumi)\n• Emissari segreti a L'Aia (1907): Yi Jun, Yi Sang-seol, Yi Wi-jong, abdicazione forzata di Gojong\n• Trattato Jeongmi 7 articoli (1907): Privazione degli affari interni, scioglimento dell'esercito\n• Memorandum Giyu (1909): Privazione dei diritti giudiziari e di polizia\n• Annessione (29 agosto 1910): Trattato di annessione Giappone-Corea, perdita di sovranità\n• Resistenza: Assassinio di Ito Hirobumi da parte di An Jung-geun (1909)"
  },
  "ch_japanese_occupation_01": {
    "title": "Governo militare degli anni 1910",
    "theory": "Negli anni 1910, il Giappone esercitò un governo militare con la gendarmeria.\n\n• Governo Generale di Corea: Governatore generale (generale d'armata o di marina), controllo legislativo, giudiziario ed esecutivo\n• Polizia di gendarmeria: Potere di giudizio sommario (punizione corporale), sorveglianza dei coreani\n• Indagine catastale (1910-1918): Sistema di dichiarazione, confisca delle terre non dichiarate\n  - Istituzione della Compagnia orientale di sviluppo, aumento dei proprietari giapponesi\n• Legge sulle società: Sistema di autorizzazione, repressione del capitale nazionale\n• Educazione: Educazione di ottundimento, restrizione dell'insegnamento del coreano"
  },
  "ch_japanese_occupation_02": {
    "title": "Governo culturale degli anni 1920",
    "theory": "Dopo il Movimento del 1° marzo, il Giappone attuò un governo culturale (politica di pacificazione ingannevole).\n\n• Polizia ordinaria: Abolizione della gendarmeria, in realtà aumento degli effettivi e attrezzature poliziesche\n• Stampa e riunioni: Autorizzazione del Chosun Ilbo e Dong-a Ilbo (con censura), attività della Società della lingua coreana\n• Educazione: Autorizzazione di istituti universitari (Università imperiale di Keijo, 1924), espansione delle scuole primarie\n• Piano di aumento della produzione di riso: Aumento della produzione per l'esportazione in Giappone, carenza alimentare in Corea\n• Limiti: Formazione di collaborazionisti, divisione della nazione"
  },
  "ch_japanese_occupation_03": {
    "title": "Politica di assimilazione degli anni 1930-40",
    "theory": "A partire dagli anni 1930, il Giappone impose una politica di assimilazione per sostenere lo sforzo bellico.\n\n• Giapponesizzazione: Giuramento del suddito imperiale, culto forzato al santuario shintoista, riverenza al palazzo imperiale\n• Distruzione della cultura nazionale: Divieto della lingua coreana, repressione della Società della lingua coreana (1942)\n• Cambio di nome giapponese (1940): Imposizione di nomi giapponesi\n• Sfruttamento umano: Sistema di volontariato → coscrizione, volontari studenti, lavoro forzato\n• Sfruttamento delle donne: Mobilitazione forzata come \"donne di conforto\" dell'esercito giapponese\n• Sfruttamento materiale: Sistema di requisizione, confisca forzata dei metalli"
  },
  "ch_japanese_occupation_04": {
    "title": "Movimento del 1° marzo",
    "theory": "Il Movimento del 1° marzo 1919 fu il più grande movimento nazionale sotto l'occupazione giapponese.\n\n• Contesto: Principio di autodeterminazione di Wilson, Dichiarazione d'indipendenza dell'8 febbraio (Tokyo), voci di avvelenamento di Gojong\n• Svolgimento: 1° marzo al parco Tapgol, lettura della Dichiarazione d'indipendenza, manifestazioni di Mansé\n  - Da studenti e religiosi a tutte le classi, espansione nazionale poi internazionale (Gando, Primorje)\n• Repressione giapponese: Massacro di Jeam-ri, incendio della fortezza di Suwon\n• Significato: Istituzione del Governo provvisorio, passaggio dalla non-violenza alla lotta armata\n• Influenza: Movimento del 4 maggio in Cina, movimento non-violento in India"
  },
  "ch_japanese_occupation_05": {
    "title": "Governo Provvisorio della Repubblica di Corea",
    "theory": "Nel 1919, il Governo Provvisorio della Repubblica di Corea fu istituito a Shanghai.\n\n• Istituzione: Shanghai (governo unificato), regime democratico repubblicano, presidente Yi Seung-man\n• Attività: Sistema Yeontongje e Ufficio dei trasporti, giornale Dongnip Sinmun, ufficio di compilazione storica\n• Crisi: Destituzione di Yi Seung-man, divisione al Congresso nazionale dei rappresentanti (1923)\n• Direzione di Kim Gu: Corpo patriottico coreano, attentato di Yun Bong-gil (1932)\n• Trasferimento a Chongqing (1940): Creazione dell'Esercito di liberazione di Corea, dichiarazione di guerra al Giappone\n• Significato: Centro del movimento d'indipendenza, tradizione democratica repubblicana"
  },
  "ch_japanese_occupation_06": {
    "title": "Lotta armata e Corpo patriottico coreano",
    "theory": "A partire dagli anni 1920, si svilupparono azioni armate individuali.\n\n• Corpo dei Giusti (1919): Kim Won-bong, Sin Chae-ho (Dichiarazione della rivoluzione coreana), lotta violenta\n  - Bak Jae-hyeok (commissariato di Busan), Kim Ik-sang (Governo Generale), Na Seok-ju (Compagnia orientale)\n• Corpo patriottico coreano (1931): Organizzato da Kim Gu, operazioni speciali\n  - Yi Bong-chang: Attentato con bomba contro l'imperatore giapponese (1932, fallito)\n  - Yun Bong-gil: Attentato al parco Hongkou di Shanghai (1932), eliminazione di generali giapponesi\n• Significato: Dimostrazione della volontà d'indipendenza, catalizzatore del supporto cinese"
  },
  "ch_japanese_occupation_07": {
    "title": "Guerra d'indipendenza armata",
    "theory": "A partire dagli anni 1920, una guerra d'indipendenza armata si sviluppò in Manciuria e in Cina.\n\n• Battaglia di Bongodong (1920): Hong Beom-do e l'Esercito d'indipendenza coreano, grande vittoria sull'esercito giapponese\n• Vittoria di Cheongsan-ri (1920): Kim Jwa-jin e l'Amministrazione militare del Nord, più grande vittoria\n• Massacro di Gando (1920): Massacro di coreani a Gando da parte dell'esercito giapponese\n• Incidente di Svobodny (1921): Sacrificio di combattenti indipendentisti da parte dell'Armata rossa sovietica\n• Unificazione dei 3 governi: Chamui-bu, Jeongui-bu, Sinmin-bu → Gukmin-bu, Hyeoksin Uihoe\n• Esercito di liberazione di Corea (1940): Sotto il Governo provvisorio, preparazione dell'operazione di infiltrazione"
  },
  "ch_japanese_occupation_08": {
    "title": "Movimenti sociali ed economici nazionali",
    "theory": "Sotto l'occupazione giapponese, si svilupparono vari movimenti sociali ed economici.\n\n• Movimento per i prodotti nazionali (1920): Jo Man-sik, uso dei prodotti locali, \"La mia vita con i miei prodotti\"\n• Movimento per un'università nazionale (1922): Yi Sang-jae, raccolta fondi, ostruzione giapponese\n• Movimento contadino: Conflitti di mezzadria (conflitto di mezzadria di Amtae-do)\n• Movimento operaio: Sciopero generale di Wonsan (1929), Federazione generale del lavoro di Corea\n• Singanhoe (1927): Partito unico nazionale, coalizione sinistra-destra, supporto al movimento studentesco di Gwangju"
  },
  "ch_japanese_occupation_09": {
    "title": "Movimento di preservazione della cultura nazionale",
    "theory": "Sotto l'occupazione giapponese, continuarono sforzi per preservare la cultura e l'identità nazionali.\n\n• Studi linguistici: Società della lingua coreana (Regole di ortografia unificate dell'Hangeul, lingua standard), istituzione del Giorno dell'Hangeul\n• Studi storici: Bak Eun-sik (Storia dolorosa della Corea), Sin Chae-ho (Storia antica della Corea), storiografia nazionalista\n• Movimento di studi coreani: Jeong In-bo (studi coreani), Mun Il-pyeong, An Jae-hong\n• Educazione: Scuole nazionali private (Osan, Daeseong), movimento di scuole serali\n• Religione: Cheondogyo, Daejonggyo, Won-buddismo, risveglio della coscienza nazionale"
  },
  "ch_japanese_occupation_10": {
    "title": "Attività dei coreani all'estero",
    "theory": "Sotto l'occupazione giapponese, anche i coreani all'estero parteciparono al movimento d'indipendenza.\n\n• Manciuria: Seogando (Gyeonghaksa, Scuola militare Sinheung), Bukgando (Scuola Myeongdong, massacro di Gando)\n• Primorje: Gwoneopoe, Governo militare di liberazione della Corea, incidente di Svobodny\n• America: Associazione nazionale coreana, Bak Yong-man (addestramento militare), Yi Seung-man (attività diplomatiche)\n• Hawaii: Lavoro nelle piantagioni di canna da zucchero, supporto finanziario all'indipendenza\n• Giappone: Dichiarazione d'indipendenza dell'8 febbraio, movimento studentesco"
  },
  "ch_contemporary_01": {
    "title": "Liberazione e divisione",
    "theory": "Il 15 agosto 1945, venne la liberazione, ma la penisola coreana fu divisa.\n\n• Liberazione: Resa incondizionata del Giappone, frutto del movimento d'indipendenza\n• Divisione: Occupazione americana e sovietica divisa al 38° parallelo\n• Comitato preparatorio alla fondazione dello Stato: Yeo Un-hyeong, proclamazione della Repubblica popolare (non riconosciuta dal governo militare americano)\n• Conferenza dei ministri degli Esteri di Mosca (1945): Istituzione di un governo provvisorio, tutela di 5 anni\n  - Pro-tutela (sinistra) vs anti-tutela (destra)\n• Commissione congiunta americano-sovietica: Fallimento, trasferimento all'ONU"
  },
  "ch_contemporary_02": {
    "title": "Istituzione del governo della Repubblica di Corea",
    "theory": "Nel 1948, fu istituito il governo della Repubblica di Corea.\n\n• Risoluzione dell'ONU: Elezioni generali proporzionali alla popolazione, rifiuto sovietico\n• Negoziati Nord-Sud (1948): Kim Gu, Kim Gyu-sik, visita a Pyongyang, fallimento\n• Elezioni generali del 10 maggio (1948): Sotto sorveglianza dell'ONU, formazione dell'Assemblea costituente\n• Costituzione fondatrice: Repubblica democratica, sistema presidenziale misto con elementi parlamentari\n• Istituzione del governo (15 agosto 1948): Yi Seung-man primo presidente\n• Riconoscimento dell'ONU: Unico governo legittimo della penisola coreana"
  },
  "ch_contemporary_03": {
    "title": "Guerra di Corea",
    "theory": "Il 25 giugno 1950, la guerra scoppiò a seguito dell'invasione nordcoreana.\n\n• Contesto: Dichiarazione della linea Acheson, preparativi di guerra nordcoreani\n• Svolgimento: Invasione nordcoreana → linea di difesa del Nakdong → sbarco di Incheon → riconquista di Seul\n  → avanzata verso lo Yalu → intervento cinese → ritirata del 4 gennaio → stallo al 38° parallelo\n• Armistizio (27 luglio 1953): Panmunjeom, stato di armistizio attuale\n• Perdite: Milioni di vittime, 10 milioni di famiglie separate, devastazione del territorio\n• Impatto: Rafforzamento dell'ideologia anticomunista, consolidamento della divisione"
  },
  "ch_contemporary_04": {
    "title": "Governo di Yi Seung-man e Rivoluzione del 19 aprile",
    "theory": "Contro il lungo regno del governo di Yi Seung-man, scoppiò la Rivoluzione del 19 aprile.\n\n• Governo Yi Seung-man: Politica anticomunista, emendamento per estrazione (1952), emendamento dei quattro arrotondati (1954)\n• Elezioni truccate del 15 marzo (1960): Frode elettorale del Partito liberale per presidenza e vicepresidenza\n• Rivoluzione del 19 aprile: Manifestazioni di Masan → scoperta del corpo di Kim Ju-yeol → estensione nazionale\n  - Richieste di democratizzazione da studenti e cittadini, legge marziale, manifestazione dei professori\n• Risultato: Dimissioni di Yi Seung-man, governo provvisorio di Heo Jeong, Seconda Repubblica (gabinetto Chang Myeon)\n• Significato: Movimento di democratizzazione di studenti e cittadini, prima rivoluzione democratica"
  },
  "ch_contemporary_05": {
    "title": "Governo di Park Chung-hee",
    "theory": "Nel 1961, il governo di Park Chung-hee fu istituito attraverso un colpo di stato militare.\n\n• Colpo di Stato del 16 maggio (1961): Presa del potere da parte dell'esercito, Consiglio supremo per la ricostruzione nazionale\n• Terza Repubblica (1963): Regime presidenziale, Piani quinquennali di sviluppo economico\n• Accordo Corea-Giappone (1965): Normalizzazione delle relazioni, manifestazioni del 3 giugno (opposizione)\n• Regime Yushin (1972): Yushin d'ottobre, potere di decreti d'emergenza, Conferenza nazionale per l'unificazione\n• Sollevamento democratico di Busan-Masan (1979): Manifestazioni a Busan e Masan\n• Incidente del 26 ottobre (1979): Assassinio di Park Chung-hee"
  },
  "ch_contemporary_06": {
    "title": "Governo di Chun Doo-hwan e movimento di democratizzazione",
    "theory": "Nel 1980, il nuovo gruppo militare di Chun Doo-hwan prese il potere.\n\n• Incidente del 12 dicembre (1979): Presa del comando militare da parte del nuovo gruppo di Chun Doo-hwan\n• Movimento di democratizzazione del 18 maggio (1980): Gwangju, resistenza all'estensione della legge marziale, organizzazione di milizie cittadine\n  - Repressione militare da parte del nuovo gruppo, centinaia di vittime\n• Quinta Repubblica: Presidente eletto indirettamente, mandato unico di 7 anni\n• Sollevamento di giugno (1987): Richieste di abolizione della costituzione Hoheon e di elezione diretta, sacrificio di Lee Han-yeol\n• Dichiarazione del 29 giugno: Accettazione dell'emendamento per l'elezione diretta, Roh Tae-woo\n• Significato: Punto di svolta decisivo verso la democratizzazione"
  },
  "ch_contemporary_07": {
    "title": "Sviluppo della democrazia",
    "theory": "Dal 1987, la democrazia si è sviluppata con alternanze pacifiche del potere.\n\n• Sesta Repubblica (1988): Elezione presidenziale diretta, mandato unico di 5 anni\n• Governo Roh Tae-woo: Diplomazia del Nord, relazioni con URSS e Cina, adesione simultanea delle due Coree all'ONU (1991)\n• Governo Kim Young-sam: Governo civile, sistema dei nomi reali bancari, rettifica storica, crisi del FMI\n• Governo Kim Dae-jung: Prima alternanza pacifica, summit intercoreano (2000), Dichiarazione del 15 giugno\n• Da allora: Elezioni democratiche, progresso dei diritti umani e della libertà di stampa"
  },
  "ch_contemporary_08": {
    "title": "Sviluppo economico e cambiamenti sociali",
    "theory": "La Repubblica di Corea ha sperimentato una rapida crescita economica e cambiamenti sociali.\n\n• Sviluppo economico: 1°-4° Piani quinquennali (1962-1981)\n  - Dall'industria leggera all'industria pesante e chimica, crescita trainata dalle esportazioni\n• Miracolo del Han: Da beneficiario a donatore di aiuti, adesione all'OCSE (1996)\n• Crisi del FMI (1997): Crisi valutaria, ristrutturazione, superata\n• Cambiamenti sociali: Urbanizzazione, famiglia nucleare, invecchiamento, potenza informatica\n• Cultura: Hallyu (K-pop, drama, cinema), risonanza mondiale"
  },
  "ch_contemporary_09": {
    "title": "Evoluzione della politica di riunificazione",
    "theory": "La politica di riunificazione del governo sudcoreano è evoluta nel tempo.\n\n• Yi Seung-man: Teoria della riunificazione marciando verso il Nord (riunificazione con la forza)\n• Park Chung-hee: Dichiarazione congiunta del 4 luglio (1972), autonomia, pace, grande unità nazionale\n• Chun Doo-hwan: Riunione delle famiglie separate (1985)\n• Roh Tae-woo: Diplomazia del Nord, Accordo fondamentale intercoreano (1991)\n• Kim Dae-jung: Politica del Raggio di sole, turismo al monte Geumgang, primo summit intercoreano (2000)\n• Da allora: Zona industriale di Gaeseong, 2° e 3° summit"
  },
  "ch_contemporary_10": {
    "title": "Evoluzione della Corea del Nord e relazioni intercoreane",
    "theory": "Dalla divisione, il regime nordcoreano e le relazioni intercoreane sono evoluti.\n\n• Regime nordcoreano: Kim Il-sung → Kim Jong-il → Kim Jong-un, successione su 3 generazioni\n  - Ideologia Juche, politica del Songun (priorità militare), sviluppo nucleare\n• Relazioni intercoreane: Confronto (1950-1970) → Dialogo (1970-) → Riconciliazione e cooperazione (1990-)\n  - Alternanza di tensioni e distensione\n• Eventi importanti: Attentato di Rangoon (1983), Cheonan (2010), Yeonpyeong (2010)\n• Scambi intercoreani: Riunioni delle famiglie separate, turismo al monte Geumgang, zona industriale di Gaeseong\n• Sfide: Instaurazione della pace, preparazione alla riunificazione, riconciliazione nazionale"
  }
}
