{
  "ch_prehistoric_01": {
    "title": "Zaman Paleolitikum",
    "theory": "Zaman Paleolitikum dimulai sekitar 700.000 tahun yang lalu. Manusia menggunakan alat batu yang dipahat (kapak genggam, alat pemotong) dan tinggal di gua atau tempat berlindung di tepi sungai. Mereka hidup dengan berburu dan meramu, serta hidup berkelompok.\n\n• Situs penting: Jeongok-ri di Yeoncheon (kapak genggam tipe Acheulean), Seokjang-ri di Gongju, Geomeunmoru di Sangwon, Durubong di Cheongwon\n• Ciri khas: Kehidupan nomaden, masyarakat egaliter, penggunaan api"
  },
  "ch_prehistoric_02": {
    "title": "Zaman Neolitikum",
    "theory": "Zaman Neolitikum dimulai sekitar 10.000 tahun yang lalu (sekitar 8000 SM). Manusia menggunakan alat batu yang diasah dan tembikar bermotif sisir. Pertanian dan peternakan dimulai, yang mengarah pada kehidupan menetap di rumah setengah bawah tanah.\n\n• Situs penting: Amsa-dong di Seoul, Dongsam-dong di Busan, Osan-ri di Yangyang\n• Kepercayaan: Animisme, totemisme, shamanisme\n• Ciri khas: Kumparan pemintal dan jarum tulang (tenun primitif), tumpukan kerang (kjokkenmodding)"
  },
  "ch_prehistoric_03": {
    "title": "Zaman Perunggu",
    "theory": "Zaman Perunggu dimulai sekitar 2000-1500 SM. Perunggu digunakan terutama untuk senjata dan alat upacara, sementara alat pertanian masih menggunakan batu (pisau batu berbentuk bulan sabit). Budidaya padi menjadi intensif dan kelas sosial mulai muncul.\n\n• Tembikar: Tembikar polos, tembikar tipe Misong-ri\n• Perunggu: Belati berbentuk mandolin, cermin bermotif kasar\n• Makam: Dolmen (tipe meja/tipe papan catur), makam lempengan batu\n• Masyarakat: Masyarakat kepala suku, kepercayaan pada orang pilihan"
  },
  "ch_prehistoric_04": {
    "title": "Zaman Besi",
    "theory": "Zaman Besi dimulai sekitar abad ke-5-4 SM. Besi digunakan untuk alat pertanian dan senjata, meningkatkan produktivitas pertanian dan perang penaklukan menjadi aktif. Perdagangan dengan Tiongkok berkembang.\n\n• Alat besi: Alat pertanian besi (sabit besi, cangkul besi), senjata besi\n• Perunggu: Belati perunggu ramping, cermin bermotif halus (gaya Korea)\n• Makam: Makam peti kayu, makam guci\n• Perubahan: Masuknya mata uang Tiongkok (Mingdaoqian, Banliang), penggunaan kaligrafi kuas"
  },
  "ch_gojoseon_01": {
    "title": "Pendirian dan Perkembangan Gojoseon",
    "theory": "Gojoseon didirikan pada 2333 SM oleh Dangun Wanggeom (menurut catatan Samguk Yusa). Negara ini berkembang di wilayah Liaoning dan Korea Utara berdasarkan budaya perunggu.\n\n• Perkembangan: Dangun Joseon → Gija Joseon (legenda) → Wiman Joseon\n• Wiman Joseon: Didirikan pada 194 SM ketika Wiman menggulingkan Raja Jun\n• Masa kejayaan: Menerima budaya besi, perdagangan transit antara Han dan Jin\n• Keruntuhan: 108 SM diserang Kaisar Wu dari Han, empat komando Han didirikan"
  },
  "ch_gojoseon_02": {
    "title": "Masyarakat dan Budaya Gojoseon",
    "theory": "Gojoseon menjaga ketertiban sosial dengan Delapan Larangan (Beomgeum 8 Jo). Hanya 3 pasal yang tersisa hingga kini.\n\n• Delapan Larangan (yang tersisa):\n  - Siapa yang membunuh orang akan dihukum mati\n  - Siapa yang melukai orang lain harus membayar ganti rugi dengan biji-bijian\n  - Siapa yang mencuri akan dijadikan budak (tebusan 500.000 uang)\n\n• Makna: Penghormatan terhadap kehidupan, perlindungan hak milik pribadi, penghargaan tenaga kerja\n• Masyarakat: Masyarakat berkelas, hukum adat pidana ada"
  },
  "ch_gojoseon_03": {
    "title": "Pertumbuhan Berbagai Negara",
    "theory": "Setelah jatuhnya Gojoseon, berbagai negara tumbuh di Manchuria dan Semenanjung Korea.\n\n• Buyeo: Konfederasi 5 suku, Yeonggo (upacara langit Desember), penguburan pengikut, 1 Chaek 12 Beop\n• Goguryeo: Konfederasi 5 suku, Dongmaeng (Oktober), Seookje (sistem menantu tinggal di rumah mertua)\n• Okjeo: Membayar upeti ke Goguryeo, sistem menantu perempuan muda, Goljangje (makam keluarga bersama)\n• Dongye: Mucheon (Oktober), eksogami, Chaekhwa (ganti rugi jika melanggar batas)\n• Samhan: Mahan, Jinhan, Byeonhan, Sodo (Cheongun), upacara langit Mei dan Oktober"
  },
  "ch_three_kingdoms_01": {
    "title": "Pendirian dan Pertumbuhan Goguryeo",
    "theory": "Goguryeo didirikan pada 37 SM oleh Jumong di Jolbon. Negara ini berkembang di daerah pegunungan sepanjang Sungai Amnok menjadi negara penakluk.\n\n• Raja Taejo: Menaklukkan Okjeo, mencoba ekspansi ke Liaodong\n• Raja Gogukcheon: Jindaebop (bantuan untuk orang miskin), reorganisasi sistem 5 bu\n• Raja Dongcheon: Krisis akibat invasi Guanqiujian dari Wei\n• Ciri khas: Dewan Jega, Gyeongdang (pendidikan pemuda), Seookje"
  },
  "ch_three_kingdoms_02": {
    "title": "Masa Kejayaan Goguryeo",
    "theory": "Pada abad ke-4-5, Goguryeo tumbuh menjadi kekuatan besar Asia Timur.\n\n• Raja Sosurim: Menerima agama Buddha (372), mendirikan Taehak, mengumumkan hukum\n• Raja Gwanggaeto: Ekspansi wilayah (Manchuria, Korea Utara), membantu Silla (mengusir Wae)\n• Raja Jangsu: Pindah ibu kota ke Pyongyang (427), kebijakan ekspansi ke selatan, menguasai lembah Sungai Han\n• Prasasti Gwanggaeto: Catatan sejarah Goguryeo, terletak di Jilin, Manchuria\n• Wilayah terluas: Manchuria hingga Korea tengah (sampai Chungju)"
  },
  "ch_three_kingdoms_03": {
    "title": "Perlawanan Luar Negeri dan Keruntuhan Goguryeo",
    "theory": "Pada abad ke-6-7, Goguryeo melawan invasi Sui dan Tang.\n\n• Eulji Mundeok: Pertempuran Salsu (612), mengalahkan 300.000 tentara Kaisar Yang dari Sui\n• Yeon Gaesomun: Membangun Tembok Sepanjang Seribu Li, mengusir Kaisar Taizong Tang (Pertempuran Benteng Ansi, 645)\n• Perlawanan luar negeri: Mengusir 4 invasi Sui, 3 invasi Tang\n• Keruntuhan: 668 dikalahkan oleh aliansi Silla-Tang\n• Penyebab: Perpecahan kelas penguasa, perebutan kekuasaan setelah kematian Yeon Gaesomun"
  },
  "ch_three_kingdoms_04": {
    "title": "Pendirian dan Pertumbuhan Baekje",
    "theory": "Baekje didirikan pada 18 SM oleh Onjo di Wireseong (lembah Sungai Han). Negara ini berkembang berbasis lembah Sungai Han.\n\n• Raja Goi: Mereorganisasi sistem pangkat dan pakaian resmi, mengumumkan hukum, 6 Jwapyeong\n• Raja Geunchogo: Menyatukan Mahan, menyerang Goguryeo (Raja Gogugwon tewas)\n• Wilayah: Ekspansi ke Liaosi, Shandong, Kyushu (Pedang Tujuh Cabang)\n• Ciri khas: Perdagangan maritim berkembang, pertukaran dengan Dinasti Selatan"
  },
  "ch_three_kingdoms_05": {
    "title": "Masa Kejayaan dan Kebangkitan Baekje",
    "theory": "Masa kejayaan terjadi pada abad ke-4 di bawah Raja Geunchogo, tetapi kemudian menyusut akibat ekspansi Goguryeo ke selatan.\n\n• Raja Geunchogo: Menaklukkan Mahan, mengamankan Hwanghae-do dan Jeolla-do, memberikan Pedang Tujuh Cabang ke Wae\n• Raja Gaero: Jatuhnya Hanseong (475), tewas melawan Raja Jangsu Goguryeo\n• Pindah ke Ungjin (475): Ibu kota dipindahkan ke Gongju\n• Raja Muryeong: Kebangkitan, mengirim 22 Damno (gubernur daerah), pertukaran dengan Liang\n• Raja Seong: Pindah ke Sabi (538), nama negara Nambuyeo, mencoba merebut lembah Sungai Han (tewas di Gwansanseong)"
  },
  "ch_three_kingdoms_06": {
    "title": "Gerakan Kebangkitan dan Keruntuhan Baekje",
    "theory": "Pada abad ke-7, Baekje dikalahkan oleh aliansi Silla-Tang.\n\n• Raja Uija: Menyerang Silla (jatuhnya Daeyaseong), kekacauan politik di akhir masa\n• Keruntuhan: 660 Sabiseong jatuh oleh aliansi Silla-Tang (Kim Yusin, Su Dingfang)\n• Gerakan kebangkitan: Dipimpin Boksin, Dochim, Heukchi Sangji, dengan dukungan Wae\n• Pertempuran Baekgang (663): Armada Wae kalah, gerakan kebangkitan gagal\n• Makna: Sebagian pengungsi Baekje pindah ke Wae dan Silla, menyebarkan budaya"
  },
  "ch_three_kingdoms_07": {
    "title": "Pendirian dan Perkembangan Silla",
    "theory": "Silla didirikan pada 57 SM oleh Bak Hyeokgeose di Saroguk (Gyeongju). Paling lambat berkembang di antara Tiga Kerajaan.\n\n• Raja Naemul: Menetapkan suksesi turun-temurun klan Kim, gelar Maripgan\n• Raja Beopheung: Mengakui agama Buddha (pengorbanan Ichadon), mengumumkan hukum, mereorganisasi sistem Golpum, menggabungkan Geumgwan Gaya\n• Raja Jinheung: Mereorganisasi Hwarangdo, mengamankan lembah Sungai Han, menaklukkan dataran Hamheung dan Daegaya\n• Prasasti Sunsubi: Prasasti Bukhansan, Prasasti Changnyeong, Prasasti Maunryeong, Prasasti Hwangchoryeong"
  },
  "ch_three_kingdoms_08": {
    "title": "Masa Kejayaan dan Penyatuan Tiga Kerajaan oleh Silla",
    "theory": "Pada abad ke-7, Silla bersekutu dengan Tang untuk menyatukan Tiga Kerajaan.\n\n• Ratu Seondeok: Membangun Cheomseongdae, Pagoda Kayu 9 Lantai Hwangnyongsa\n• Raja Taejong Muyeol (Kim Chunchu): Raja Jingol pertama, bersekutu dengan Tang\n• Raja Munmu: Setelah jatuhnya Baekje (660) dan Goguryeo (668), mengusir Tang\n• Perang Silla-Tang: Mengusir Tang dalam Pertempuran Maeso dan Gibeolpo (676)\n• Makna: Penyatuan selatan Sungai Daedong hingga Teluk Wonsan, dasar budaya nasional"
  },
  "ch_three_kingdoms_09": {
    "title": "Pembentukan dan Perkembangan Gaya",
    "theory": "Gaya adalah kerajaan konfederasi yang tumbuh di lembah Sungai Nakdong. Berkembang melalui produksi besi dan perdagangan maritim.\n\n• Gaya awal: Berpusat di Geumgwan Gaya (Gimhae), mewarisi Byeonhan\n• Gaya akhir: Berpusat di Daegaya (Goryeong), masa kejayaan abad ke-5-6\n• Ciri khas: Ekspor besi (ke Wae dan Nangnang), kerajaan konfederasi (gagal bersatu)\n• Keruntuhan: Geumgwan Gaya (532, Raja Beopheung), Daegaya (562, Raja Jinheung)\n• Budaya: Gayageum, baju besi besi, tradisi penguburan pengikut"
  },
  "ch_three_kingdoms_10": {
    "title": "Buddhisme dan Pemikiran Tiga Kerajaan",
    "theory": "Buddhisme berkontribusi pada penguatan kekuasaan kerajaan dan persatuan negara.\n\n• Goguryeo: 372 Sundo datang dari Former Qin (Raja Sosurim)\n• Baekje: 384 Marananta datang dari Eastern Jin (Raja Chimnyu)\n• Silla: 527 diakui setelah pengorbanan Ichadon (Raja Beopheung)\n• Ciri khas: Buddhisme pelindung negara, diterima di tingkat negara"
  },
  "ch_three_kingdoms_11": {
    "title": "Makam Kuno dan Situs Tiga Kerajaan",
    "theory": "Makam kuno Tiga Kerajaan menunjukkan karakteristik budaya masing-masing negara.\n\n• Goguryeo: Makam batu bertumpuk → Makam ruang batu koridor, Mural (Makam Muyong, Makam Gakjeo, Makam Ssangyeong)\n• Baekje: Makam ruang batu koridor, Makam Raja Muryeong (makam bata), Lukisan Empat Dewa Penjaga\n• Silla: Makam tumpukan batu dengan peti kayu (Makam Cheonma, Makam Hwangnam Besar), mahkota emas ditemukan\n• Silla Bersatu: Makam ruang batu koridor (pengaruh kremasi)\n• Balhae: Makam Putri Jeonghye (makam ruang batu koridor), mewarisi Goguryeo"
  },
  "ch_three_kingdoms_12": {
    "title": "Seni dan Teknologi Sains Tiga Kerajaan",
    "theory": "Tiga Kerajaan mengembangkan seni dan teknologi sains yang unik.\n\n• Goguryeo: Mural makam kuno (Empat Dewa Penjaga), lukisan berburu Makam Muyong\n• Baekje: Pembakar Dupa Perunggu Berlapis Emas, Buddha Batu Seosan, Pagoda Batu Mireuksa\n• Silla: Cheomseongdae (observatorium tertua Asia Timur), Pagoda Kayu 9 Lantai Hwangnyongsa, mahkota emas\n• Sains: Pengamatan astronomi, penggunaan kalender, perkembangan pembuatan kapal\n• Penyebaran ke Jepang: Ajikgi dan Wangin (huruf Tiongkok dan Konfusianisme), Damjing (kertas, tinta, pewarna)"
  },
  "ch_north_south_states_01": {
    "title": "Politik Silla Bersatu",
    "theory": "Silla Bersatu membangun kekuasaan kerajaan yang kuat dan sistem pemerintahan terpusat.\n\n• Raja Sinmun: Menghapus Nogeup, memberikan Gwanryojeon, mendirikan Gukhak, 9 Ju 5 Sogyeong\n• Sistem pemerintahan: Jipsabu (kantor tertinggi), Sangdaedeung (perwakilan bangsawan)\n• Daerah: 9 Ju 5 Sogyeong, Woesajeong (pengawas), Hyang dan Bugok (distrik administrasi khusus)\n• Militer: 9 Seodang (tentara pusat), 10 Jeong (tentara daerah)\n• Periode akhir: Perebutan tahta, pertumbuhan bangsawan lokal, pemberontakan 6 Dupum"
  },
  "ch_north_south_states_02": {
    "title": "Ekonomi Silla Bersatu",
    "theory": "Ekonomi Silla Bersatu berkembang dengan perluasan wilayah.\n\n• Sistem tanah: Gwanryojeon (hak pajak pejabat), Jeongjeon (tanah petani)\n• Dokumen Minjeong: Survei populasi, tanah, dan ternak desa (setiap 3 tahun), ditemukan di Shosoin Jepang\n• Perdagangan: Pasar Timur dan Barat Gyeongju, pelabuhan internasional (Cheonghaejin, Pelabuhan Ulsan)\n• Jang Bogo: Mendirikan Cheonghaejin (828), menguasai jalur laut, perdagangan transit Tang-Silla-Wae\n• Kerajinan: Pengerjaan emas dan perak, tenun sutra"
  },
  "ch_north_south_states_03": {
    "title": "Masyarakat Silla Bersatu",
    "theory": "Silla Bersatu adalah masyarakat berbasis sistem Golpum (tulang-pangkat).\n\n• Sistem Golpum: Seonggol → Jingol → 6-1 Dupum, pembatasan pangkat dan kehidupan sehari-hari\n• Jingol: Bangsawan tertinggi, hak suksesi tahta, di bawah 5 Dupum dibatasi pangkatnya\n• 6 Dupum: Maju melalui akademik dan agama, pelajar di Tang, intelektual kritis\n• Gejolak periode akhir: Perebutan tahta, konflik internal Jingol, pemberontakan 6 Dupum\n• Pertumbuhan bangsawan lokal: Kekuatan daerah tumbuh mandiri, dasar pendirian Tiga Kerajaan Akhir"
  },
  "ch_north_south_states_04": {
    "title": "Budaya Silla Bersatu",
    "theory": "Silla Bersatu mengembangkan budaya nasional dengan memadukan budaya Tiga Kerajaan.\n\n• Buddhisme: Sekte Hwaeom (Uisang), perkembangan Gyojong, popularitas Seonjong (periode akhir)\n• Wonhyo: Pemikiran Hwajaeng, memasyarakatkan Buddhisme, Lagu Muae\n• Arsitektur: Kuil Bulguksa, Gua Seokguram (Buddha utama), Pagoda Dabo dan Pagoda Seokga\n• Lonceng: Lonceng Raja Seongdeok (Lonceng Emille), Lonceng Perunggu Kuil Sangwonsa\n• Sastra: Hyangga (Lagu Cheoyong, Lagu Jemangmae), Seolchong (menyusun Idu)"
  },
  "ch_north_south_states_05": {
    "title": "Pendirian dan Politik Balhae",
    "theory": "Balhae didirikan pada 698 oleh Dae Joyeong di Gunung Dongmo. Negara ini didirikan bersama oleh pengungsi Goguryeo dan suku Mohe.\n\n• Dae Joyeong: Berasal dari jenderal Goguryeo, mendirikan negara setelah mengalahkan Tang\n• Raja Mu: Berkonfrontasi dengan Tang, serangan Jang Munhyu ke Semenanjung Shandong\n• Raja Mun: Berdamai dengan Tang, pindah ibu kota ke Sanggyeong, mereorganisasi 3 Seong 6 Bu\n• Raja Seon: Wilayah terluas, gelar 'Haedong Seongguk'\n• Keruntuhan: 926 dikalahkan oleh Khitan"
  },
  "ch_north_south_states_06": {
    "title": "Masyarakat dan Budaya Balhae",
    "theory": "Balhae mewarisi budaya Goguryeo dan juga menerima pengaruh Tang.\n\n• Pemerintahan: 3 Seong 6 Bu (sistem Tang), daerah 5 Gyeong 15 Bu 62 Ju\n• Warisan Goguryeo: Ondol, lentera batu, patung Buddha duduk berdampingan, struktur Makam Putri Jeonghyo\n• Pengaruh Tang: Jujagam (pendidikan Konfusianisme), mengikuti ujian Bingongkwa\n• Hubungan luar negeri: Pertukaran dengan Tang, Silla, Wae, Jalan Silla (jalur transportasi)\n• Warisan budaya: Situs Sanggyeong Yongcheonbu, Makam Putri Jeonghye dan Jeonghyo"
  },
  "ch_goryeo_01": {
    "title": "Pendirian dan Sistem Pemerintahan Goryeo",
    "theory": "Pada 918, Wang Geon menggulingkan Gungye dan mendirikan Goryeo. Ia menyatukan Tiga Kerajaan Akhir (936) dan mengintegrasikan bangsawan lokal.\n\n• Integrasi bangsawan lokal: Kebijakan pernikahan (29 istri), kebijakan pemberian nama marga, sistem Giin, sistem Sasimgwan\n• 10 Perintah Hunyo: Wasiat untuk raja-raja berikutnya\n• Sistem pemerintahan: 2 Seong (Jungseomunhaseong dan Sangseo Seong), 6 Bu, Jungchuwon, Samsa\n• Dobyeongmasa dan Sikmokdogam: Lembaga khas Goryeo\n• Daerah: 5 Do 2 Gye, Hyang, Bugok, So (distrik administrasi khusus)"
  },
  "ch_goryeo_02": {
    "title": "Pembentukan dan Gejolak Masyarakat Aristokrat",
    "theory": "Periode awal Goryeo didominasi oleh aristokrat sastra (Munbeol Gwijok).\n\n• Aristokrat sastra: Memonopoli jabatan melalui ujian negara dan Eumseo, mewarisi Gongumjeon\n• Pemberontakan Yi Ja-gyeom (1126): Usaha memonopoli kekuasaan oleh keluarga ipar raja\n• Pemberontakan Myocheong (1135): Mengusulkan pemindahan ibu kota ke Seogyeong dan pendirian kerajaan baru, ditumpas oleh Kim Bu-sik\n• Ciri khas: Pembentukan aristokrat seperti klan Yi Gyeongwon, pernikahan tertutup\n• Gejolak: Melemahnya kekuasaan raja, diskriminasi terhadap pejabat militer semakin parah"
  },
  "ch_goryeo_03": {
    "title": "Pembentukan dan Perkembangan Rezim Militer",
    "theory": "Pada 1170, Jeong Jung-bu dan lainnya melancarkan kudeta militer dan mendirikan rezim militer.\n\n• Penyebab: Kesalahan pemerintahan Raja Uijong, diskriminasi terhadap pejabat militer (Insiden Bohyeonwon)\n• Perkembangan: Jeong Jung-bu → Gyeong Dae-seung → Yi Ui-min → Choe Chung-heon\n• Rezim Choe: Gyojeongdogam (lembaga kekuasaan tertinggi), Sambyeolcho (tentara pribadi), Jeongbang (kekuasaan personalia)\n• Pemberontakan petani dan budak: Pemberontakan Manjeok, Pemberontakan Mangi dan Mangsoi\n• Hasil: Melemahnya kekuasaan raja, monopoli kekuasaan oleh militer"
  },
  "ch_goryeo_04": {
    "title": "Perlawanan Anti-Mongol dan Sambyeolcho",
    "theory": "Pada abad ke-13, Goryeo melawan invasi Mongol (Yuan).\n\n• Pemindahan ibu kota ke Ganghwa (1232): Tekad perlawanan rezim militer, perlawanan 39 tahun\n• Perlawanan rakyat: Benteng Cheorin (Kim Yun-hu), Benteng Chungju, Benteng Gwiju\n• Tripitaka Koreana: Doa untuk mengusir Mongol dengan kekuatan Buddha\n• Kembali ke Gaegyeong (1270): Raja Wonjong, runtuhnya rezim militer\n• Perlawanan Sambyeolcho: Bae Jung-son, Jindo → Pulau Jeju, ditumpas tahun 1273"
  },
  "ch_goryeo_05": {
    "title": "Periode Intervensi Yuan dan Gwonmun Sejok",
    "theory": "Selama periode intervensi Yuan (1270-1356), Goryeo menerima campur tangan internal dari Yuan.\n\n• Intervensi: Pendirian Jeongdong Haengseong, pengiriman Darughachi, tuntutan Gongnyeo dan Eungbang\n• Kerajaan: Menikah dengan putri Yuan, raja dibesarkan di Yuan\n• Penurunan status pemerintahan: Wang → Chungnyeol Wang, Pyeha → Jeonha, 6 Bu → 4 Sa\n• Gwonmun Sejok: Pro-Yuan, kepemilikan tanah luas, menguasai Dopyeonguisasa\n• Perubahan sosial: Tren Mongol populer, kapas dan mesiu diperkenalkan"
  },
  "ch_goryeo_06": {
    "title": "Reformasi Raja Gongmin dan Sinjin Sadaebu",
    "theory": "Raja Gongmin (1351-1374) menjalankan kebijakan anti-Yuan dan penguatan kekuasaan raja.\n\n• Kebijakan anti-Yuan: Menghapus Jeongdong Haengseong, merebut kembali Ssangseong Chonggwanbu, menghapus era dan sistem Yuan\n• Reformasi internal: Jeonminbyeonjeongdogam (mengambil kembali tanah Gwonmun Sejok), mengangkat Sindon\n• Sinjin Sadaebu: Lulus ujian negara, Neo-Konfusianisme, mengkritik Gwonmun Sejok\n• Keterbatasan: Invasi Turban Merah dan perompak Wae, kekacauan politik setelah pemecatan Sindon\n• Yi Seong-gye: Pembalikan di Wihwa-do (1388), bersekutu dengan Sinjin Sadaebu"
  },
  "ch_goryeo_07": {
    "title": "Ekonomi Goryeo",
    "theory": "Goryeo memiliki ekonomi berbasis pertanian dan perdagangan internasional yang berkembang.\n\n• Sistem tanah: Jeonsi-gwa (hak pajak pejabat dan tentara), Gongumjeon (diwariskan untuk pangkat 5 ke atas)\n• Pertanian: Sistem 2 tahun 3 musim tanam, perkembangan pemupukan, Nongsangjipyo (buku pertanian Yuan)\n• Perdagangan: Pasar Gaegyeong, Byeongnando (pelabuhan internasional), pedagang Daesinguk (Arab)\n• Kerajinan: Kerajinan pemerintah (dikelola negara), So (produksi khusus)\n• Mata uang: Geonwon Jungbo, Eunbyeong (perak batangan), sirkulasi buruk"
  },
  "ch_goryeo_08": {
    "title": "Sistem Kelas dan Masyarakat Goryeo",
    "theory": "Goryeo adalah masyarakat dengan sistem kelas: aristokrat, kelas menengah, rakyat biasa, dan budak.\n\n• Aristokrat: Aristokrat sastra, Gwonmun Sejok, memonopoli ujian negara dan Eumseo\n• Kelas menengah: Hyangni (administrasi daerah), Namban (kelas tentara), Seori\n• Rakyat biasa: Petani (Baekjeong), menanggung pajak, upeti, dan kerja paksa\n• Budak: Nobi (prinsip mengikuti ibu), penduduk Hyang, Bugok, So\n• Ciri khas: Status wanita relatif tinggi, wanita aristokrat boleh menikah lagi"
  },
  "ch_goryeo_09": {
    "title": "Buddhisme Goryeo",
    "theory": "Di Goryeo, Buddhisme adalah agama negara yang mempengaruhi seluruh masyarakat.\n\n• Buddhisme negara: Yeondeunghoe dan Palgwanhoe (acara nasional), sistem ujian biksu\n• Aliran: Gyojong (Hwaeom dan Beopjang), Seonjong (Jogyejong)\n• Uicheon: Mendirikan aliran Cheontae, Gyogwangyeomsu, menyusun Sokjanggyeong\n• Jinul: Mereorganisasi Jogyejong, Jeonghyessangsu, Donojeomsu, persaudaraan Suseonsa\n• Tripitaka: Chojo Daejanggyeong (doa mengusir Khitan), Tripitaka Koreana (mengusir Mongol)"
  },
  "ch_goryeo_10": {
    "title": "Konfusianisme dan Buku Sejarah Goryeo",
    "theory": "Di akhir Goryeo, Neo-Konfusianisme diperkenalkan dan menjadi dasar ideologi Sinjin Sadaebu.\n\n• Konfusianisme: Gukjagam (lembaga pendidikan tertinggi), reorganisasi ujian negara\n• Neo-Konfusianisme: Diperkenalkan oleh An Hyang (Raja Chungnyeol), diteruskan oleh Baek I-jeong, Yi Je-hyeon, Yi Saek, Jeong Mong-ju\n• Buku sejarah: Samguk Sagi (Kim Bu-sik, buku sejarah tertua yang masih ada, pandangan Konfusian)\n• Samguk Yusa (Iryeon), Jewang Ungi (Yi Seung-hyu): Catatan Dangun, kesadaran nasional\n• 7 Catatan Raja: Tidak ada yang tersisa"
  },
  "ch_goryeo_11": {
    "title": "Teknologi Sains dan Percetakan Goryeo",
    "theory": "Goryeo memiliki teknologi percetakan dan logam tingkat dunia.\n\n• Percetakan: Tripitaka Koreana (cetakan kayu terbesar yang masih ada), Jikji Simche Yojeol (cetakan logam tertua yang masih ada)\n• Seladon bermotif: Berkembang abad ke-12, teknik khas Goryeo\n• Kompas: Perkembangan teknologi pelayaran\n• Mesiu: Choe Mu-seon, mendirikan Hwatongnogam, mengusir perompak Wae\n• Lainnya: Pengamatan astronomi, penelitian kalender, perkembangan kedokteran"
  },
  "ch_goryeo_12": {
    "title": "Seni Goryeo",
    "theory": "Goryeo mengembangkan seni unik berbasis budaya Buddhisme dan aristokrat.\n\n• Seladon: Seladon murni → Seladon bermotif (abad ke-12), Botol Maebyeong dengan motif awan dan bangau\n• Lukisan Buddha: Warna-warni cerah, Gwan'gyeong Byeonsangdo\n• Arsitektur: Gaya Jusimpo (Aula Geukrak Kuil Bongjeong, Aula Muryangsujeon Kuil Buseok)\n• Pagoda batu: Berbagai gaya (Pagoda 8 sisi 9 lantai Kuil Woljeong, Pagoda 10 lantai situs Kuil Gyeongcheon)\n• Kerajinan: Teknik tatahan perak, kerajinan pernis dengan mutiara"
  },
  "ch_joseon_early_01": {
    "title": "Pendirian dan Sistem Pemerintahan Joseon",
    "theory": "Pada 1392, Yi Seong-gye mendirikan Joseon. Neo-Konfusianisme dijadikan ideologi pemerintahan.\n\n• Pendirian: Pembalikan di Wihwa-do (1388) → Penerapan Gwajeonbeop → Pendirian Joseon\n• Raja Taejo: Memindahkan ibu kota ke Hanyang, membangun Istana Gyeongbok\n• Raja Taejong: Sistem 6 Jo langsung, menghapus tentara pribadi, sistem Hopaebeop\n• Sistem pemerintahan: Uijeongbu dan 6 Jo, Samsa (Saheonbu, Saganwon, Hongmungwan)\n• Daerah: 8 Do, mengirim Gwanchalsa dan Suryeong, mengendalikan Hyangni"
  },
  "ch_joseon_early_02": {
    "title": "Politik dari Raja Sejong hingga Seongjong",
    "theory": "Raja-raja awal Joseon menetapkan politik Konfusian dan mengembangkan budaya.\n\n• Raja Sejong: Jiphyeonjeon, Hunminjeongeum, pembukaan 4 Gun 6 Jin, sistem Uijeongbu Seosaje\n• Raja Sejo: Menghapus Jiphyeonjeon, sistem 6 Jo langsung, mulai menyusun Gyeongguk Daejeon\n• Raja Seongjong: Menyelesaikan dan mengumumkan Gyeongguk Daejeon, mendirikan Hongmungwan, mengangkat Sarim\n• Arah pemerintahan: Keseimbangan kekuasaan raja dan menteri\n• Jiphyeonjeon: Lembaga penelitian akademik Raja Sejong"
  },
  "ch_joseon_early_03": {
    "title": "Pertumbuhan Sarim dan Sahwa",
    "theory": "Setelah Raja Seongjong, Sarim berkembang tetapi bertentangan dengan Hungu sehingga terjadi Sahwa.\n\n• Sarim: Pengikut Kim Jong-jik, berbasis pedesaan, Seowon dan Hyangyak, mementingkan Dohak\n• Hungu: Kekuatan pendukung Raja Sejo, menguasai politik pusat\n• 4 Sahwa besar: Muo (1498), Gapja (1504), Gimyo (1519), Eulsa (1545)\n• Sahwa Muo: Jouijaemun Kim Jong-jik, Raja Yeonsangun\n• Sahwa Gimyo: Reformasi Jo Gwang-jo (Hyeonlyangkwa, penghapusan Sogyeokseo), Raja Jungjong"
  },
  "ch_joseon_early_04": {
    "title": "Awal Politik Faksional",
    "theory": "Pada masa Raja Seonjo, ketika Sarim berkuasa, politik faksional dimulai.\n\n• Pembentukan faksi: Masalah pengangkatan Ijo Jeollang, Dongin (Kim Hyo-won) dan Seoin (Sim Ui-gyeom)\n• Perpecahan Dongin: Pemberontakan Jeong Yeo-rip → Namin (moderat) dan Bukin (radikal)\n• Seoin: Pengikut Yi I dan Seong Hon, wilayah Giho\n• Dongin: Pengikut Yi Hwang, wilayah Yeongnam\n• Ciri khas: Berbasis hubungan akademik dan regional, kritik dan pengawasan timbal balik, mementingkan opini publik"
  },
  "ch_joseon_early_05": {
    "title": "Perang Imjin",
    "theory": "Pada 1592, invasi Jepang ke Joseon menyebabkan Perang Imjin.\n\n• Penyebab: Ambisi Toyotomi Hideyoshi untuk menaklukkan benua\n• Awal: Jatuhnya Busanjin dan Benteng Dongnae, Hanseong jatuh dalam 20 hari\n• Angkatan laut: Aktivitas Yi Sun-sin (Pertempuran Hansando, Pertempuran Myeongnyang)\n• Tentara sukarela: Gwak Jae-u, Jo Heon, Go Gyeong-myeong, Biksu Seosan, Biksu Samyeong\n• Hasil: Tanah rusak, populasi berkurang, penjarahan warisan budaya, perkembangan budaya Jepang"
  },
  "ch_joseon_early_06": {
    "title": "Perang Byeongja dan Teori Beolbol",
    "theory": "Pada 1636, invasi Qing menyebabkan Perang Byeongja.\n\n• Perang Jeongmyo (1627): Invasi Later Jin, membentuk hubungan saudara\n• Perang Byeongja (1636): Invasi Qing, pertahanan di Benteng Namhansan, penghinaan di Samjeondo\n• Hasil: Tunduk kepada Qing, Putra Mahkota Sohyeon dan Bonglim sebagai sandera, Prasasti Samjeondo\n• Teori Beolbol: Raja Hyojong dan Song Si-yeol, mengusulkan penyerangan Qing, tidak terwujud\n• Pengaruh: Kesadaran anti-Qing, Teori Bukhak (menerima budaya Qing)"
  },
  "ch_joseon_early_07": {
    "title": "Ekonomi Joseon Awal",
    "theory": "Joseon awal membangun sistem ekonomi berbasis pertanian.\n\n• Sistem tanah: Gwajeonbeop (tanah Gyeonggi), Jikjeonbeop (Raja Sejo), Gwansugwangeupje (Raja Seongjong)\n• Pertanian: Nongsa Jikseol (Raja Sejong), Yeonbun 9 Deungbeop dan Jeonbun 6 Deungbeop, sistem 2 tahun 3 musim\n• Perdagangan: Sijeon (Jongno), pengawasan Gyeongsiseo, sirkulasi Jeohwa dan Joseon Tongbo buruk\n• Kerajinan: Berpusat pada kerajinan pemerintah, sistem pendaftaran pengrajin\n• Pertambangan: Penambangan perak dan tembaga, pemurnian emas dan perak"
  },
  "ch_joseon_early_08": {
    "title": "Sistem Kelas dan Masyarakat Joseon Awal",
    "theory": "Joseon adalah masyarakat dengan sistem kelas: Yangban, Jungin, Yangin, dan Cheonmin.\n\n• Yangban: Pejabat sipil dan militer, ujian negara dan Eumseo, hak istimewa bebas pajak\n• Jungin: Pejabat teknis (penerjemah, dokter, ahli matematika), anak selir\n• Yangin: Petani, pedagang, pengrajin, menanggung pajak, upeti, dan kerja paksa\n• Cheonmin: Nobi (prinsip mengikuti ibu), Baekjeong, penghibur, dll.\n• Keluarga: Penguatan garis ayah, penyusunan silsilah, penyebaran Jongbeop"
  },
  "ch_joseon_early_09": {
    "title": "Neo-Konfusianisme dan Pendidikan Joseon Awal",
    "theory": "Neo-Konfusianisme adalah ideologi pemerintahan dan norma sosial Joseon.\n\n• Neo-Konfusianisme: Teori Igi (Yi Hwang - dualisme Igi, Yi I - monisme Igi)\n• Lembaga pendidikan: Seonggyungwan (pendidikan tertinggi), 4 Hak (menengah), Hyanggyo (daerah)\n• Seowon: Lembaga pendidikan Sarim, Seowon Baegundong oleh Ju Se-bung (pertama)\n• Ujian negara: Munkwa, Mukwa, Japkwa, ujian Saengwon dan Jinsa (Sokwa)\n• Ilmu etiket: Garye (Juja Garye), penyebaran upacara pernikahan, pemakaman, dan peringatan"
  },
  "ch_joseon_early_10": {
    "title": "Buku Sejarah dan Geografi Joseon Awal",
    "theory": "Joseon melaksanakan berbagai proyek kompilasi yang dipimpin negara.\n\n• Buku sejarah: Joseon Wangjo Sillok (UNESCO), Goryeosa, Goryeosa Jeolyo\n• Buku geografi: Dongguk Yeoji Seungnam, Sinjeung Dongguk Yeoji Seungnam\n• Kitab hukum: Gyeongguk Daejeon (Raja Seongjong), Daejeon Sokrok, Daejeon Husokrok\n• Buku upacara: Gukjo Oryeui (Raja Sejong hingga Seongjong)\n• Buku pertanian: Nongsa Jikseol (Raja Sejong)"
  },
  "ch_joseon_early_11": {
    "title": "Teknologi Sains Joseon Awal",
    "theory": "Era Raja Sejong adalah zaman keemasan teknologi sains.\n\n• Astronomi: Honcheonui, Ganui, Angbuilgu, Jagyeongnu (Jang Yeong-sil)\n• Cheugugi: Alat pengukur curah hujan pertama di dunia\n• Percetakan: Huruf logam Gyemija dan Gapinja, Raja Sejong\n• Peta: Honil Gangni Yeokdae Gukdo Jido (peta dunia tertua yang masih ada)\n• Kedokteran: Hyangyak Jipseongbang (Raja Sejong), Uibang Yuchi, Donguibogam (Raja Gwanghaegun)"
  },
  "ch_joseon_early_12": {
    "title": "Seni Joseon Awal",
    "theory": "Seni Joseon awal mencerminkan ideologi Neo-Konfusianisme.\n\n• Lukisan: An Gyeon (Mongyudowondo), Kang Hui-an, perkembangan lukisan literati\n• Keramik: Buncheong Sagi → Baekja (abad ke-16), keindahan sederhana dan terkendali\n• Arsitektur: Arsitektur Konfusian (istana, Jongmyo), Sungnyemun, Istana Gyeongbok\n• Musik: Reorganisasi Aak (Bak Yeon), Jeongganbo (Raja Sejong)\n• Kerajinan: Kerajinan kayu, kerajinan pernis dengan mutiara"
  },
  "ch_joseon_late_01": {
    "title": "Kemerosotan Politik Faksional",
    "theory": "Pada paruh kedua abad ke-17, politik faksional merosot menjadi kediktatoran satu partai.\n\n• Perdebatan Yesong: Masalah masa berkabung setelah kematian Raja Hyojong, Seoin vs Namin\n• Gyeongsin Hwanguk (1680): Namin jatuh, Seoin berkuasa\n• Gisa Hwanguk (1689): Seoin jatuh, Namin berkuasa, Song Si-yeol dihukum mati\n• Gapsul Hwanguk (1694): Namin jatuh, Seoin (Noron dan Soron) berkuasa\n• Hasil: Hilangnya fungsi pengawasan timbal balik, kediktatoran satu partai"
  },
  "ch_joseon_late_02": {
    "title": "Politik Tangpyeong",
    "theory": "Raja Yeongjo dan Jeongjo menerapkan kebijakan Tangpyeong untuk mengatasi keburukan faksionalisme.\n\n• Raja Yeongjo: Tangpyeong moderat (mengangkat kelompok moderat), melemahkan kekuasaan Ijo Jeollang, Gyunyeokbeop\n• Raja Jeongjo: Tangpyeong tegas (berbasis kemampuan), mendirikan Gyujanggak, Jangyongyeong, Benteng Hwaseong Suwon\n• Reformasi Jeongjo: Sistem Chogyemunsin, mengizinkan anak selir, menghapus hak istimewa Sijeon (Sinhaetongong)\n• Keterbatasan: Pertumbuhan keluarga Sedo, dasar dominasi keluarga ipar\n• Makna: Penguatan kekuasaan raja, kebangkitan budaya"
  },
  "ch_joseon_late_03": {
    "title": "Politik Sedo",
    "theory": "Setelah Raja Sunjo, keluarga ipar memonopoli kekuasaan dalam politik Sedo.\n\n• Keluarga Sedo: Klan Kim Andong (Sunjo), Klan Jo Pungyang (Heonjong dan Cheoljong)\n• Kekacauan Samjeong: Penyimpangan Jeonjeong (pajak tanah), Gunjeong (wajib militer), Hwangok (bunga)\n• Pemberontakan petani: Pemberontakan Hong Gyeong-nae (1811), Pemberontakan Petani Imsul (1862, Jinju)\n• Gejolak sosial: Popularitas ramalan Bigi dan Docham, pemberontakan sering terjadi\n• Hasil: Melemahnya kekuasaan raja, merosotnya disiplin negara, tertundanya modernisasi"
  },
  "ch_joseon_late_04": {
    "title": "Perubahan Ekonomi Joseon Akhir",
    "theory": "Joseon akhir mengalami perkembangan ekonomi komoditas dan mata uang.\n\n• Pertanian: Penyebaran Iyangbeop (transplantasi padi), Gwangjak (petani kaya), tanaman komersial (tembakau, ginseng, kapas)\n• Kerajinan: Privatisasi, sistem Seondaeje (pedagang memasok bahan baku)\n• Perdagangan: Sasang (pedagang di luar Sijeon), pedagang Song, Man, dan Gaeseong, pasar 5 harian\n• Mata uang: Sangpyeong Tongbo beredar nasional (Raja Sukjong)\n• Pertambangan: Sistem Seoljeomsuseje (pengelolaan tambang swasta)"
  },
  "ch_joseon_late_05": {
    "title": "Gejolak Sistem Kelas Joseon Akhir",
    "theory": "Joseon akhir mengalami perubahan sosial dengan gejolak sistem kelas.\n\n• Kelas Yangban: Peningkatan Yangban yang jatuh, Hyangban dan Janban\n• Kelas Jungin: Gerakan naik kelas, menuntut hak ujian Yeokgwa, gerakan Socheong\n• Anak selir: Menuntut Heotong, masuk sebagai Geomseo di Gyujanggak\n• Kelas petani: Naik kelas melalui Napsok dan Gongmyeongcheop\n• Budak: Pembebasan budak pemerintah (Raja Sunjo, 1801), populasi budak berkurang"
  },
  "ch_joseon_late_06": {
    "title": "Perkembangan Silhak",
    "theory": "Pada abad ke-17-18, Silhak yang mengejar reformasi sosial berkembang.\n\n• Aliran Gyeongsechiyong (pro-pertanian): Yu Hyeong-won (Bangye Surok), Yi Ik (Seongho Saseol), Jeong Yak-yong (Mongmin Simseo, Gyeongse Yupyo)\n• Aliran Iyonghusaeng (pro-perdagangan): Yu Su-won, Bak Ji-won (Yeolha Ilgi), Bak Je-ga (Bukhagui), Hong Dae-yong\n• Jeong Yak-yong: Geojunggi (Benteng Hwaseong), sistem Yeojeonje dan Jeongjeonje, Mongmin Simseo\n• Pengaruh: Negara kaya dan tentara kuat, stabilitas rakyat, pembentukan kesadaran modern\n• Keterbatasan: Tidak diadopsi oleh kelas penguasa"
  },
  "ch_joseon_late_07": {
    "title": "Perkembangan Gukhak",
    "theory": "Joseon akhir melihat peningkatan minat terhadap budaya dan sejarah nasional.\n\n• Penelitian bahasa nasional: Sin Gyeong-jun (Hunminjeongeum Unhae), Yu Hui (Eonmunji)\n• Buku sejarah: An Jeong-bok (Dongsa Gangmok), Yi Geung-ik (Yeonnyeosil Gisul), Han Chi-yun (Haedong Yeoksa)\n• Buku geografi: Jeong Sang-gi (Dongguk Jido), Kim Jeong-ho (Daedongyeojido)\n• Ensiklopedia: Yi Ik (Seongho Saseol), Yi Deok-mu (Cheongjangkwan Jeonseo)\n• Ciri khas: Penelitian empiris dan objektif, eksplorasi identitas nasional"
  },
  "ch_joseon_late_08": {
    "title": "Perkembangan Budaya Rakyat Biasa",
    "theory": "Joseon akhir melihat perkembangan budaya populer dengan meningkatnya kekuatan ekonomi rakyat biasa.\n\n• Sastra: Novel Hangeul (Hong Gildong Jeon, Chunhyang Jeon), Pansori, Saseol Sijo\n• Lukisan: Lukisan genre (Kim Hong-do, Sin Yun-bok), Minhwa, lukisan pemandangan nyata (Jeong Seon)\n• Pertunjukan: Tarian topeng (Talchum Bongsan), Pansori, pertunjukan boneka\n• Ciri khas: Satir terhadap Yangban, kritik realitas, humor\n• Kim Jeong-hui: Gaya kaligrafi Chusa, Sehando (lukisan literati)"
  },
  "ch_joseon_late_09": {
    "title": "Teknologi Sains Joseon Akhir",
    "theory": "Joseon akhir melihat perkembangan teknologi sains di bawah pengaruh Silhak.\n\n• Peta: Jeong Sang-gi (Dongguk Jido, skala 100 li), Kim Jeong-ho (Daedongyeojido, cetak balok kayu)\n• Kedokteran: Heo Jun (Donguibogam), Jeong Yak-yong (Magwa Hoetong)\n• Astronomi: Hong Dae-yong (teori rotasi bumi), penerimaan astronomi Barat\n• Pertanian: Bak Se-dang (Saekgyeong), inovasi teknik pertanian\n• Teknologi: Geojunggi (Jeong Yak-yong), advokasi pengenalan Sucha (aliran Bukhak)"
  },
  "ch_joseon_late_10": {
    "title": "Munculnya Agama Baru",
    "theory": "Joseon akhir melihat munculnya agama dan pemikiran baru.\n\n• Katolik: Masuk sebagai Seohak pada abad ke-17, pembaptisan Yi Seung-hun (1784), penganiayaan Sinhae dan Gihae\n• Donghak: Didirikan oleh Choe Je-u pada 1860, Innaecheon (manusia adalah surga), anti-feodalisme dan anti-asing\n• Pemikiran ramalan: Jeongkamrok, popularitas ramalan Bigi dan Docham\n• Kepercayaan Maitreya: Harapan keselamatan rakyat\n• Ciri khas: Kritik terhadap kontradiksi sosial, pemikiran kesetaraan"
  },
  "ch_modern_01": {
    "title": "Reformasi Heungseon Daewongun",
    "theory": "Heungseon Daewongun melaksanakan reformasi untuk memperkuat kekuasaan raja dan menstabilkan kehidupan rakyat.\n\n• Penguatan kekuasaan raja: Rekonstruksi Istana Gyeongbok, penghapusan Bibyeonsa, kebangkitan Samgunbu\n• Mengakhiri politik Sedo: Mengusir kekuatan klan Kim Andong, mengangkat orang berbakat\n• Reformasi Samjeong: Hopoje (pajak militer Yangban), Sachangje (pengganti Hwangok)\n• Penghapusan Seowon: Hanya menyisakan 47, menghapus hak istimewa bebas pajak dan kerja paksa\n• Penolakan perdagangan dan diplomasi: Ekspedisi Prancis (1866), Ekspedisi Amerika (1871), Prasasti Cheokwhabi"
  },
  "ch_modern_02": {
    "title": "Pembukaan Pelabuhan dan Perjanjian Tidak Setara",
    "theory": "Pada 1876, Joseon membuka pelabuhan melalui Perjanjian Ganghwado.\n\n• Insiden Unyo (1875): Kapal perang Jepang menyerang Ganghwado\n• Perjanjian Ganghwado (1876): Perjanjian modern pertama, perjanjian tidak setara\n  - Pembukaan Busan, Wonsan, Incheon, ekstrateritorialitas, hak survei pantai\n• Perjanjian Persahabatan Korea-Amerika (1882): Perlakuan negara paling disukai, mediasi\n• Kemudian menjalin hubungan dengan Inggris, Jerman, Rusia, Prancis\n• Dampak: Titik awal modernisasi, awal eksploitasi ekonomi"
  },
  "ch_modern_03": {
    "title": "Gerakan Pencerahan dan Wijeongcheoksa",
    "theory": "Setelah pembukaan pelabuhan, faksi Pencerahan dan faksi Wijeongcheoksa bertentangan.\n\n• Faksi Pencerahan: Membuka pintu, menerima budaya Barat, mendorong modernisasi\n  - Pencerahan moderat (Dongdoseogi): Kim Hong-jip, Eo Yun-jung\n  - Pencerahan radikal (Munmyeong Gaehwa): Kim Ok-gyun, Bak Yeong-hyo, Hong Yeong-sik\n• Wijeongcheoksa: Melindungi Neo-Konfusianisme, menolak kekuatan asing\n  - Yi Hang-no, Gi Jeong-jin, Choe Ik-hyeon (Waeyanglicheron)\n• Tongni Gimumun: Lembaga pelaksana kebijakan pencerahan"
  },
  "ch_modern_04": {
    "title": "Pemberontakan Imo dan Kudeta Gapsin",
    "theory": "Pada 1880-an, Joseon menghadapi periode pergolakan politik.\n\n• Pemberontakan Imo (1882): Pemberontakan tentara lama, Daewongun kembali berkuasa\n  - Intervensi Qing, Daewongun diculik ke Qing, Perjanjian Jemulpo\n• Kudeta Gapsin (1884): Kudeta faksi Pencerahan radikal, 14 Poin Program Reformasi\n  - Berkuasa 3 hari, gagal karena intervensi Qing, Kim Ok-gyun mengungsi\n• Hasil: Penguatan campur tangan Qing, teori netralisasi Joseon\n• Perjanjian Hanseong dan Tianjin: Keseimbangan kekuatan Jepang-Qing"
  },
  "ch_modern_05": {
    "title": "Gerakan Petani Donghak",
    "theory": "Pada 1894, tentara petani Donghak melancarkan gerakan anti-feodalisme dan anti-asing.\n\n• Latar belakang: Kekacauan Samjeong, eksploitasi ekonomi Jepang, gerakan rehabilitasi pendiri\n• Pemberontakan pertama: Pemberontakan Gobu (Jeon Bong-jun), kemenangan di Hwangtohyeon dan Hwangnyongchon\n• Gencatan Jeonju: 12 Pasal Reformasi Politik, pendirian Jipgangso\n• Pemberontakan kedua: Melawan pendudukan Istana Gyeongbok oleh Jepang, kekalahan di Ugeumchi\n• Makna: Anti-feodalisme dan anti-invasi, mempengaruhi Reformasi Gabo"
  },
  "ch_modern_06": {
    "title": "Reformasi Gabo dan Reformasi Eulmi",
    "theory": "Reformasi modern dilaksanakan pada 1894-1896.\n\n• Reformasi Gabo (1894): Gunguk Gimucheo, penghapusan ujian negara, penghapusan sistem kelas\n  - Standar perak, penyatuan ukuran dan timbangan, pendirian pengadilan\n• Reformasi Eulmi (1895): Penggunaan kalender matahari, perintah potong rambut, pendirian sekolah dasar\n• Insiden Eulmi (1895): Pembunuhan Permaisuri Myeongseong oleh Jepang\n• Pelarian ke Kedutaan Rusia (1896): Raja Gojong mengungsi ke kedutaan Rusia\n• Keterbatasan: Dipimpin Jepang, perlawanan rakyat (Tentara Perlawanan Eulmi)"
  },
  "ch_modern_07": {
    "title": "Asosiasi Kemerdekaan dan Kekaisaran Korea",
    "theory": "Pada akhir 1890-an, gerakan kemerdekaan dan modernisasi berkembang.\n\n• Asosiasi Kemerdekaan (1896): Seo Jae-pil, Koran Kemerdekaan, pembangunan Gerbang Kemerdekaan\n  - Majelis Rakyat, gerakan pendirian parlemen, 6 Pasal Heoneui\n• Kekaisaran Korea (1897): Raja Gojong naik tahta sebagai kaisar, Reformasi Gwangmu\n  - Gubonsinham (memperkenalkan yang baru berdasarkan yang lama)\n  - Proyek survei tanah, penerbitan Jigye, pendirian Wonsubu\n• Keterbatasan: Reformasi konservatif, eksploitasi kekuatan asing semakin parah"
  },
  "ch_modern_08": {
    "title": "Gerakan Tentara Perlawanan Anti-Jepang",
    "theory": "Setelah pembukaan pelabuhan, gerakan tentara perlawanan melawan invasi Jepang berkembang.\n\n• Tentara Perlawanan Eulmi (1895): Melawan perintah potong rambut dan pembunuhan Permaisuri Myeongseong, dipimpin sarjana Konfusian\n  - Aktivitas Yu In-seok, Yi So-eung, dll.\n• Tentara Perlawanan Eulsa (1905): Melawan Perjanjian Eulsa, Min Jong-sik, Choe Ik-hyeon\n• Tentara Perlawanan Jeongmi (1907): Melawan pembubaran tentara, bergabung dengan tentara yang dibubarkan\n  - Tentara Kebenaran 13 Provinsi (Yi In-yeong), Operasi Serangan Seoul\n• Keterbatasan: Melemah karena Operasi Pemberantasan Jepang di Korea Selatan (1909)"
  },
  "ch_modern_09": {
    "title": "Gerakan Pencerahan Patriotik",
    "theory": "Gerakan untuk memulihkan kedaulatan melalui pengembangan kemampuan dilaksanakan.\n\n• Organisasi: Boanhu (mencegah hak reklamasi tanah kosong Jepang), Heonjeong Yeongu-hoe, Daehan Jaganghoe\n• Sinminhoe (1907): An Chang-ho dan Yang Gi-tak, organisasi rahasia, berorientasi republik\n  - Sekolah Osan dan Daeseong, Toko Buku Taegeuk, Perusahaan Jagi\n• Pendidikan: Pendirian sekolah swasta, pendidikan nasional\n• Media: Hwangseong Sinmun, Daehan Maeil Sinbo (Bethell), Gerakan Pembayaran Utang Nasional\n• Keterbatasan: Fokus pada pengembangan kemampuan, penindasan Jepang"
  },
  "ch_modern_10": {
    "title": "Proses Perampasan Kedaulatan Nasional",
    "theory": "Jepang merampas kedaulatan Joseon secara bertahap.\n\n• Perjanjian Eulsa (1905): Perampasan hak diplomatik, pendirian Residensi Jenderal (Ito Hirobumi)\n• Utusan Rahasia Den Haag (1907): Yi Jun, Yi Sang-seol, Yi Wi-jong, pemaksaan turun tahta Raja Gojong\n• Perjanjian 7 Pasal Jeongmi (1907): Perampasan hak pemerintahan dalam negeri, pembubaran tentara\n• Memorandum Giyu (1909): Perampasan kekuasaan yudikatif dan kepolisian\n• Perampasan Nasional Gyeongsul (29 Agustus 1910): Perjanjian Aneksasi Korea-Jepang, hilangnya kedaulatan nasional\n• Perlawanan: Penembakan Ito Hirobumi oleh An Jung-geun (1909)"
  },
  "ch_japanese_occupation_01": {
    "title": "Pemerintahan Militer 1910-an",
    "theory": "Pada 1910-an, Jepang melaksanakan pemerintahan militer dengan polisi militer di garis depan.\n\n• Kantor Gubernur Jenderal Joseon: Gubernur Jenderal (jenderal angkatan darat/laut), menguasai kekuasaan legislatif, yudikatif, dan eksekutif\n• Sistem Polisi Militer: Hak hukuman langsung (hukuman cambuk), pengawasan orang Korea\n• Survei Tanah (1910-1918): Prinsip pelaporan, penyitaan tanah yang tidak dilaporkan\n  - Pendirian Perusahaan Kolonisasi Oriental, peningkatan tuan tanah Jepang\n• Undang-undang Perusahaan: Sistem izin pendirian perusahaan, penindasan pertumbuhan modal nasional\n• Pendidikan: Pendidikan pembodohan, pembatasan pendidikan bahasa Korea"
  },
  "ch_japanese_occupation_02": {
    "title": "Pemerintahan Budaya 1920-an",
    "theory": "Setelah Gerakan 1 Maret, Jepang menerapkan pemerintahan budaya (kebijakan lunak yang menipu).\n\n• Sistem Polisi Biasa: Penghapusan polisi militer, sebenarnya jumlah dan peralatan polisi meningkat\n• Pers dan Pertemuan: Mengizinkan Chosun Ilbo dan Dong-A Ilbo (dengan sensor), aktivitas Masyarakat Bahasa Korea\n• Pendidikan: Mengizinkan pendirian universitas (Universitas Keijo, 1924), perluasan sekolah umum\n• Rencana Peningkatan Produksi Beras: Meningkatkan produksi beras → ekspor ke Jepang, kekurangan pangan di Joseon\n• Keterbatasan: Membina kolaborator pro-Jepang, merencanakan perpecahan nasional"
  },
  "ch_japanese_occupation_03": {
    "title": "Pemerintahan Pemusnahan Bangsa 1930-40-an",
    "theory": "Setelah 1930-an, Jepang memaksakan kebijakan pemusnahan bangsa untuk melaksanakan perang.\n\n• Japanisasi: Sumpah Rakyat Kekaisaran, pemaksaan penyembahan kuil, penghormatan ke Istana Kekaisaran\n• Pemusnahan budaya nasional: Larangan penggunaan bahasa Korea, penindasan Masyarakat Bahasa Korea (1942)\n• Soshi-Kaimei (1940): Pemaksaan nama Jepang\n• Eksploitasi manusia: Sistem sukarelawan → Wajib militer, sukarelawan pelajar, kerja paksa\n• Eksploitasi wanita: Mobilisasi paksa 'wanita penghibur' tentara Jepang\n• Eksploitasi material: Sistem pengumpulan paksa, pengumpulan paksa logam"
  },
  "ch_japanese_occupation_04": {
    "title": "Gerakan 1 Maret",
    "theory": "Gerakan 1 Maret 1919 adalah gerakan nasional terbesar selama pendudukan Jepang.\n\n• Latar belakang: Prinsip penentuan nasib sendiri Wilson, Deklarasi Kemerdekaan 8 Februari (Tokyo), rumor pembunuhan Raja Gojong\n• Perkembangan: 1 Maret di Taman Tapgol, pembacaan Deklarasi Kemerdekaan, demonstrasi Manse\n  - Mahasiswa dan tokoh agama → menyebar ke semua kelas dan seluruh negeri, meluas ke luar negeri (Gando, Primorsky)\n• Penindasan Jepang: Pembantaian Jeam-ri, pembakaran Benteng Hwaseong Suwon\n• Makna: Pendirian Pemerintahan Sementara Korea, peralihan dari non-kekerasan ke perjuangan bersenjata\n• Pengaruh: Gerakan 4 Mei Tiongkok, gerakan non-kekerasan India"
  },
  "ch_japanese_occupation_05": {
    "title": "Pemerintahan Sementara Republik Korea",
    "theory": "Pada 1919, Pemerintahan Sementara Republik Korea didirikan di Shanghai.\n\n• Pendirian: Shanghai (pemerintahan sementara terpadu), sistem republik demokratis, Presiden Rhee Syng-man\n• Aktivitas: Sistem Yeontongje dan Gyotongguk, Koran Kemerdekaan, Kantor Kompilasi Sejarah\n• Krisis: Pemakzulan Rhee Syng-man, perpecahan Kongres Perwakilan Rakyat (1923)\n• Kepemimpinan Kim Gu: Korps Patriotik Korea, Aksi Heroik Yun Bong-gil (1932)\n• Pemindahan ke Chongqing (1940): Pendirian Tentara Pembebasan Korea, Deklarasi Perang terhadap Jepang\n• Makna: Pusat gerakan kemerdekaan, tradisi republik demokratis"
  },
  "ch_japanese_occupation_06": {
    "title": "Perjuangan Heroik dan Korps Patriotik Korea",
    "theory": "Setelah 1920-an, perjuangan heroik individual berlangsung.\n\n• Uiyeoldan (1919): Kim Won-bong, Sin Chae-ho (Deklarasi Revolusi Joseon), perjuangan kekerasan\n  - Bak Jae-hyeok (Kantor Polisi Busan), Kim Ik-sang (Kantor Gubernur Jenderal), Na Seok-ju (Perusahaan Kolonisasi Oriental)\n• Korps Patriotik Korea (1931): Diorganisir oleh Kim Gu, operasi khusus\n  - Yi Bong-chang: Melempar bom ke Kaisar Jepang (1932, gagal)\n  - Yun Bong-gil: Aksi heroik di Taman Hongkou Shanghai (1932), membunuh jenderal Jepang\n• Makna: Menunjukkan tekad kemerdekaan, kesempatan untuk dukungan Tiongkok"
  },
  "ch_japanese_occupation_07": {
    "title": "Perang Kemerdekaan Bersenjata",
    "theory": "Setelah 1920-an, perang kemerdekaan bersenjata berlangsung di Manchuria dan Tiongkok.\n\n• Pertempuran Bongodong (1920): Tentara Kemerdekaan Korea Hong Beom-do, menghancurkan tentara Jepang\n• Kemenangan Besar Cheongsan-ri (1920): Tentara Utara Kim Jwa-jin, hasil terbesar\n• Pembantaian Gando (1920): Tentara Jepang membantai orang Korea di Gando\n• Tragedi Svobodny (1921): Tentara kemerdekaan tewas oleh Tentara Merah Soviet\n• Penyatuan 3 Bu: Chameuibu, Jeonguibu, Sinminbu → Gukminbu, Hyeoksinuihoe\n• Tentara Pembebasan Korea (1940): Di bawah pemerintahan sementara, persiapan operasi ke Korea"
  },
  "ch_japanese_occupation_08": {
    "title": "Gerakan Nasional Sosial dan Ekonomi",
    "theory": "Berbagai gerakan nasional sosial dan ekonomi berkembang selama pendudukan Jepang.\n\n• Gerakan Dukungan Produk Lokal (1920): Jo Man-sik, menggunakan produk lokal, 'Hidupku dengan milikku'\n• Gerakan Pendirian Universitas Swasta (1922): Yi Sang-jae, gerakan penggalangan dana, dihalangi Jepang\n• Gerakan petani: Sengketa sewa (Sengketa sewa Amtae-do)\n• Gerakan buruh: Pemogokan umum Wonsan (1929), Federasi Buruh Joseon\n• Singanhoe (1927): Partai nasional tunggal, kerja sama kiri-kanan, mendukung Gerakan Pelajar Gwangju"
  },
  "ch_japanese_occupation_09": {
    "title": "Gerakan Pelestarian Budaya Nasional",
    "theory": "Selama pendudukan Jepang, upaya melestarikan budaya dan identitas nasional terus berlanjut.\n\n• Penelitian bahasa nasional: Masyarakat Bahasa Korea (Aturan Ejaan Hangeul Terpadu, Bahasa Standar), penetapan Hari Hangeul\n• Penelitian sejarah: Bak Eun-sik (Hanguktongsa), Sin Chae-ho (Joseonsanggosa), sejarah nasionalis\n• Gerakan Gukhak: Jeong In-bo (Joseonhak), Mun Il-pyeong, An Jae-hong\n• Pendidikan: Sekolah swasta nasional (Sekolah Osan, Sekolah Daeseong), gerakan sekolah malam\n• Agama: Cheondogyo, Daejonggyo, Wonbulgyo, membangkitkan kesadaran nasional"
  },
  "ch_japanese_occupation_10": {
    "title": "Aktivitas Diaspora Korea di Luar Negeri",
    "theory": "Selama pendudukan Jepang, diaspora Korea juga berpartisipasi dalam gerakan kemerdekaan.\n\n• Manchuria: Seogando (Gyeonghaksa, Sekolah Sinheung Mugwan), Bukgando (Sekolah Myeongdong, Pembantaian Gando)\n• Primorsky: Geoneophoe, Pemerintahan Militer Pembebasan Korea, Tragedi Svobodny\n• Amerika: Asosiasi Nasional Korea, Bak Yong-man (pelatihan militer), Rhee Syng-man (aktivitas diplomatik)\n• Hawaii: Pekerja perkebunan tebu, dukungan dana kemerdekaan\n• Jepang: Deklarasi Kemerdekaan 8 Februari, gerakan mahasiswa di luar negeri"
  },
  "ch_contemporary_01": {
    "title": "Kemerdekaan dan Pembagian",
    "theory": "Pada 15 Agustus 1945, Korea meraih kemerdekaan tetapi semenanjung terbagi.\n\n• Kemerdekaan: Penyerahan tanpa syarat Jepang, buah gerakan kemerdekaan\n• Pembagian: Pendudukan AS-Soviet berdasarkan garis paralel 38\n• Komite Persiapan Pendirian Negara: Yeo Un-hyeong, proklamasi Republik Rakyat (tidak diakui pemerintah militer AS)\n• Konferensi Menteri Luar Negeri Moskow (1945): Pendirian pemerintahan sementara, perwalian 5 tahun\n  - Pro-perwalian (sayap kiri) vs Anti-perwalian (sayap kanan)\n• Komisi Bersama AS-Soviet: Gagal, dialihkan ke PBB"
  },
  "ch_contemporary_02": {
    "title": "Pendirian Pemerintahan Republik Korea",
    "theory": "Pada 1948, Pemerintahan Republik Korea didirikan.\n\n• Resolusi PBB: Pemilihan umum berdasarkan proporsi populasi, penolakan Soviet\n• Negosiasi Selatan-Utara (1948): Kim Gu dan Kim Gyu-sik, kunjungan ke Pyongyang, gagal\n• Pemilihan Umum 10 Mei (1948): Pengawasan PBB, pembentukan Majelis Nasional Konstituante\n• Konstitusi Pendirian: Republik demokratis, sistem presidensial + sistem kabinet\n• Pendirian Pemerintahan Republik Korea (15 Agustus 1948): Rhee Syng-man sebagai Presiden pertama\n• Pengakuan PBB: Satu-satunya pemerintahan sah di Semenanjung Korea"
  },
  "ch_contemporary_03": {
    "title": "Perang Korea 25 Juni",
    "theory": "Pada 25 Juni 1950, perang meletus akibat invasi Korea Utara.\n\n• Latar belakang: Pengumuman Garis Acheson, persiapan perang Korea Utara\n• Perkembangan: Invasi Korea Utara → Garis pertahanan Nakdonggang → Operasi pendaratan Incheon → Pembebasan Seoul\n  → Maju ke Sungai Yalu → Intervensi Tiongkok → Mundur 4 Januari → Kebuntuan di paralel 38\n• Gencatan senjata (27 Juli 1953): Panmunjom, status gencatan senjata berlanjut hingga kini\n• Kerugian: Jutaan korban jiwa, puluhan juta keluarga terpisah, tanah rusak\n• Dampak: Penguatan ideologi anti-komunis, pemantapan pembagian"
  },
  "ch_contemporary_04": {
    "title": "Pemerintahan Rhee Syng-man dan Revolusi 19 April",
    "theory": "Revolusi 19 April terjadi melawan pemerintahan jangka panjang Rhee Syng-man.\n\n• Pemerintahan Rhee Syng-man: Kebijakan anti-komunis, Amandemen Ekstrak (1952), Amandemen Sisa-o-ip (1954)\n• Pemilihan Curang 15 Maret (1960): Pemilihan presiden dan wakil presiden curang Partai Liberal\n• Revolusi 19 April: Demonstrasi Masan → Penemuan jenazah Kim Ju-yeol → Menyebar ke seluruh negeri\n  - Tuntutan demokratisasi mahasiswa dan warga, darurat militer, demonstrasi profesor\n• Hasil: Pengunduran diri Rhee Syng-man, Pemerintahan Sementara Heo Jeong, Republik Kedua (Kabinet Jang Myeon)\n• Makna: Gerakan demokratisasi mahasiswa dan warga, revolusi demokratis pertama"
  },
  "ch_contemporary_05": {
    "title": "Pemerintahan Park Chung-hee",
    "theory": "Pemerintahan Park Chung-hee didirikan melalui kudeta militer 1961.\n\n• Kudeta Militer 16 Mei (1961): Militer mengambil alih kekuasaan, Dewan Tertinggi Rekonstruksi Nasional\n• Republik Ketiga (1963): Sistem presidensial, Rencana Pembangunan Ekonomi 5 Tahun\n• Perjanjian Korea-Jepang (1965): Normalisasi hubungan, Demonstrasi 3 Juni (gerakan oposisi)\n• Sistem Yushin (1972): Yushin Oktober, hak tindakan darurat, Majelis Nasional Reunifikasi\n• Pemberontakan Demokratis Buma (1979): Demonstrasi Busan dan Masan\n• Insiden 26 Oktober (1979): Pembunuhan Park Chung-hee"
  },
  "ch_contemporary_06": {
    "title": "Pemerintahan Chun Doo-hwan dan Gerakan Demokratisasi",
    "theory": "Pada 1980, militer baru Chun Doo-hwan mengambil alih kekuasaan.\n\n• Insiden 12.12 (1979): Militer baru Chun Doo-hwan, mengambil alih kekuasaan militer\n• Gerakan Demokratisasi 18 Mei (1980): Gwangju, melawan perluasan darurat militer, organisasi milisi warga\n  - Penindasan militer baru, ratusan korban\n• Republik Kelima: Presiden tidak langsung, masa jabatan 7 tahun satu kali\n• Pemberontakan Demokratis Juni (1987): Tuntutan penghapusan konstitusi lama dan pemilihan langsung, pengorbanan Lee Han-yeol\n• Deklarasi 29 Juni: Menerima amandemen pemilihan langsung, Roh Tae-woo\n• Makna: Titik balik demokratisasi"
  },
  "ch_contemporary_07": {
    "title": "Perkembangan Demokrasi",
    "theory": "Setelah 1987, demokrasi berkembang dan pergantian kekuasaan damai terjadi.\n\n• Republik Keenam (1988): Pemilihan presiden langsung, masa jabatan 5 tahun satu kali\n• Pemerintahan Roh Tae-woo: Diplomasi Utara, hubungan dengan Soviet dan Tiongkok, keanggotaan PBB bersama Korut-Korsel (1991)\n• Pemerintahan Kim Young-sam: Pemerintahan sipil, sistem nama asli keuangan, meluruskan sejarah, Krisis IMF\n• Pemerintahan Kim Dae-jung: Pergantian kekuasaan damai pertama, KTT Antar-Korea (2000), Deklarasi 15 Juni\n• Selanjutnya: Pemilihan demokratis, peningkatan hak asasi manusia dan kebebasan pers"
  },
  "ch_contemporary_08": {
    "title": "Pembangunan Ekonomi dan Perubahan Sosial",
    "theory": "Republik Korea mengalami pertumbuhan ekonomi pesat dan perubahan sosial.\n\n• Pembangunan ekonomi: Rencana Pembangunan Ekonomi 5 Tahun ke-1 hingga ke-4 (1962-1981)\n  - Industri ringan → industri berat dan kimia, pertumbuhan berorientasi ekspor\n• Keajaiban Sungai Han: Dari penerima bantuan → pemberi bantuan, keanggotaan OECD (1996)\n• Krisis IMF (1997): Krisis valuta asing, restrukturisasi, pemulihan\n• Perubahan sosial: Urbanisasi, keluarga inti, penuaan, negara kuat IT\n• Budaya: Hallyu (K-POP, drama, film), status global"
  },
  "ch_contemporary_09": {
    "title": "Perubahan Kebijakan Reunifikasi",
    "theory": "Kebijakan reunifikasi pemerintah Republik Korea berubah seiring waktu.\n\n• Rhee Syng-man: Teori Reunifikasi Maju ke Utara (reunifikasi militer)\n• Park Chung-hee: Pernyataan Bersama Selatan-Utara 4 Juli (1972), kemandirian, perdamaian, persatuan nasional\n• Chun Doo-hwan: Pertemuan keluarga terpisah Selatan-Utara (1985)\n• Roh Tae-woo: Diplomasi Utara, Perjanjian Dasar Selatan-Utara (1991)\n• Kim Dae-jung: Kebijakan Sinar Matahari, wisata Gunung Geumgang, KTT Antar-Korea pertama (2000)\n• Selanjutnya: Kompleks Industri Kaesong, KTT ke-2 dan ke-3"
  },
  "ch_contemporary_10": {
    "title": "Perubahan Korea Utara dan Hubungan Antar-Korea",
    "theory": "Sejak pembagian, sistem Korea Utara dan hubungan antar-Korea telah berubah.\n\n• Sistem Korea Utara: Kim Il-sung → Kim Jong-il → Kim Jong-un, suksesi 3 generasi\n  - Ideologi Juche, politik Songun, pengembangan nuklir\n• Hubungan antar-Korea: Konfrontasi (1950-1970) → Dialog (1970-) → Rekonsiliasi dan kerja sama (1990-)\n  - Siklus ketegangan dan rekonsiliasi\n• Peristiwa utama: Teror Aung San (1983), Cheonan (2010), Yeonpyeong (2010)\n• Pertukaran Selatan-Utara: Pertemuan keluarga terpisah, wisata Gunung Geumgang, Kompleks Industri Kaesong\n• Tugas: Pemantapan perdamaian, persiapan reunifikasi, rekonsiliasi nasional"
  }
}
