{
  "ch_prehistoric_01": {
    "title": "ยุคหินเก่า",
    "theory": "ยุคหินเก่าเริ่มต้นเมื่อประมาณ 700,000 ปีก่อน ผู้คนใช้เครื่องมือหินกะเทาะ (ขวานหิน, เครื่องสับ) และอาศัยอยู่ในถ้ำหรือที่พักพิงริมแม่น้ำ พวกเขาดำรงชีวิตด้วยการล่าสัตว์และเก็บของป่า อาศัยอยู่รวมกันเป็นกลุ่ม\n\n• แหล่งโบราณคดีสำคัญ: จองกก-รี ในยอนชอน (ขวานหินแบบอาชูเลียน), ซอกจัง-รี ในกงจู, กอมึนโมรู ในซังวอน, ดูรูบง ในชองวอน\n• ลักษณะเด่น: วิถีชีวิตเร่ร่อน, สังคมเสมอภาค, การใช้ไฟ"
  },
  "ch_prehistoric_02": {
    "title": "ยุคหินใหม่",
    "theory": "ยุคหินใหม่เริ่มต้นเมื่อประมาณ 10,000 ปีก่อน (ราว 8000 ปีก่อนคริสตกาล) ผู้คนใช้เครื่องมือหินขัด และเครื่องปั้นดินเผาลายหวี เกษตรกรรมและการเลี้ยงสัตว์เริ่มขึ้น นำไปสู่การตั้งถิ่นฐานในบ้านหลุม\n\n• แหล่งโบราณคดีสำคัญ: อัมซา-ดง ในโซล, ดงซัม-ดง ในปูซาน, โอซาน-รี ในยังยัง\n• ความเชื่อ: วิญญาณนิยม, โทเทมนิยม, ลัทธิหมอผี\n• ลักษณะเด่น: แกนปั่นด้ายและเข็มกระดูก (การทอผ้าแบบดั้งเดิม), กองเปลือกหอย"
  },
  "ch_prehistoric_03": {
    "title": "ยุคสำริด",
    "theory": "ยุคสำริดเริ่มต้นราว 2000-1500 ปีก่อนคริสตกาล สำริดถูกใช้สำหรับอาวุธและเครื่องมือพิธีกรรมเป็นหลัก ขณะที่เครื่องมือหิน (มีดหินรูปจันทร์เสี้ยว) ยังคงใช้ในการเกษตร การปลูกข้าวเริ่มเข้มข้นขึ้นและชนชั้นทางสังคมเกิดขึ้น\n\n• เครื่องปั้นดินเผา: เครื่องปั้นเรียบ, เครื่องปั้นแบบมีซงรี\n• เครื่องสำริด: กริชรูปพิณ, กระจกลายหยาบ\n• สุสาน: ดอลเมน (แบบโต๊ะ/แบบกระดานหมากล้อม), สุสานหินหีบ\n• สังคม: สังคมหัวหน้าเผ่า, ความเชื่อในผู้ถูกเลือก"
  },
  "ch_prehistoric_04": {
    "title": "ยุคเหล็ก",
    "theory": "ยุคเหล็กเริ่มต้นราวศตวรรษที่ 5-4 ก่อนคริสตกาล เหล็กถูกใช้สำหรับเครื่องมือเกษตรและอาวุธ เพิ่มผลผลิตทางการเกษตรและการทำสงครามพิชิต การค้าขายกับจีนขยายตัว\n\n• เครื่องเหล็ก: เครื่องมือเกษตรเหล็ก (เคียว, จอบ), อาวุธเหล็ก\n• เครื่องสำริด: กริชสำริดเรียว, กระจกลายละเอียด (แบบเกาหลี)\n• สุสาน: สุสานโลงไม้, สุสานโอ่งดิน\n• การเปลี่ยนแปลง: เหรียญจีน (หมิงเต้าเฉียน, ปั้นเหลียง) เข้ามา, การใช้การเขียนด้วยพู่กัน"
  },
  "ch_gojoseon_01": {
    "title": "การก่อตั้งและพัฒนาการของโกโจซอน",
    "theory": "โกโจซอนก่อตั้งขึ้นในปี 2333 ก่อนคริสตกาลโดยทันกุนวังกอม (บันทึกในซัมกุกยูซา) เติบโตในภูมิภาคเหลียวตงและคาบสมุทรเกาหลีตอนเหนือบนพื้นฐานวัฒนธรรมสำริด\n\n• พัฒนาการ: โชซอนทันกุน → โชซอนกีจา (ตำนาน) → โชซอนวีมัน\n• โชซอนวีมัน: ก่อตั้งในปี 194 ก่อนคริสตกาล เมื่อวีมันโค่นล้มกษัตริย์จุน\n• ยุครุ่งเรือง: รับวัฒนธรรมเหล็ก, ค้าขายเป็นตัวกลางระหว่างฮั่นและจิน\n• ล่มสลาย: ถูกจักรพรรดิอู่แห่งฮั่นพิชิตในปี 108 ก่อนคริสตกาล, ตั้งสี่มณฑลฮั่น"
  },
  "ch_gojoseon_02": {
    "title": "สังคมและวัฒนธรรมของโกโจซอน",
    "theory": "โกโจซอนรักษาระเบียบสังคมด้วยกฎหมายแปดข้อห้าม ปัจจุบันเหลือเพียงสามข้อที่ตกทอดมา\n\n• กฎหมายแปดข้อ (เนื้อหาที่เหลืออยู่):\n  - ผู้ฆ่าคนจะถูกประหารชีวิต\n  - ผู้ทำร้ายผู้อื่นต้องชดใช้ด้วยธัญพืช\n  - ผู้ลักขโมยจะถูกทำเป็นทาส (หรือจ่ายค่าไถ่ 500,000 เหรียญ)\n\n• ความสำคัญ: การเคารพชีวิต, การคุ้มครองทรัพย์สินส่วนบุคคล, การให้คุณค่าแรงงาน\n• สังคม: สังคมมีชนชั้น, มีกฎหมายจารีตประเพณีทางอาญา"
  },
  "ch_gojoseon_03": {
    "title": "การเติบโตของรัฐต่างๆ",
    "theory": "หลังการล่มสลายของโกโจซอน รัฐต่างๆ เติบโตขึ้นในแมนจูเรียและคาบสมุทรเกาหลี\n\n• พูยอ: สมาพันธ์ห้าเผ่า, ยองโก (เทศกาลเดือนธันวาคม), การฝังศพพร้อมผู้ติดตาม, กฎหมาย 12 ข้อ\n• โกกูรยอ: สมาพันธ์ห้าเผ่า, ทงแม (เดือนตุลาคม), ประเพณีเขยอยู่บ้านภรรยา\n• อกจอ: ส่งบรรณาการแก่โกกูรยอ, ประเพณีเลี้ยงเจ้าสาวเด็ก, สุสานครอบครัวร่วม\n• ทงเย: มูชอน (เดือนตุลาคม), การแต่งงานนอกเผ่า, ค่าชดเชยการล่วงล้ำเขตแดน\n• ซัมฮัน: มาฮัน, จินฮัน, พยอนฮัน, เขตศักดิ์สิทธิ์ (โซโด), เทศกาลเดือนพฤษภาคมและตุลาคม"
  },
  "ch_three_kingdoms_01": {
    "title": "การก่อตั้งและเติบโตของโกกูรยอ",
    "theory": "โกกูรยอก่อตั้งขึ้นในปี 37 ก่อนคริสตกาลโดยจูมงในจลบน เติบโตในภูมิภาคภูเขาริมแม่น้ำอัมนก พัฒนาเป็นรัฐพิชิต\n\n• กษัตริย์แทโจ: พิชิตอกจอ, พยายามรุกคืบสู่เหลียวตง\n• กษัตริย์โกกุกชอน: กฎหมายจินแด (บรรเทาทุกข์คนยากจน), จัดระบบห้าเผ่า\n• กษัตริย์ทงชอน: วิกฤตจากการรุกรานของกวันชิวเจี้ยนแห่งเว่ย\n• ลักษณะเด่น: สภาเจกา, คยองดัง (การศึกษาเยาวชน), ประเพณีเขยอยู่บ้านภรรยา"
  },
  "ch_three_kingdoms_02": {
    "title": "ยุครุ่งเรืองของโกกูรยอ",
    "theory": "ในศตวรรษที่ 4-5 โกกูรยอเติบโตเป็นมหาอำนาจในเอเชียตะวันออก\n\n• กษัตริย์โซซูริม: รับพุทธศาสนา (ค.ศ. 372), ก่อตั้งแทฮัก, ประกาศใช้ประมวลกฎหมาย\n• กษัตริย์ควังแกโท: ขยายดินแดน (แมนจูเรีย, คาบสมุทรเกาหลีตอนเหนือ), ช่วยเหลือชิลลาต่อต้านโจรสลัดญี่ปุ่น\n• กษัตริย์จังซู: ย้ายเมืองหลวงไปเปียงยาง (ค.ศ. 427), นโยบายขยายลงใต้, ยึดลุ่มแม่น้ำฮัน\n• ศิลาจารึกกษัตริย์ควังแกโท: บันทึกประวัติศาสตร์โกกูรยอ, ตั้งอยู่ในจี๋หลิน ประเทศจีน\n• ดินแดนกว้างสุด: จากแมนจูเรียถึงเกาหลีกลาง (ถึงชุงจู)"
  },
  "ch_three_kingdoms_03": {
    "title": "สงครามต่างประเทศและการล่มสลายของโกกูรยอ",
    "theory": "ในศตวรรษที่ 6-7 โกกูรยอต่อสู้กับการรุกรานของซุยและถัง\n\n• อึลจีมุนด็อก: ยุทธการซัลซู (ค.ศ. 612), พ่ายแพ้กองทัพ 300,000 นายของจักรพรรดิหยางแห่งซุย\n• ยอนแกโซมุน: สร้างกำแพงชอลลีจังซอง, ขับไล่จักรพรรดิไท่จงแห่งถัง (ยุทธการอันซี, ค.ศ. 645)\n• การต่อต้านต่างประเทศ: ขับไล่การรุกรานของซุย 4 ครั้ง, ถัง 3 ครั้ง\n• ล่มสลาย: ล่มสลายในปี ค.ศ. 668 โดยพันธมิตรชิลลา-ถัง\n• สาเหตุ: ความแตกแยกในชนชั้นปกครอง, การแย่งชิงอำนาจหลังยอนแกโซมุนเสียชีวิต"
  },
  "ch_three_kingdoms_04": {
    "title": "การก่อตั้งและเติบโตของแพกเจ",
    "theory": "แพกเจก่อตั้งขึ้นในปี 18 ก่อนคริสตกาลโดยอนโจในวีรเยซอง (ลุ่มแม่น้ำฮัน) เติบโตบนพื้นฐานภูมิภาคแม่น้ำฮัน\n\n• กษัตริย์โกอี: จัดระบบยศและชุดราชการ, ประกาศใช้ประมวลกฎหมาย, หกจวาพยอง\n• กษัตริย์กึนโชโก: รวมมาฮัน, โจมตีโกกูรยอ (กษัตริย์โกกุกวอนสิ้นพระชนม์)\n• ดินแดน: รุกคืบสู่เหลียวซี, ซานตง, คิวชู (ดาบเจ็ดกิ่ง)\n• ลักษณะเด่น: การค้าทางทะเลพัฒนา, แลกเปลี่ยนกับราชวงศ์ใต้ของจีน"
  },
  "ch_three_kingdoms_05": {
    "title": "ยุครุ่งเรืองและการฟื้นฟูของแพกเจ",
    "theory": "แพกเจถึงจุดสูงสุดในศตวรรษที่ 4 สมัยกษัตริย์กึนโชโก แต่ภายหลังอ่อนแอลงจากการขยายลงใต้ของโกกูรยอ\n\n• กษัตริย์กึนโชโก: พิชิตมาฮัน, รักษาฮวังแฮโดและจอลลาโด, ถวายดาบเจ็ดกิ่งแก่ญี่ปุ่น\n• กษัตริย์แกโร: ฮันซองแตก (ค.ศ. 475), สิ้นพระชนม์โดยกษัตริย์จังซูแห่งโกกูรยอ\n• ย้ายไปอุงจิน (ค.ศ. 475): ย้ายเมืองหลวงไปกงจู\n• กษัตริย์มูรยอง: ฟื้นฟู, ส่งผู้ว่า 22 ทัมโน, แลกเปลี่ยนกับราชวงศ์เหลียง\n• กษัตริย์ซอง: ย้ายไปซาบี (ค.ศ. 538), เปลี่ยนชื่อประเทศเป็นนัมบูยอ, พยายามยึดลุ่มแม่น้ำฮันคืน (สิ้นพระชนม์ที่กวันซันซอง)"
  },
  "ch_three_kingdoms_06": {
    "title": "ขบวนการฟื้นฟูและการล่มสลายของแพกเจ",
    "theory": "ในศตวรรษที่ 7 แพกเจล่มสลายโดยพันธมิตรชิลลา-ถัง\n\n• กษัตริย์อุยจา: โจมตีชิลลา (ยึดแทยาซอง), การเมืองวุ่นวายปลายรัชกาล\n• ล่มสลาย: ซาบีซองแตกในปี ค.ศ. 660 โดยพันธมิตรชิลลา-ถัง (คิมยูชิน-โซจองบัง)\n• ขบวนการฟื้นฟู: นำโดยบกชิน, โดชิม, ฮึกชีซังจี, ได้รับการสนับสนุนจากญี่ปุ่น\n• ยุทธการแพกกัง (ค.ศ. 663): กองทัพเรือญี่ปุ่นพ่ายแพ้, ขบวนการฟื้นฟูล้มเหลว\n• ความสำคัญ: ผู้ลี้ภัยแพกเจบางส่วนอพยพไปญี่ปุ่นและชิลลา, เผยแพร่วัฒนธรรม"
  },
  "ch_three_kingdoms_07": {
    "title": "การก่อตั้งและพัฒนาการของชิลลา",
    "theory": "ชิลลาก่อตั้งขึ้นในปี 57 ก่อนคริสตกาลโดยบักฮยอกกอเซในซาโรกุก (คยองจู) พัฒนาช้าที่สุดในสามอาณาจักร\n\n• กษัตริย์แนมุล: สถาปนาการสืบราชบัลลังก์ตระกูลคิม, ตำแหน่งมาริปกัน\n• กษัตริย์บอบฮึง: รับรองพุทธศาสนา (อีชาดอนพลีชีพ), ประกาศใช้ประมวลกฎหมาย, จัดระบบกลพุม, ผนวกกึมกวันกายา\n• กษัตริย์จินฮึง: ปฏิรูปฮวารังโด, ยึดลุ่มแม่น้ำฮัน, พิชิตที่ราบฮัมฮึงและแทกายา\n• ศิลาจารึกซุนซู: บุกฮันซันบี, ชังนยองบี, มาอุนรยองบี, ฮวังโชรยองบี"
  },
  "ch_three_kingdoms_08": {
    "title": "ยุครุ่งเรืองของชิลลาและการรวมสามอาณาจักร",
    "theory": "ในศตวรรษที่ 7 ชิลลาเป็นพันธมิตรกับถังและรวมสามอาณาจักร\n\n• พระราชินีซอนด็อก: สร้างชอมซองแด, เจดีย์ไม้เก้าชั้นฮวังรยองซา\n• กษัตริย์แทจงมูยอล (คิมชุนชู): กษัตริย์จินกลคนแรก, เป็นพันธมิตรกับถัง\n• กษัตริย์มุนมู: หลังแพกเจ (ค.ศ. 660) และโกกูรยอ (ค.ศ. 668) ล่มสลาย ขับไล่ถัง\n• สงครามนา-ถัง: ขับไล่ถังในยุทธการแมโซซองและกีบอลโพ (ค.ศ. 676)\n• ความสำคัญ: รวมดินแดนใต้แนวแม่น้ำแทดง-วอนซัน, วางรากฐานวัฒนธรรมชาติ"
  },
  "ch_three_kingdoms_09": {
    "title": "การก่อตั้งและพัฒนาการของกายา",
    "theory": "กายาคือสหพันธ์อาณาจักรที่เติบโตในลุ่มแม่น้ำนักดง เจริญรุ่งเรืองจากการผลิตเหล็กและการค้าทางทะเล\n\n• กายายุคแรก: ศูนย์กลางที่กึมกวันกายา (คิมแฮ), สืบทอดจากพยอนฮัน\n• กายายุคหลัง: ศูนย์กลางที่แทกายา (โกรยอง), รุ่งเรืองในศตวรรษที่ 5-6\n• ลักษณะเด่น: ส่งออกเหล็ก (ญี่ปุ่น, นักนัง), สหพันธ์อาณาจักร (ไม่สามารถรวมเป็นหนึ่ง)\n• ล่มสลาย: กึมกวันกายา (ค.ศ. 532, กษัตริย์บอบฮึง), แทกายา (ค.ศ. 562, กษัตริย์จินฮึง)\n• วัฒนธรรม: กายากึม, เกราะเหล็ก, ประเพณีฝังศพพร้อมผู้ติดตาม"
  },
  "ch_three_kingdoms_10": {
    "title": "พุทธศาสนาและความคิดในสามอาณาจักร",
    "theory": "พุทธศาสนามีส่วนในการเสริมสร้างอำนาจกษัตริย์และรวมชาติ\n\n• โกกูรยอ: ค.ศ. 372 พระซุนโดนำมาจากอาณาจักรฉินยุคก่อน (กษัตริย์โซซูริม)\n• แพกเจ: ค.ศ. 384 พระมารานันทานำมาจากอาณาจักรจิ้นตะวันออก (กษัตริย์ชิมรยู)\n• ชิลลา: ค.ศ. 527 รับรองหลังอีชาดอนพลีชีพ (กษัตริย์บอบฮึง)\n• ลักษณะเด่น: พุทธศาสนาปกป้องชาติ, รับโดยรัฐ"
  },
  "ch_three_kingdoms_11": {
    "title": "สุสานและโบราณสถานของสามอาณาจักร",
    "theory": "สุสานของสามอาณาจักรแสดงลักษณะทางวัฒนธรรมเฉพาะของแต่ละอาณาจักร\n\n• โกกูรยอ: สุสานหินกอง→สุสานห้องหินแบบอุโมงค์, สุสานมูยง, กักจอ, ซังยอง (ภาพจิตรกรรมฝาผนัง)\n• แพกเจ: สุสานห้องหินแบบอุโมงค์, สุสานกษัตริย์มูรยอง (สุสานอิฐ), จิตรกรรมสี่เทพ\n• ชิลลา: สุสานหินกองบนห้องไม้ (ชอนมาชง, ฮวังนัมแดชง), พบมงกุฎทอง\n• ชิลลารวม: สุสานห้องหินแบบอุโมงค์ (อิทธิพลการเผาศพ)\n• พัลแฮ: สุสานเจ้าหญิงจองฮเย (สุสานห้องหินแบบอุโมงค์), สืบทอดจากโกกูรยอ"
  },
  "ch_three_kingdoms_12": {
    "title": "ศิลปะและวิทยาศาสตร์ของสามอาณาจักร",
    "theory": "สามอาณาจักรพัฒนาศิลปะและวิทยาศาสตร์ที่เป็นเอกลักษณ์\n\n• โกกูรยอ: จิตรกรรมฝาผนังในสุสาน (สี่เทพ), ภาพล่าสัตว์ในสุสานมูยง\n• แพกเจ: กระถางธูปทองสำริดขนาดใหญ่, พระพุทธรูปสลักหน้าผาซอซัน, เจดีย์หินมีรึกซาจี\n• ชิลลา: ชอมซองแด (หอดูดาวเก่าแก่ที่สุดในตะวันออก), เจดีย์ไม้เก้าชั้นฮวังรยองซา, มงกุฎทอง\n• วิทยาศาสตร์: การสังเกตดาราศาสตร์, การใช้ปฏิทิน, การต่อเรือพัฒนา\n• การเผยแพร่สู่ญี่ปุ่น: อาจิกกี-วังอิน (อักษรจีน, ขงจื๊อ), ทัมจิง (กระดาษ, หมึก, สี)"
  },
  "ch_north_south_states_01": {
    "title": "การเมืองของชิลลารวม",
    "theory": "ชิลลารวมสถาปนาอำนาจกษัตริย์ที่เข้มแข็งและระบบรวมศูนย์อำนาจ\n\n• กษัตริย์ชินมุน: ยกเลิกนกอึป, ให้ควัลลโยจอน, ก่อตั้งกุกฮัก, 9 จู 5 โซกยอง\n• ระบบปกครอง: จิบซาบู (สำนักงานสูงสุด), ซังแดดึง (ผู้แทนขุนนาง)\n• ท้องถิ่น: 9 จู 5 โซกยอง, เวซาจอง (ผู้ตรวจการ), ฮยัง-บูกก (เขตปกครองพิเศษ)\n• ทหาร: 9 ซอดัง (กองทัพกลาง), 10 จอง (กองทัพท้องถิ่น)\n• ยุคปลาย: การแย่งชิงราชบัลลังก์, ขุนนางท้องถิ่นเติบโต, ยุกดูพุมต่อต้าน"
  },
  "ch_north_south_states_02": {
    "title": "เศรษฐกิจของชิลลารวม",
    "theory": "เศรษฐกิจของชิลลารวมพัฒนาจากการขยายดินแดน\n\n• ระบบที่ดิน: ควัลลโยจอน (สิทธิเก็บภาษีของขุนนาง), จองจอน (ที่ดินชาวนา)\n• เอกสารมินจอง: สำรวจประชากร ที่ดิน ปศุสัตว์ของหมู่บ้าน (ทุก 3 ปี), พบที่โชโซอินของญี่ปุ่น\n• การค้า: ตลาดตะวันออก-ตะวันตกในคยองจู, ท่าเรือนานาชาติ (ชองแฮจิน, อุลซัน)\n• จังโบโก: ก่อตั้งชองแฮจิน (ค.ศ. 828), ควบคุมเส้นทางทะเล, ค้าขายผ่านถัง-ชิลลา-ญี่ปุ่น\n• หัตถกรรม: งานทองเงิน, ทอผ้าไหม"
  },
  "ch_north_south_states_03": {
    "title": "สังคมของชิลลารวม",
    "theory": "ชิลลารวมเป็นสังคมชนชั้นตามระบบกลพุม\n\n• ระบบกลพุม: ซองกล→จินกล→6-1 ดูพุม, จำกัดยศและชีวิตประจำวัน\n• จินกล: ขุนนางสูงสุด, สิทธิสืบราชบัลลังก์, 5 ดูพุมลงไปจำกัดยศ\n• 6 ดูพุม: ก้าวหน้าทางวิชาการและศาสนา, นักเรียนต่างประเทศในถัง, ปัญญาชนวิพากษ์\n• ความวุ่นวายยุคปลาย: แย่งชิงราชบัลลังก์, ความขัดแย้งในจินกล, 6 ดูพุมต่อต้าน\n• ขุนนางท้องถิ่นเติบโต: อำนาจท้องถิ่นเป็นอิสระ, เป็นฐานของสามอาณาจักรยุคหลัง"
  },
  "ch_north_south_states_04": {
    "title": "วัฒนธรรมของชิลลารวม",
    "theory": "ชิลลารวมผสานวัฒนธรรมสามอาณาจักรและพัฒนาวัฒนธรรมชาติ\n\n• พุทธศาสนา: นิกายฮวาอม (อึยซัง), คโยจงพัฒนา, ซอนจงนิยม (ยุคปลาย)\n• วอนฮโย: ปรัชญาฮวาแจง, เผยแพร่พุทธศาสนาสู่ประชาชน, บทเพลงมูแอ\n• สถาปัตยกรรม: วัดบูลกุกซา, ซอกกูรัม (พระพุทธรูปประธาน), เจดีย์ทาโบและซอกกา\n• ระฆัง: ระฆังกษัตริย์ซองด็อก (ระฆังเอมีลเล), ระฆังทองแดงซังวอนซา\n• วรรณกรรม: เพลงฮยังกา (ชอยงกา, เจมังแมกา), ซอลชง (จัดระเบียบอีดู)"
  },
  "ch_north_south_states_05": {
    "title": "การก่อตั้งและการเมืองของพัลแฮ",
    "theory": "พัลแฮก่อตั้งในปี ค.ศ. 698 โดยแทโจยองที่ภูเขาดงโม เป็นประเทศที่สร้างโดยผู้ลี้ภัยโกกูรยอและชาวมัลกัล\n\n• แทโจยอง: เดิมเป็นแม่ทัพโกกูรยอ, ก่อตั้งหลังชนะถัง\n• กษัตริย์มู: ขัดแย้งกับถัง, จังมุนฮิวโจมตีคาบสมุทรซานตง\n• กษัตริย์มุน: มิตรภาพกับถัง, ย้ายไปซังกยอง, จัดระบบ 3 ซอง 6 บู\n• กษัตริย์ซอน: ดินแดนกว้างสุด, ได้รับฉายา 'แฮดงซองกุก'\n• ล่มสลาย: ล่มสลายโดยคีตันในปี ค.ศ. 926"
  },
  "ch_north_south_states_06": {
    "title": "สังคมและวัฒนธรรมของพัลแฮ",
    "theory": "พัลแฮสืบทอดวัฒนธรรมโกกูรยอและได้รับอิทธิพลจากถัง\n\n• การปกครอง: 3 ซอง 6 บู (ระบบถัง), ท้องถิ่น 5 กยอง 15 บู 62 จู\n• สืบทอดโกกูรยอ: ออนดล, เสาตะเกียงหิน, พระพุทธรูปสององค์ประทับคู่, โครงสร้างสุสานเจ้าหญิงจองฮโย\n• อิทธิพลถัง: จูจากัม (การศึกษาขงจื๊อ), สอบบินกงกวา\n• ความสัมพันธ์ต่างประเทศ: แลกเปลี่ยนกับถัง ชิลลา ญี่ปุ่น, ชิลลาโด (เส้นทางคมนาคม)\n• มรดกวัฒนธรรม: ซากซังกยองยงชอนบู, สุสานเจ้าหญิงจองฮเยและจองฮโย"
  },
  "ch_goryeo_01": {
    "title": "การก่อตั้งและระบบปกครองของโกรยอ",
    "theory": "ในปี ค.ศ. 918 วังกอนโค่นล้มกุงเยและก่อตั้งโกรยอ รวมสามอาณาจักรยุคหลัง (ค.ศ. 936) และรวมขุนนางท้องถิ่น\n\n• การรวมขุนนางท้องถิ่น: นโยบายแต่งงาน (29 ภรรยา), นโยบายพระราชทานนามสกุล, ระบบกีอิน, ระบบซาชิมกวัน\n• ฮุนโย 10 ข้อ: คำสั่งสอนสำหรับกษัตริย์รุ่นหลัง\n• ระบบปกครอง: 2 ซอง (จุงซอมุนฮาซอง, ซังซอซอง), 6 บู, จุงชูวอน, ซัมซา\n• โดบยองมาซา, ชิกมกโดกัม: องค์กรเฉพาะของโกรยอ\n• ท้องถิ่น: 5 โด 2 กเย, ฮยัง-บูกก-โซ (เขตปกครองพิเศษ)"
  },
  "ch_goryeo_02": {
    "title": "การก่อตัวและความวุ่นวายของสังคมขุนนางตระกูล",
    "theory": "โกรยอยุคต้นเป็นสังคมที่ปกครองโดยขุนนางตระกูล\n\n• ขุนนางตระกูล: ผูกขาดตำแหน่งผ่านการสอบและอึมซอ, สืบทอดกงอึมจอน\n• กบฏอีจากยอม (ค.ศ. 1126): ความพยายามผูกขาดอำนาจของญาติฝ่ายมารดา\n• กบฏมโยชอง (ค.ศ. 1135): เรียกร้องย้ายเมืองหลวงไปซอกยอง, ปราบโดยคิมบูชิก\n• ลักษณะเด่น: ก่อตัวตระกูลเช่นอีแห่งคยองวอน, การแต่งงานปิด\n• ความวุ่นวาย: อำนาจกษัตริย์อ่อนแอ, การเลือกปฏิบัติต่อทหารรุนแรงขึ้น"
  },
  "ch_goryeo_03": {
    "title": "การก่อตั้งและพัฒนาการของระบอบทหาร",
    "theory": "ในปี ค.ศ. 1170 จองจุงบูและคนอื่นๆ ก่อกบฏทหารและสถาปนาระบอบทหาร\n\n• สาเหตุ: การปกครองผิดพลาดของกษัตริย์อึยจง, การเลือกปฏิบัติต่อทหาร (เหตุการณ์โบฮยอนวอน)\n• พัฒนาการ: จองจุงบู → คยองแดซึง → อีอึยมิน → ชเวชุงฮอน\n• ระบอบชเว: คโยจองโดกัม (องค์กรอำนาจสูงสุด), ซัมบยอลโช (กองทัพส่วนตัว), จองบัง (อำนาจบุคลากร)\n• กบฏชาวนาและทาส: กบฏมันจอก, กบฏมังอี-มังโซอี\n• ผลลัพธ์: อำนาจกษัตริย์อ่อนแอ, ทหารผูกขาดอำนาจ"
  },
  "ch_goryeo_04": {
    "title": "การต่อต้านมองโกลและซัมบยอลโช",
    "theory": "ในศตวรรษที่ 13 โกรยอต่อสู้กับการรุกรานของมองโกล (หยวน)\n\n• ย้ายไปคังฮวา (ค.ศ. 1232): เจตจำนงต่อต้านของระบอบทหาร, ต่อต้าน 39 ปี\n• การต่อสู้ของประชาชน: ป้อมชออิน (คิมยุนฮู), ป้อมชุงจู, ป้อมกวีจู\n• พระไตรปิฎกแปดหมื่นแผ่น: อธิษฐานขับไล่มองโกลด้วยพลังพุทธะ\n• กลับแกกยอง (ค.ศ. 1270): กษัตริย์วอนจง, ระบอบทหารล่มสลาย\n• การต่อสู้ของซัมบยอลโช: แพจุงซน, จินโด→เชจูโด, ปราบในปี ค.ศ. 1273"
  },
  "ch_goryeo_05": {
    "title": "ยุคแทรกแซงของหยวนและควอนมุนเซจก",
    "theory": "ในยุคแทรกแซงของหยวน (ค.ศ. 1270-1356) โกรยอถูกหยวนแทรกแซงการเมืองภายใน\n\n• การแทรกแซง: ตั้งจองดงแฮงซอง, ส่งดารูกาชี, เรียกร้องกงนยอและอึงบัง\n• ราชวงศ์: แต่งงานกับเจ้าหญิงหยวน, กษัตริย์เติบโตในหยวน\n• ลดยศราชการ: กษัตริย์→ชุงรยอลวัง, เปฮา→จอนฮา, 6 บู→4 ซา\n• ควอนมุนเซจก: ฝ่ายนิยมหยวน, ถือครองที่ดินขนาดใหญ่, ควบคุมโดพยองอึยซาซา\n• การเปลี่ยนแปลงสังคม: แฟชั่นมองโกลนิยม, ฝ้ายและดินปืนเข้ามา"
  },
  "ch_goryeo_06": {
    "title": "การปฏิรูปของกษัตริย์กงมินและขุนนางใหม่",
    "theory": "กษัตริย์กงมิน (ค.ศ. 1351-1374) ดำเนินนโยบายต่อต้านหยวนและเสริมอำนาจกษัตริย์\n\n• นโยบายต่อต้านหยวน: ยกเลิกจองดงแฮงซอง, ยึดซังซองชงกวันบูคืน, ยกเลิกศักราชและระบบราชการหยวน\n• ปฏิรูปภายใน: จอนมินบยอนจองโดกัม (ยึดที่ดินควอนมุนเซจกคืน), แต่งตั้งชินดน\n• ขุนนางใหม่: ผ่านการสอบ, ลัทธิขงจื๊อใหม่, วิพากษ์ควอนมุนเซจก\n• ข้อจำกัด: การรุกรานของฮงกอนจอกและโจรสลัดญี่ปุ่น, ความวุ่นวายหลังกำจัดชินดน\n• อีซองกเย: การถอยทัพจากวีฮวาโด (ค.ศ. 1388), ร่วมมือกับขุนนางใหม่"
  },
  "ch_goryeo_07": {
    "title": "เศรษฐกิจของโกรยอ",
    "theory": "โกรยอมีเศรษฐกิจเกษตรกรรมและการค้าระหว่างประเทศพัฒนา\n\n• ระบบที่ดิน: จอนชีกวา (สิทธิเก็บภาษีของขุนนางและทหาร), กงอึมจอน (สืบทอดยศ 5 ขึ้นไป)\n• เกษตรกรรม: ปลูก 3 ครั้งใน 2 ปี, เทคนิคปุ๋ยพัฒนา, นงซังจิบโย (ตำราเกษตรจากหยวน)\n• การค้า: ตลาดในแกกยอง, พยอกนันโด (ท่าเรือนานาชาติ), พ่อค้าแทชิก (อาหรับ)\n• หัตถกรรม: หัตถกรรมราชการ, โซ (การผลิตพิเศษ)\n• เงินตรา: กอนวอนจุงโบ, อึนบยอง (ฮวัลกู), การหมุนเวียนไม่ดี"
  },
  "ch_goryeo_08": {
    "title": "ระบบชนชั้นและสังคมของโกรยอ",
    "theory": "โกรยอเป็นสังคมชนชั้น: ขุนนาง, ชนชั้นกลาง, สามัญชน, ทาส\n\n• ขุนนาง: ขุนนางตระกูล, ควอนมุนเซจก, ผูกขาดการสอบและอึมซอ\n• ชนชั้นกลาง: ฮยังรี (บริหารท้องถิ่น), นัมบัน (ชนชั้นทหาร), ซอรี\n• สามัญชน: ชาวนา (แพกจอง), แบกรับภาษี บรรณาการ แรงงาน\n• ทาส: โนบี (อิลชอนจึกชอน), คนฮยัง-บูกก-โซ\n• ลักษณะเด่น: สถานะผู้หญิงค่อนข้างสูง, ขุนนางหญิงแต่งงานใหม่ได้"
  },
  "ch_goryeo_09": {
    "title": "พุทธศาสนาของโกรยอ",
    "theory": "โกรยอมีพุทธศาสนาเป็นศาสนาประจำชาติที่มีอิทธิพลต่อสังคมทั้งหมด\n\n• พุทธศาสนาแห่งรัฐ: ยอนดึงฮเว, พัลกวันฮเว (งานแห่งชาติ), ระบบสอบพระ\n• นิกาย: คโยจง (ฮวาอม, บอบซัง), ซอนจง (โจกเย)\n• อึยชอน: ก่อตั้งนิกายชอนแท, คโยกวันกยอมซู, รวบรวมซกจังกยอง\n• จีนูล: จัดระเบียบนิกายโจกเย, จองฮเยซังซู, ทนโอจอมซู, สมาคมซูซอนซา\n• พระไตรปิฎก: โชโจแทจังกยอง (อธิษฐานขับไล่คีตัน), พระไตรปิฎกแปดหมื่นแผ่น (ขับไล่มองโกล)"
  },
  "ch_goryeo_10": {
    "title": "ขงจื๊อและหนังสือประวัติศาสตร์ของโกรยอ",
    "theory": "ลัทธิขงจื๊อใหม่เข้ามาในโกรยอยุคปลายและเป็นรากฐานความคิดของขุนนางใหม่\n\n• ขงจื๊อ: กุกจากัม (สถาบันการศึกษาสูงสุด), จัดระบบการสอบ\n• ลัทธิขงจื๊อใหม่: อันฮยังแนะนำ (กษัตริย์ชุงรยอล), แพกอีจอง, อีเจฮยอน, อีแซก, จองมงจูสืบทอด\n• หนังสือประวัติศาสตร์: ซัมกุกซากี (คิมบูชิก, หนังสือประวัติศาสตร์เก่าแก่ที่สุดที่ยังมี, มุมมองขงจื๊อ)\n• ซัมกุกยูซา (อิลยอน), เจวังอุนกี (อีซึงฮิว): บันทึกทันกุน, จิตสำนึกชาติ\n• พงศาวดาร 7 รัชกาล: ไม่มีเหลืออยู่"
  },
  "ch_goryeo_11": {
    "title": "วิทยาศาสตร์และการพิมพ์ของโกรยอ",
    "theory": "โกรยอมีเทคโนโลยีการพิมพ์และโลหะระดับโลก\n\n• การพิมพ์: พระไตรปิฎกแปดหมื่นแผ่น (แม่พิมพ์ไม้ใหญ่ที่สุดที่มีอยู่), จิกจีชิมเชโยจอล (หนังสือพิมพ์ตัวพิมพ์โลหะเก่าแก่ที่สุดที่มีอยู่)\n• เซลาดอนฝังลาย: พัฒนาในศตวรรษที่ 12, เทคนิคเฉพาะของโกรยอ\n• เข็มทิศ: เทคโนโลยีเดินเรือพัฒนา\n• ดินปืน: ชเวมูซอน, ตั้งฮวาทงโดกัม, ขับไล่โจรสลัดญี่ปุ่น\n• อื่นๆ: สังเกตดาราศาสตร์, วิจัยปฏิทิน, การแพทย์พัฒนา"
  },
  "ch_goryeo_12": {
    "title": "ศิลปะของโกรยอ",
    "theory": "โกรยอพัฒนาศิลปะเฉพาะตัวบนพื้นฐานวัฒนธรรมพุทธและขุนนาง\n\n• เซลาดอน: เซลาดอนบริสุทธิ์→เซลาดอนฝังลาย (ศตวรรษที่ 12), แจกันเซลาดอนฝังลายลายเมฆนกกระเรียน\n• ภาพพุทธ: สีสันสดใส, ควันกยองบยอนซังโด\n• สถาปัตยกรรม: แบบจูชิมโพ (วิหารกึกนักจอนบงจองซา, วิหารมูรยังซูจอนบูซอกซา)\n• เจดีย์หิน: หลายแบบ (เจดีย์หิน 8 เหลี่ยม 9 ชั้นวอลจองซา, เจดีย์หิน 10 ชั้นคยองชอนซาจี)\n• งานฝีมือ: เทคนิคฝังเงิน, เครื่องเขินฝังมุก"
  },
  "ch_joseon_early_01": {
    "title": "การก่อตั้งและระบบปกครองของโชซอน",
    "theory": "ในปี ค.ศ. 1392 อีซองกเยก่อตั้งโชซอน ใช้ลัทธิขงจื๊อใหม่เป็นอุดมการณ์ปกครอง\n\n• การก่อตั้ง: การถอยทัพจากวีฮวาโด (ค.ศ. 1388) → บังคับใช้กวาจอนบอบ → ก่อตั้งโชซอน\n• กษัตริย์แทโจ: ย้ายเมืองหลวงไปฮันยัง, สร้างพระราชวังคยองบก\n• กษัตริย์แทจง: ระบบ 6 โจ ตรง, ยกเลิกกองทัพส่วนตัว, กฎหมายโฮแพ\n• ระบบปกครอง: อึยจองบู, 6 โจ, ซัมซา (ซาฮอนบู, ซากันวอน, ฮงมุนกวัน)\n• ท้องถิ่น: 8 โด, ส่งกวันชัลซาและซูรยอง, ควบคุมฮยังรี"
  },
  "ch_joseon_early_02": {
    "title": "การเมืองสมัยกษัตริย์เซจง~ซองจง",
    "theory": "กษัตริย์โชซอนยุคต้นสถาปนาการเมืองขงจื๊อและพัฒนาวัฒนธรรม\n\n• กษัตริย์เซจง: จิบฮยอนจอน, ฮุนมินจองอึม, บุกเบิก 4 กุน 6 จิน, ระบบอึยจองบูซอซาเจ\n• กษัตริย์เซโจ: ยกเลิกจิบฮยอนจอน, ระบบ 6 โจ ตรง, เริ่มรวบรวมคยองกุกแทจอน\n• กษัตริย์ซองจง: เสร็จสิ้นและประกาศคยองกุกแทจอน, ตั้งฮงมุนกวัน, แต่งตั้งซาริม\n• ทิศทางปกครอง: ความสมดุลระหว่างอำนาจกษัตริย์และขุนนาง\n• จิบฮยอนจอน: สถาบันวิจัยวิชาการของกษัตริย์เซจง"
  },
  "ch_joseon_early_03": {
    "title": "การเติบโตของซาริมและซาฮวา",
    "theory": "หลังกษัตริย์ซองจง ซาริมเติบโตแต่ขัดแย้งกับฮุนกูจนเกิดซาฮวา\n\n• ซาริม: สายคิมจงจิก, ฐานในชนบท, ซอวอนและฮยังยัก, เน้นโทฮัก\n• ฮุนกู: กลุ่มอำนาจจากการช่วยกษัตริย์เซโจ, ควบคุมการเมืองกลาง\n• 4 ซาฮวาใหญ่: มูโอ (ค.ศ. 1498), กับจา (ค.ศ. 1504), กีมโย (ค.ศ. 1519), อึลซา (ค.ศ. 1545)\n• ซาฮวามูโอ: โจอึยเจมุนของคิมจงจิก, กษัตริย์ยอนซัน\n• ซาฮวากีมโย: การปฏิรูปของโจกวังโจ (ฮยอนรยังกวา, ยกเลิกโซกยอกซอ), กษัตริย์จุงจง"
  },
  "ch_joseon_early_04": {
    "title": "จุดเริ่มต้นของการเมืองบุงดัง",
    "theory": "เมื่อซาริมครองอำนาจในสมัยกษัตริย์ซอนโจ การเมืองบุงดังเริ่มต้น\n\n• การก่อตัวบุงดัง: ปัญหาการแต่งตั้งอีโจจอนรัง, ดงอิน (คิมฮโยวอน), ซออิน (ชิมอึยกยอม)\n• ดงอินแยก: กบฏจองยอริบ → นามิน (สายกลาง), บูกิน (สายแข็ง)\n• ซออิน: สายอีอี, ซองฮน, ภูมิภาคกีโฮ\n• ดงอิน: สายอีฮวัง, ภูมิภาคยองนัม\n• ลักษณะเด่น: ฐานสายวิชาการและภูมิภาค, วิจารณ์และถ่วงดุลกัน, เน้นมติสาธารณะ"
  },
  "ch_joseon_early_05": {
    "title": "สงครามอิมจินเวรัน",
    "theory": "ในปี ค.ศ. 1592 ญี่ปุ่นรุกรานโชซอนเกิดสงครามอิมจินเวรัน\n\n• สาเหตุ: ความทะเยอทะยานพิชิตทวีปของโทโยโทมิ ฮิเดโยชิ\n• ช่วงต้น: ปูซันจินและดงแนซองแตก, ฮันซองแตกใน 20 วัน\n• กองทัพเรือ: อีซุนชินทำผลงาน (ยุทธการฮันซันโด, ยุทธการมยองรยัง)\n• กองทัพอาสา: กวักแจอู, โจฮอน, โกกยองมยอง, พระซอซันแดซา, พระซามยองแดซา\n• ผลลัพธ์: แผ่นดินเสียหาย, ประชากรลด, มรดกวัฒนธรรมถูกปล้น, วัฒนธรรมญี่ปุ่นพัฒนา"
  },
  "ch_joseon_early_06": {
    "title": "สงครามบยองจาโฮรันและทฤษฎีบุกบอล",
    "theory": "ในปี ค.ศ. 1636 ชิงรุกรานเกิดสงครามบยองจาโฮรัน\n\n• จองมโยโฮรัน (ค.ศ. 1627): หูจินรุกราน, ทำสัญญาพี่น้อง\n• บยองจาโฮรัน (ค.ศ. 1636): ชิงรุกราน, สู้รบที่นัมฮันซันซอง, ความอัปยศซัมจอนโด\n• ผลลัพธ์: ยอมเป็นข้าของชิง, โซฮยอนเซจาและบงนิมแทกุนเป็นตัวประกัน, ศิลาซัมจอนโด\n• ทฤษฎีบุกบอล: กษัตริย์ฮโยจง, ซงซียอล, เรียกร้องปราบชิง, ไม่สำเร็จ\n• อิทธิพล: จิตสำนึกต่อต้านชิง, ทฤษฎีบุกฮัก (รับวัฒนธรรมชิง)"
  },
  "ch_joseon_early_07": {
    "title": "เศรษฐกิจของโชซอนยุคต้น",
    "theory": "โชซอนยุคต้นสถาปนาระบบเศรษฐกิจเกษตรกรรม\n\n• ระบบที่ดิน: กวาจอนบอบ (ที่ดินคยองกี), จิกจอนบอบ (เซโจ), กวันซูกวันกึบเจ (ซองจง)\n• เกษตรกรรม: นงซาจิกซอล (เซจง), ยอนบุน 9 ชั้น, จอนบุน 6 ชั้น, ปลูก 3 ครั้งใน 2 ปี\n• การค้า: ซีจอน (จงโน), กยองซีซอกำกับ, จอฮวาและโชซอนทงโบหมุนเวียนไม่ดี\n• หัตถกรรม: หัตถกรรมราชการเป็นหลัก, ระบบลงทะเบียนช่างฝีมือ\n• เหมืองแร่: ขุดเงินและทองแดง, ถลุงทองและเงิน"
  },
  "ch_joseon_early_08": {
    "title": "ระบบชนชั้นและสังคมของโชซอนยุคต้น",
    "theory": "โชซอนเป็นสังคมชนชั้น: ยังบัน, จุงอิน, ยังอิน, ชอนมิน\n\n• ยังบัน: ขุนนางพลเรือนและทหาร, การสอบและอึมซอ, สิทธิพิเศษยกเว้นภาษี\n• จุงอิน: ผู้เชี่ยวชาญ (ล่าม, แพทย์, นักคณิตศาสตร์), ซอออล\n• ยังอิน: ชาวนา, พ่อค้า, ช่างฝีมือ, แบกรับภาษี บรรณาการ แรงงาน\n• ชอนมิน: โนบี (อิลชอนจึกชอน), แพกจอง, นักแสดง ฯลฯ\n• ครอบครัว: เน้นสายพ่อแข็งแกร่งขึ้น, รวบรวมสายตระกูล, เผยแพร่จงบอบ"
  },
  "ch_joseon_early_09": {
    "title": "ลัทธิขงจื๊อใหม่และการศึกษาของโชซอนยุคต้น",
    "theory": "ลัทธิขงจื๊อใหม่เป็นอุดมการณ์ปกครองและบรรทัดฐานสังคมของโชซอน\n\n• ลัทธิขงจื๊อใหม่: ทฤษฎีอีกี (อีฮวัง อีกีอีวอลลน, อีอี อีกีอิลวอลลน)\n• สถาบันการศึกษา: ซองกยุนกวัน (สูงสุด), 4 ฮัก (มัธยม), ฮยังกโย (ท้องถิ่น)\n• ซอวอน: สถาบันการศึกษาของซาริม, จูเซบุงสร้างแพกอุนดงซอวอน (แห่งแรก)\n• การสอบ: มุนกวา, มูกวา, จับกวา, สอบแซงวอนและจินซา (โซกวา)\n• เยฮัก: การี (จูจากาเร), เผยแพร่กวันฮนซังเจ"
  },
  "ch_joseon_early_10": {
    "title": "หนังสือประวัติศาสตร์และภูมิศาสตร์ของโชซอนยุคต้น",
    "theory": "โชซอนดำเนินโครงการรวบรวมหลายอย่างโดยรัฐนำ\n\n• หนังสือประวัติศาสตร์: โชซอนวังโจซิลลก (ยูเนสโก), โกรยอซา, โกรยอซาจอลโย\n• หนังสือภูมิศาสตร์: ดงกุกยอจีซึงนัม, ชินจึงดงกุกยอจีซึงนัม\n• ประมวลกฎหมาย: คยองกุกแทจอน (ซองจง), แทจอนซกรก, แทจอนฮูซกรก\n• หนังสือพิธีกรรม: กุกโจโอเรอึย (เซจง~ซองจง)\n• หนังสือเกษตร: นงซาจิกซอล (เซจง)"
  },
  "ch_joseon_early_11": {
    "title": "วิทยาศาสตร์และเทคโนโลยีของโชซอนยุคต้น",
    "theory": "สมัยกษัตริย์เซจงเป็นยุคทองของวิทยาศาสตร์และเทคโนโลยี\n\n• ดาราศาสตร์: ฮนชอนอึย, กันอึย, อังบูอิลกู, จากยอกรู (จังยองชิล)\n• ชึกอูกี: เครื่องวัดปริมาณน้ำฝนแรกของโลก\n• การพิมพ์: เกมีจา, กับอินจา (ตัวพิมพ์โลหะ), เซจง\n• แผนที่: ฮนอิลกังรียอกแทกุกโดจิโด (แผนที่โลกเก่าแก่ที่สุดที่มีอยู่)\n• การแพทย์: ฮยังยักจิบซองบัง (เซจง), อึยบังยูชวี, ดงอึยโบกัม (กษัตริย์กวังแฮ)"
  },
  "ch_joseon_early_12": {
    "title": "ศิลปะของโชซอนยุคต้น",
    "theory": "โชซอนยุคต้นสะท้อนอุดมการณ์ขงจื๊อใหม่ในศิลปะ\n\n• จิตรกรรม: อันกยอน (มงยูโดวอนโด), คังฮีอัน, จิตรกรรมมุนอินฮวาพัฒนา\n• เครื่องปั้น: บุนชองซากี→แพกจา (ศตวรรษที่ 16), ความงามเรียบง่ายและยับยั้ง\n• สถาปัตยกรรม: สถาปัตยกรรมขงจื๊อ (พระราชวัง, จงมโย), ซุงเรมุน, พระราชวังคยองบก\n• ดนตรี: จัดระเบียบอาอัก (บักยอน), จองกันโบ (เซจง)\n• งานฝีมือ: งานไม้, เครื่องเขินฝังมุก"
  },
  "ch_joseon_late_01": {
    "title": "ความเสื่อมของการเมืองบุงดัง",
    "theory": "ปลายศตวรรษที่ 17 การเมืองบุงดังเสื่อมลงและเกิดการผูกขาดของพรรคเดียว\n\n• การถกเถียงเยซง: ปัญหาการไว้ทุกข์หลังกษัตริย์ฮโยจงสิ้นพระชนม์, ซออิน vs นามิน\n• คยองชินฮวันกุก (ค.ศ. 1680): นามินตกจากอำนาจ, ซออินครองอำนาจ\n• กีซาฮวันกุก (ค.ศ. 1689): ซออินตกจากอำนาจ, นามินครองอำนาจ, ซงซียอลถูกประหาร\n• กับซูลฮวันกุก (ค.ศ. 1694): นามินตกจากอำนาจ, ซออิน (โนรน, โซรน) ครองอำนาจ\n• ผลลัพธ์: สูญเสียการถ่วงดุลกัน, พรรคเดียวผูกขาด"
  },
  "ch_joseon_late_02": {
    "title": "การเมืองทังพยอง",
    "theory": "กษัตริย์ยองโจและจองโจดำเนินนโยบายทังพยองเพื่อแก้ปัญหาบุงดัง\n\n• กษัตริย์ยองโจ: ทังพยองสายกลาง (แต่งตั้งสายอ่อน), ลดอำนาจอีโจจอนรัง, กยุนยอกบอบ\n• กษัตริย์จองโจ: ทังพยองตามความสามารถ, ตั้งกยูจังกัก, จังยงยอง, ป้อมซูวอนฮวาซอง\n• การปฏิรูปของจองโจ: ระบบโชกเยมุนชิน, อนุญาตซอออล, ยกเลิกสิทธิพิเศษซีจอน (ชินแฮทงกง)\n• ข้อจำกัด: ตระกูลเซโดเติบโต, เป็นฐานให้ญาติราชวงศ์ฝ่ายมารดา\n• ความสำคัญ: เสริมอำนาจกษัตริย์, ฟื้นฟูวัฒนธรรม"
  },
  "ch_joseon_late_03": {
    "title": "การเมืองเซโด",
    "theory": "หลังกษัตริย์ซุนโจ ตระกูลญาติราชวงศ์ผูกขาดอำนาจเป็นการเมืองเซโด\n\n• ตระกูลเซโด: คิมแห่งอันดง (ซุนโจ), โจแห่งพุงยัง (ฮอนจง, ชอลจง)\n• ซัมจองมุลลัน: จอนจอง (ภาษีที่ดิน), กุนจอง (ภาษีทหาร), ฮวันกก (ดอกเบี้ย) เสื่อม\n• กบฏชาวนา: กบฏฮงกยองแน (ค.ศ. 1811), กบฏชาวนาอิมซูล (ค.ศ. 1862, จินจู)\n• ความวุ่นวายสังคม: บีกี, คำทำนายโดชัม นิยม, กบฏบ่อย\n• ผลลัพธ์: อำนาจกษัตริย์อ่อนแอ, วินัยรัฐหย่อน, การเปิดประเทศล่าช้า"
  },
  "ch_joseon_late_04": {
    "title": "การเปลี่ยนแปลงเศรษฐกิจของโชซอนยุคปลาย",
    "theory": "โชซอนยุคปลายเศรษฐกิจสินค้าและเงินตราพัฒนา\n\n• เกษตรกรรม: อียังบอบ (ดำนา) แพร่หลาย, กวังจัก (ชาวนารวย), พืชเศรษฐกิจ (ยาสูบ, โสม, ฝ้าย)\n• หัตถกรรม: เป็นของเอกชน, ซอนแดเจ (พ่อค้าจัดหาวัตถุดิบ)\n• การค้า: ซาซัง (พ่อค้านอกซีจอน), ซงซัง, มันซัง, พ่อค้าแกซอง, ตลาด 5 วัน\n• เงินตรา: ซังพยองทงโบหมุนเวียนทั่วประเทศ (กษัตริย์ซุกจง)\n• เหมืองแร่: ซอลจอมซูเซเจ (เหมืองเอกชนดำเนินการ)"
  },
  "ch_joseon_late_05": {
    "title": "ความสั่นคลอนของระบบชนชั้นโชซอนยุคปลาย",
    "theory": "โชซอนยุคปลายระบบชนชั้นสั่นคลอนและเกิดการเปลี่ยนแปลงสังคม\n\n• ชนชั้นยังบัน: ยังบันล่มสลายเพิ่มขึ้น, ฮยังบัน, จันบัน\n• ชนชั้นจุงอิน: ขบวนการยกระดับชนชั้น, เรียกร้องสิทธิสอบยอกกวา, ขบวนการโซชอง\n• ซอออล: เรียกร้องฮอทง, เข้ารับตำแหน่งกอมซอกวันในกยูจังกัก\n• ชนชั้นชาวนา: ยกระดับชนชั้นด้วยนับซก, กงมยองชอบ\n• โนบี: ปลดปล่อยโนบีรัฐ (ซุนโจ, ค.ศ. 1801), ประชากรโนบีลด"
  },
  "ch_joseon_late_06": {
    "title": "การพัฒนาของซิลฮัก",
    "theory": "ศตวรรษที่ 17-18 ซิลฮักที่แสวงหาการปฏิรูปสังคมพัฒนา\n\n• สำนักคยองเซชียง (เน้นเกษตร): ยูฮยองวอน (บันกเยซูรก), อีอิก (ซองโฮซาซอล), จองยักยง (มกมินซิมซอ, คยองเซยูพโย)\n• สำนักอียงฮูแซง (เน้นพาณิชย์): ยูซูวอน, บักจีวอน (ยอลฮาอิลกี), บักเจกา (บุกฮักอึย), ฮงแดยง\n• จองยักยง: กอจุงกี (ป้อมซูวอนฮวาซอง), ยอจอนเจ, จองจอนเจ, มกมินซิมซอ\n• อิทธิพล: ประเทศมั่งคั่งแข็งแกร่ง, เสถียรภาพประชาชน, สร้างจิตสำนึกสมัยใหม่\n• ข้อจำกัด: ไม่ได้รับการยอมรับจากผู้ปกครอง"
  },
  "ch_joseon_late_07": {
    "title": "การพัฒนาของกุกฮัก",
    "theory": "โชซอนยุคปลายความสนใจในวัฒนธรรมและประวัติศาสตร์ชาติเพิ่มขึ้น\n\n• วิจัยภาษาชาติ: ชินกยองจุน (ฮุนมินจองอึมอุนแฮ), ยูฮี (ออนมุนจี)\n• หนังสือประวัติศาสตร์: อันจองบก (ดงซากังมก), อีกึงอิก (ยอลลยอซิลกีซูล), ฮันชียุน (แฮดงยอกซา)\n• หนังสือภูมิศาสตร์: จองซังกี (ดงกุกจิโด), คิมจองโฮ (แทดงยอจีโด)\n• สารานุกรม: อีอิก (ซองโฮซาซอล), อีด็อกมู (ชองจังกวันจอนซอ)\n• ลักษณะเด่น: วิจัยเชิงประจักษ์และเป็นกลาง, ค้นหาอัตลักษณ์ชาติ"
  },
  "ch_joseon_late_08": {
    "title": "การพัฒนาของวัฒนธรรมสามัญชน",
    "theory": "โชซอนยุคปลายอำนาจทางเศรษฐกิจของสามัญชนเพิ่มทำให้วัฒนธรรมมวลชนพัฒนา\n\n• วรรณกรรม: นิยายฮันกึล (ฮงกิลดงจอน, ชุนฮยังจอน), พันโซรี, ซาซอลซีโจ\n• จิตรกรรม: ภาพชีวิตประจำวัน (คิมฮงโด, ชินยุนบก), มินฮวา, จินกยองซันซูฮวา (จองซอน)\n• การแสดง: ระบำหน้ากาก (บงซันทัลชุม), พันโซรี, หุ่นกระบอก\n• ลักษณะเด่น: เสียดสียังบัน, วิจารณ์สังคม, ความตลกขบขัน\n• คิมจองฮี: อักษรชูซา, เซฮันโด (จิตรกรรมมุนอินฮวา)"
  },
  "ch_joseon_late_09": {
    "title": "วิทยาศาสตร์และเทคโนโลยีของโชซอนยุคปลาย",
    "theory": "โชซอนยุคปลายวิทยาศาสตร์และเทคโนโลยีพัฒนาจากอิทธิพลของซิลฮัก\n\n• แผนที่: จองซังกี (ดงกุกจิโด, มาตราส่วน 100 รี), คิมจองโฮ (แทดงยอจีโด, แม่พิมพ์ไม้)\n• การแพทย์: ฮอจุน (ดงอึยโบกัม), จองยักยง (มากวาโฮทง)\n• ดาราศาสตร์: ฮงแดยง (ทฤษฎีโลกหมุน), รับดาราศาสตร์ตะวันตก\n• เกษตรกรรม: บักเซดัง (แซกกยอง), นวัตกรรมเทคนิคเกษตร\n• เทคโนโลยี: กอจุงกี (จองยักยง), สำนักบุกฮักเสนอนำเข้าซูชา"
  },
  "ch_joseon_late_10": {
    "title": "การเกิดขึ้นของศาสนาใหม่",
    "theory": "โชซอนยุคปลายศาสนาและความคิดใหม่เกิดขึ้น\n\n• คริสต์ศาสนา: เข้ามาในศตวรรษที่ 17 เป็นซอฮัก, อีซึงฮุนรับบัพติศมา (ค.ศ. 1784), การกดขี่ชินแฮและกีแฮ\n• ดงฮัก: ค.ศ. 1860 ชเวเจอูก่อตั้ง, อินแนชอน (คนคือสวรรค์), ต่อต้านระบบศักดินาและต่างชาติ\n• ความคิดพยากรณ์: จองกัมรก, บีกีและโดชัมนิยม\n• ศรัทธาพระศรีอารย์: ความหวังการช่วยเหลือของประชาชน\n• ลักษณะเด่น: วิจารณ์ความขัดแย้งสังคม, ความคิดเสมอภาค"
  },
  "ch_modern_01": {
    "title": "การปฏิรูปของฮึงซอนแทวอนกุน",
    "theory": "ฮึงซอนแทวอนกุนดำเนินการปฏิรูปเพื่อเสริมอำนาจกษัตริย์และเสถียรภาพประชาชน\n\n• เสริมอำนาจกษัตริย์: บูรณะพระราชวังคยองบก, ยกเลิกบีบยอนซา, ฟื้นฟูซัมกุนบู\n• ล้มล้างการเมืองเซโด: ขับไล่อำนาจคิมแห่งอันดง, แต่งตั้งคนเก่ง\n• ปฏิรูปซัมจอง: โฮโพเจ (ยังบันจ่ายภาษีทหาร), ซาชังเจ (แทนฮวันกก)\n• ยกเลิกซอวอน: เหลือเพียง 47 แห่ง, ยกเลิกสิทธิพิเศษยกเว้นภาษี\n• ปฏิเสธการค้า: บยองอินยังโย (ค.ศ. 1866), ชินมียังโย (ค.ศ. 1871), ศิลาชอกฮวา"
  },
  "ch_modern_02": {
    "title": "การเปิดประเทศและสนธิสัญญาไม่เท่าเทียม",
    "theory": "ในปี ค.ศ. 1876 โชซอนเปิดประเทศด้วยสนธิสัญญาคังฮวาโด\n\n• เหตุการณ์เรืออุนโยโฮ (ค.ศ. 1875): เรือรบญี่ปุ่นบุกคังฮวาโด\n• สนธิสัญญาคังฮวาโด (ค.ศ. 1876): สนธิสัญญาสมัยใหม่แรก, สนธิสัญญาไม่เท่าเทียม\n  - เปิดปูซาน, วอนซัน, อินชอน, สิทธิสภาพนอกอาณาเขต, สิทธิสำรวจชายฝั่ง\n• สนธิสัญญาโชมีซูโฮทงซัง (ค.ศ. 1882): สิทธิชาติที่ได้รับความอนุเคราะห์ยิ่ง, การไกล่เกลี่ย\n• ต่อมาสถาปนาความสัมพันธ์กับอังกฤษ, เยอรมนี, รัสเซีย, ฝรั่งเศส\n• อิทธิพล: โอกาสสู่ความทันสมัย, จุดเริ่มต้นการเอารัดเอาเปรียบทางเศรษฐกิจ"
  },
  "ch_modern_03": {
    "title": "ขบวนการแกฮวาและวีจองชอกซา",
    "theory": "หลังเปิดประเทศ ฝ่ายแกฮวาและวีจองชอกซาขัดแย้งกัน\n\n• ฝ่ายแกฮวา: เปิดประเทศ, รับวัฒนธรรมตะวันตก, ผลักดันความทันสมัย\n  - แกฮวาสายอ่อน (ดงโดซอกี): คิมฮงจิบ, ออยุนจุง\n  - แกฮวาสายแข็ง (มุนมยองแกฮวา): คิมอกกยุน, บักยองฮโย, ฮงยองชิก\n• วีจองชอกซา: ปกป้องลัทธิขงจื๊อ, ต่อต้านต่างชาติ\n  - อีฮังโน, กีจองจิน, ชเวอิกฮยอน (ทฤษฎีแวยังอิลเช)\n• ทงรีกีมูอามุน: องค์กรผลักดันนโยบายแกฮวา"
  },
  "ch_modern_04": {
    "title": "กบฏอิมโอและรัฐประหารกับชิน",
    "theory": "ทศวรรษ 1880 โชซอนเข้าสู่ยุคความวุ่นวายทางการเมือง\n\n• กบฏอิมโอ (ค.ศ. 1882): ทหารเก่าก่อกบฏ, แทวอนกุนกลับมามีอำนาจ\n  - ชิงแทรกแซง, แทวอนกุนถูกลักพาตัวไปชิง, สนธิสัญญาเจมูลโพ\n• รัฐประหารกับชิน (ค.ศ. 1884): แกฮวาสายแข็งก่อรัฐประหาร, นโยบายปฏิรูป 14 ข้อ\n  - ครองอำนาจ 3 วัน, ล้มเหลวจากการแทรกแซงของชิง, คิมอกกยุนลี้ภัย\n• ผลลัพธ์: ชิงแทรกแซงมากขึ้น, ทฤษฎีความเป็นกลางของโชซอน\n• สนธิสัญญาฮันซอง, เทียนจิน: สมดุลอำนาจญี่ปุ่น-ชิง"
  },
  "ch_modern_05": {
    "title": "ขบวนการชาวนาดงฮัก",
    "theory": "ในปี ค.ศ. 1894 กองทัพชาวนาดงฮักดำเนินขบวนการต่อต้านระบบศักดินาและต่างชาติ\n\n• ภูมิหลัง: ซัมจองเสื่อม, ญี่ปุ่นเอารัดเอาเปรียบเศรษฐกิจ, ขบวนการกโยโจชินวอน\n• ลุกขึ้นครั้งที่ 1: กบฏโกบู (จอนบงจุน), ชนะยุทธการฮวังโทฮยอนและฮวังรยงชน\n• สงบศึกจอนจู: ข้อเสนอปฏิรูป 12 ข้อ, ตั้งจิบกังโซ\n• ลุกขึ้นครั้งที่ 2: ต่อต้านญี่ปุ่นยึดพระราชวังคยองบก, แพ้ยุทธการอูกึมชี\n• ความสำคัญ: ต่อต้านระบบศักดินาและจักรวรรดินิยม, มีอิทธิพลต่อการปฏิรูปกาโบ"
  },
  "ch_modern_06": {
    "title": "การปฏิรูปกาโบและอึลมี",
    "theory": "ค.ศ. 1894-1896 ดำเนินการปฏิรูปสมัยใหม่\n\n• การปฏิรูปกาโบ (ค.ศ. 1894): กุนกุกกีมูชอ, ยกเลิกระบบสอบ, ยกเลิกระบบชนชั้น\n  - ระบบเงินมาตรฐาน, รวมมาตราชั่งตวงวัด, ตั้งศาล\n• การปฏิรูปอึลมี (ค.ศ. 1895): ใช้ปฏิทินสุริยคติ, คำสั่งตัดผม, ตั้งโรงเรียนประถม\n• เหตุการณ์อึลมี (ค.ศ. 1895): ญี่ปุ่นลอบปลงพระชนม์พระราชินีมยองซอง\n• อากวันพาชอน (ค.ศ. 1896): กษัตริย์โกจงหนีไปสถานทูตรัสเซีย\n• ข้อจำกัด: ญี่ปุ่นนำ, ประชาชนต่อต้าน (กองทัพอาสาอึลมี)"
  },
  "ch_modern_07": {
    "title": "สมาคมอิสรภาพและจักรวรรดิเกาหลี",
    "theory": "ปลายทศวรรษ 1890 ขบวนการเอกราชและความทันสมัยดำเนินไป\n\n• สมาคมอิสรภาพ (ค.ศ. 1896): ซอแจพิล, หนังสือพิมพ์อิสรภาพ, สร้างประตูอิสรภาพ\n  - มันมินกงดงฮเว, ขบวนการจัดตั้งรัฐสภา, ฮอนอึย 6 ข้อ\n• จักรวรรดิเกาหลี (ค.ศ. 1897): โกจงขึ้นครองราชย์เป็นจักรพรรดิ, การปฏิรูปกวังมู\n  - กูบนชินชัม (นำสิ่งใหม่บนพื้นฐานเก่า)\n  - โครงการสำรวจที่ดิน, ออกจีกเย, ตั้งวอนซูบู\n• ข้อจำกัด: ปฏิรูปอนุรักษ์นิยม, มหาอำนาจเอารัดเอาเปรียบมากขึ้น"
  },
  "ch_modern_08": {
    "title": "ขบวนการกองทัพอาสาต่อต้านญี่ปุ่น",
    "theory": "หลังเปิดประเทศ ขบวนการกองทัพอาสาต่อสู้กับการรุกรานของญี่ปุ่น\n\n• กองทัพอาสาอึลมี (ค.ศ. 1895): ต่อต้านคำสั่งตัดผมและการสังหารพระราชินี, นำโดยปัญญาชน\n  - ยูอินซอก, อีโซอึง ฯลฯ ทำผลงาน\n• กองทัพอาสาอึลซา (ค.ศ. 1905): ต่อต้านสนธิสัญญาอึลซา, มินจงซิก, ชเวอิกฮยอน\n• กองทัพอาสาจองมี (ค.ศ. 1907): ต่อต้านการยุบกองทัพ, ทหารที่ถูกปลดเข้าร่วม\n  - กองทัพชังอึย 13 โด (อีอินยอง), ปฏิบัติการบุกโซล\n• ข้อจำกัด: อ่อนแอจากปฏิบัติการกวาดล้างใต้ของญี่ปุ่น (ค.ศ. 1909)"
  },
  "ch_modern_09": {
    "title": "ขบวนการแอกุกเกมง",
    "theory": "ขบวนการกู้คืนอธิปไตยผ่านการสร้างความสามารถดำเนินไป\n\n• องค์กร: โบอันฮเว (ต่อต้านสิทธิบุกเบิกที่รกร้างของญี่ปุ่น), ฮอนจองยอนกูฮเว, แทฮันจากังฮเว\n• ชินมินฮเว (ค.ศ. 1907): อันชังโฮ, ยังกีทัก, สมาคมลับ, มุ่งสู่สาธารณรัฐ\n  - โรงเรียนโอซัน, โรงเรียนแทซอง, สำนักพิมพ์แทกึก, บริษัทจากี\n• การศึกษา: ตั้งโรงเรียนเอกชน, การศึกษาชาติ\n• สื่อ: ฮวังซองชินมุน, แทฮันแมอิลชินโบ (เบเทล), ขบวนการชำระหนี้ชาติ\n• ข้อจำกัด: เน้นสร้างความสามารถ, ถูกญี่ปุ่นกดขี่"
  },
  "ch_modern_10": {
    "title": "กระบวนการสูญเสียอธิปไตย",
    "theory": "ญี่ปุ่นเอาอธิปไตยของโชซอนทีละขั้น\n\n• สนธิสัญญาอึลซา (ค.ศ. 1905): ริบสิทธิการทูต, ตั้งสำนักงานผู้สำเร็จราชการ (อิโต ฮิโรบูมิ)\n• ทูตพิเศษเฮก (ค.ศ. 1907): อีจุน, อีซังซอล, อีวีจง, โกจงถูกบังคับสละราชสมบัติ\n• สนธิสัญญาจองมี 7 ข้อ (ค.ศ. 1907): ริบอำนาจภายใน, ยุบกองทัพ\n• บันทึกกียู (ค.ศ. 1909): ริบอำนาจตุลาการและตำรวจ\n• คยองซูลกุกชี (ค.ศ. 1910.8.29): สนธิสัญญาผนวกเกาหลี-ญี่ปุ่น, สูญเสียอธิปไตย\n• การต่อต้าน: อันจุงกึนยิงอิโต ฮิโรบูมิ (ค.ศ. 1909)"
  },
  "ch_japanese_occupation_01": {
    "title": "การปกครองทหารในทศวรรษ 1910",
    "theory": "ในทศวรรษ 1910 ญี่ปุ่นดำเนินการปกครองทหารโดยใช้ตำรวจทหาร\n\n• สำนักงานผู้ว่าการโชซอน: ผู้ว่าการ (นายพลบกหรือเรือ), ยึดอำนาจนิติบัญญัติ ตุลาการ บริหาร\n• ระบบตำรวจทหาร: อำนาจลงโทษทันที (โบยตี), เฝ้าระวังคนโชซอน\n• โครงการสำรวจที่ดิน (ค.ศ. 1910-1918): ระบบแจ้งความ, ยึดที่ดินที่ไม่แจ้ง\n  - ตั้งบริษัทดงยังชอกชิก, เจ้าของที่ดินญี่ปุ่นเพิ่ม\n• กฎหมายบริษัท: ระบบอนุญาตตั้งบริษัท, กดดันทุนชาติ\n• การศึกษา: การศึกษาทำให้โง่, จำกัดการศึกษาภาษาโชซอน"
  },
  "ch_japanese_occupation_02": {
    "title": "การปกครองวัฒนธรรมในทศวรรษ 1920",
    "theory": "หลังขบวนการ 1 มีนาคม ญี่ปุ่นดำเนินการปกครองวัฒนธรรม (นโยบายผ่อนปรนหลอกลวง)\n\n• ระบบตำรวจปกติ: ยกเลิกตำรวจทหาร, จริงๆ เพิ่มจำนวนและอุปกรณ์ตำรวจ\n• สื่อและการชุมนุม: อนุญาตโชซอนอิลโบ, ดงอาอิลโบ (เซ็นเซอร์), กิจกรรมสมาคมภาษาโชซอน\n• การศึกษา: อนุญาตตั้งมหาวิทยาลัย (มหาวิทยาลัยคยองซอง, ค.ศ. 1924), ขยายโรงเรียนสามัญ\n• แผนเพิ่มผลผลิตข้าว: เพิ่มผลผลิตข้าว→ส่งออกญี่ปุ่น, โชซอนขาดอาหาร\n• ข้อจำกัด: สร้างผู้สนับสนุนญี่ปุ่น, แบ่งแยกชาติ"
  },
  "ch_japanese_occupation_03": {
    "title": "การปกครองทำลายล้างชาติในทศวรรษ 1930-40",
    "theory": "หลัง ค.ศ. 1930 ญี่ปุ่นบังคับนโยบายทำลายล้างชาติเพื่อทำสงคราม\n\n• ฮวังกุกชินมินฮวา: คำปฏิญาณราษฎรจักรวรรดิ, บังคับไหว้ศาลเจ้า, ไหว้พระราชวัง\n• ทำลายวัฒนธรรมชาติ: ห้ามใช้ภาษาโชซอน, กดขี่สมาคมภาษาโชซอน (ค.ศ. 1942)\n• ชังชีแกมยอง (ค.ศ. 1940): บังคับใช้ชื่อญี่ปุ่น\n• ขูดรีดแรงงาน: ระบบอาสา→เกณฑ์ทหาร, นักศึกษาอาสา, แรงงานบังคับ\n• ขูดรีดผู้หญิง: บังคับเป็น 'สตรีบำเรอ' ของกองทัพญี่ปุ่น\n• ขูดรีดวัตถุ: ระบบส่งมอบ, บังคับส่งโลหะ"
  },
  "ch_japanese_occupation_04": {
    "title": "ขบวนการ 1 มีนาคม",
    "theory": "ขบวนการ 1 มีนาคม ค.ศ. 1919 เป็นขบวนการชาติใหญ่ที่สุดในยุคอาณานิคมญี่ปุ่น\n\n• ภูมิหลัง: หลักการกำหนดชะตากรรมชาติของวิลสัน, ประกาศเอกราช 8 กุมภาพันธ์ (โตเกียว), ข่าวลือโกจงถูกวางยา\n• พัฒนาการ: 1 มีนาคม สวนทับกล, อ่านประกาศเอกราช, ประท้วงมันเซ\n  - นักศึกษา, ศาสนิกชน → ทุกชนชั้น, ทั่วประเทศ, ต่างประเทศ (กันโด, ยอนแฮจู)\n• ญี่ปุ่นกดขี่: สังหารหมู่เจอัมรี, เผาซูวอนฮวาซอง\n• ความสำคัญ: ตั้งรัฐบาลเฉพาะกาลแทฮันมินกุก, เปลี่ยนจากสันติสู่การต่อสู้ด้วยอาวุธ\n• อิทธิพล: ขบวนการ 4 พฤษภาคมของจีน, ขบวนการอหิงสาของอินเดีย"
  },
  "ch_japanese_occupation_05": {
    "title": "รัฐบาลเฉพาะกาลแทฮันมินกุก",
    "theory": "ในปี ค.ศ. 1919 รัฐบาลเฉพาะกาลแทฮันมินกุกก่อตั้งที่เซี่ยงไฮ้\n\n• การก่อตั้ง: เซี่ยงไฮ้ (รัฐบาลรวม), ระบอบประชาธิปไตยสาธารณรัฐ, ประธานอีซึงมัน\n• กิจกรรม: ระบบยอนทง, กุกกโยทง, หนังสือพิมพ์อิสรภาพ, สำนักรวบรวมประวัติศาสตร์\n• วิกฤต: อีซึงมันถูกถอดถอน, สภาผู้แทนชาติแตกแยก (ค.ศ. 1923)\n• ผู้นำคิมกู: หน่วยรักชาติฮันอิน, วีรกรรมยุนบงกิล (ค.ศ. 1932)\n• ย้ายไปฉงชิ่ง (ค.ศ. 1940): ตั้งกองทัพกู้ชาติเกาหลี, ประกาศสงครามกับญี่ปุ่น\n• ความสำคัญ: ศูนย์กลางขบวนการเอกราช, ประเพณีประชาธิปไตยสาธารณรัฐ"
  },
  "ch_japanese_occupation_06": {
    "title": "การต่อสู้อุยยอลและหน่วยรักชาติฮันอิน",
    "theory": "หลัง ค.ศ. 1920 การต่อสู้อุยยอลส่วนบุคคลดำเนินไป\n\n• อุยยอลดัน (ค.ศ. 1919): คิมวอนบง, ชินแชโฮ (ประกาศปฏิวัติโชซอน), การต่อสู้รุนแรง\n  - บักแจฮยอก (สถานีตำรวจปูซาน), คิมอิกซัง (สำนักงานผู้ว่าการ), นาซอกจู (บริษัทดงยังชอกชิก)\n• หน่วยรักชาติฮันอิน (ค.ศ. 1931): คิมกูจัดตั้ง, ปฏิบัติการพิเศษ\n  - อีบงชัง: ขว้างระเบิดใส่จักรพรรดิญี่ปุ่น (ค.ศ. 1932, ล้มเหลว)\n  - ยุนบงกิล: วีรกรรมสวนฮุงคุ่วเซี่ยงไฮ้ (ค.ศ. 1932), สังหารนายพลญี่ปุ่น\n• ความสำคัญ: แสดงเจตจำนงเอกราช, เป็นโอกาสให้จีนสนับสนุน"
  },
  "ch_japanese_occupation_07": {
    "title": "สงครามเอกราชด้วยอาวุธ",
    "theory": "หลัง ค.ศ. 1920 สงครามเอกราชด้วยอาวุธดำเนินในแมนจูเรียและจีน\n\n• ยุทธการบงโอดง (ค.ศ. 1920): กองทัพเอกราชเกาหลีของฮงบอมโด, ถล่มกองทัพญี่ปุ่น\n• ยุทธการชองซันรี (ค.ศ. 1920): กองทัพบูกโรกุนจองซอของคิมจวาจิน, ผลงานใหญ่สุด\n• การสังหารหมู่กันโด (ค.ศ. 1920): ญี่ปุ่นสังหารคนโชซอนในกันโด\n• เหตุการณ์จายูซี (ค.ศ. 1921): กองทัพเอกราชเสียชีวิตจากกองทัพแดงโซเวียต\n• รวม 3 บู: ชัมอึยบู, จองอึยบู, ชินมินบู → กุกมินบู, ฮยอกชินอึยฮเว\n• กองทัพกู้ชาติเกาหลี (ค.ศ. 1940): สังกัดรัฐบาลเฉพาะกาล, เตรียมปฏิบัติการบุกเกาหลี"
  },
  "ch_japanese_occupation_08": {
    "title": "ขบวนการชาติทางสังคมและเศรษฐกิจ",
    "theory": "ยุคอาณานิคมญี่ปุ่นมีขบวนการชาติทางสังคมและเศรษฐกิจหลายรูปแบบ\n\n• ขบวนการสนับสนุนสินค้าท้องถิ่น (ค.ศ. 1920): โจมันชิก, ใช้สินค้าท้องถิ่น, 'ชีวิตฉันด้วยของฉัน'\n• ขบวนการตั้งมหาวิทยาลัยเอกชน (ค.ศ. 1922): อีซังแจ, ขบวนการระดมทุน, ญี่ปุ่นขัดขวาง\n• ขบวนการชาวนา: การประท้วงเช่านา (การประท้วงเช่านาอัมแทโด)\n• ขบวนการแรงงาน: การนัดหยุดงานทั่วไปวอนซัน (ค.ศ. 1929), สหพันธ์แรงงานโชซอน\n• ชินกันฮเว (ค.ศ. 1927): พรรคชาติเดียว, ร่วมมือซ้ายขวา, สนับสนุนขบวนการนักศึกษากวังจู"
  },
  "ch_japanese_occupation_09": {
    "title": "ขบวนการปกป้องวัฒนธรรมชาติ",
    "theory": "ยุคอาณานิคมญี่ปุ่นมีความพยายามรักษาวัฒนธรรมและอัตลักษณ์ชาติต่อเนื่อง\n\n• วิจัยภาษาชาติ: สมาคมภาษาโชซอน (ข้อตกลงการสะกดฮันกึล, ภาษามาตรฐาน), กำหนดวันฮันกึล\n• วิจัยประวัติศาสตร์: บักอึนชิก (ฮันกุกทงซา), ชินแชโฮ (โชซอนซังโกซา), ประวัติศาสตร์ชาตินิยม\n• ขบวนการกุกฮัก: จองอินโบ (โชซอนฮัก), มุนอิลพยอง, อันแจฮง\n• การศึกษา: โรงเรียนเอกชนชาติ (โรงเรียนโอซัน, โรงเรียนแทซอง), ขบวนการโรงเรียนกลางคืน\n• ศาสนา: ชอนโดกโย, แทจงกโย, วอนบูลกโย, ปลุกจิตสำนึกชาติ"
  },
  "ch_japanese_occupation_10": {
    "title": "กิจกรรมของชาวเกาหลีในต่างประเทศ",
    "theory": "ยุคอาณานิคมญี่ปุ่นชาวเกาหลีต่างแดนก็เข้าร่วมขบวนการเอกราช\n\n• แมนจูเรีย: ซอกันโด (คยองฮักซา, โรงเรียนชินฮึงมูกวัน), บูกกันโด (โรงเรียนมยองดง, การสังหารหมู่กันโด)\n• ยอนแฮจู: กอนอบฮเว, รัฐบาลทหารกู้ชาติเกาหลี, เหตุการณ์จายูซี\n• อเมริกา: สมาคมชาติเกาหลี, บักยงมัน (ฝึกทหาร), อีซึงมัน (กิจกรรมทางการทูต)\n• ฮาวาย: แรงงานไร่อ้อย, สนับสนุนเงินทุนเอกราช\n• ญี่ปุ่น: ประกาศเอกราช 8 กุมภาพันธ์, ขบวนการนักศึกษาต่างประเทศ"
  },
  "ch_contemporary_01": {
    "title": "การปลดปล่อยและการแบ่งแยก",
    "theory": "15 สิงหาคม ค.ศ. 1945 ญี่ปุ่นยอมแพ้และเกาหลีได้รับการปลดปล่อย\n\n• การปลดปล่อย 15 สิงหาคม (ค.ศ. 1945): ญี่ปุ่นยอมจำนนโดยไม่มีเงื่อนไข, สิ้นสุดการปกครองอาณานิคม 35 ปี\n• ความพยายามเตรียมสร้างชาติ: คณะกรรมการเตรียมสร้างชาติ (ยออุนฮยอง), คณะกรรมการประชาชนทั่วประเทศ\n• การยึดครองของสหรัฐ-โซเวียต: สหรัฐยึดใต้เส้น 38, โซเวียตยึดเหนือเส้น 38 (ตามข้อตกลง)\n• การประชุมรัฐมนตรีต่างประเทศมอสโก (ธันวาคม ค.ศ. 1945): ตกลงให้เกาหลีเป็นรัฐในอารักขา 5 ปี\n• การประชุมร่วมสหรัฐ-โซเวียต: ล้มเหลว, เกาหลีถูกเสนอต่อสหประชาชาติ\n• ผลสืบเนื่อง: สงครามเย็นสหรัฐ-โซเวียตทวีความรุนแรง, คาบสมุทรเกาหลีแบ่งแยก"
  },
  "ch_contemporary_02": {
    "title": "การก่อตั้งรัฐบาลสาธารณรัฐเกาหลี",
    "theory": "ค.ศ. 1948 รัฐบาลสาธารณรัฐเกาหลีก่อตั้งอย่างเป็นทางการ\n\n• มติสหประชาชาติ (พฤศจิกายน ค.ศ. 1947): ตัดสินให้เลือกตั้งทั่วไปเกาหลี, ส่งคณะกรรมการกำกับการเลือกตั้งชั่วคราว\n• การเลือกตั้งทั่วไป 10 พฤษภาคม (ค.ศ. 1948): เลือกตั้งเฉพาะเกาหลีใต้, ประชาธิปไตยครั้งแรก, สภาร่างรัฐธรรมนูญ\n• การประกาศรัฐธรรมนูญ (17 กรกฎาคม): ระบบประธานาธิบดี, ประชาธิปไตย, หลักการรวมชาติสันติ\n• การก่อตั้งรัฐบาล (15 สิงหาคม ค.ศ. 1948): ประธานาธิบดีอีซึงมัน, รัฐบาลสาธารณรัฐเกาหลี\n• การก่อตั้งเกาหลีเหนือ (9 กันยายน): สาธารณรัฐประชาธิปไตยประชาชนเกาหลี, คิมอิลซองเป็นประธาน\n• การรับรองจากสหประชาชาติ: สาธารณรัฐเกาหลีเป็นรัฐบาลชอบธรรมแห่งเดียวในคาบสมุทรเกาหลี"
  },
  "ch_contemporary_03": {
    "title": "สงครามเกาหลี 25 มิถุนายน",
    "theory": "25 มิถุนายน ค.ศ. 1950 เกาหลีเหนือบุกรุกเกาหลีใต้โดยฉับพลัน\n\n• การปะทุของสงคราม (25 มิถุนายน ค.ศ. 1950): เกาหลีเหนือบุกรุกอย่างกะทันหัน, โซลแตกใน 3 วัน\n• การแทรกแซงของกองกำลังสหประชาชาติ: 16 ประเทศส่งทหาร, พลเอกแมกอาเธอร์เป็นผู้บัญชาการ\n• ยุทธการยกพลขึ้นบกอินชอน (15 กันยายน): ปฏิบัติการกระโดดข้ามของแมกอาเธอร์, ยึดโซลคืน, รุกขึ้นเหนือ\n• การแทรกแซงของกองทัพจีน (ตุลาคม ค.ศ. 1950): กองทัพอาสาสมัครจีน, ล่าถอยครั้งใหญ่ 4 มกราคม\n• การยื้อยุดที่เส้น 38: สงครามยืดเยื้อ, สงครามสนามเพลาะ\n• ข้อตกลงสงบศึก (27 กรกฎาคม ค.ศ. 1953): ลงนามที่พันมุนจอม, การแบ่งแยกใต้-เหนือถาวร\n• ความเสียหาย: เสียชีวิตหลายล้าน, ครอบครัวพลัดพราก, พื้นฐานเศรษฐกิจพังทลาย"
  },
  "ch_contemporary_04": {
    "title": "รัฐบาลอีซึงมันและการปฏิวัติ 19 เมษายน",
    "theory": "รัฐบาลอีซึงมันเน้นการต่อต้านคอมมิวนิสต์และการปกครองระยะยาว, สิ้นสุดโดยการปฏิวัติ 19 เมษายน\n\n• รัฐบาลที่ 1 (ค.ศ. 1948-1960): ประธานาธิบดีอีซึงมัน, ต่อต้านคอมมิวนิสต์, ปกครองอำนาจนิยม\n• การแก้ไขรัฐธรรมนูญ: การแก้ไขปัดเศษ (ค.ศ. 1954), เอาออกข้อจำกัดวาระ, การปกครองระยะยาว\n• การเลือกตั้งโกง 15 มีนาคม (ค.ศ. 1960): โกงร้ายแรง, ประท้วงที่มาซัน\n• การปฏิวัติ 19 เมษายน (ค.ศ. 1960): นักศึกษาและประชาชนลุกฮือ, การปฏิวัติประชาธิปไตย\n  - ศพคิมจูยอลลอยทะเล → ชนวนการปฏิวัติ\n  - การยิงใส่ผู้ประท้วงที่หน้าทำเนียบประธานาธิบดี → การลุกฮือทั่วประเทศ\n• การลาออกของอีซึงมัน: ลี้ภัยฮาวาย, รัฐบาลที่ 1 ล่มสลาย\n• ความหมาย: การปฏิวัติประชาธิปไตยที่ประชาชนนำ, รากฐานจิตวิญญาณประชาธิปไตย"
  },
  "ch_contemporary_05": {
    "title": "รัฐบาลบักจองฮี",
    "theory": "บักจองฮียึดอำนาจจากรัฐประหารทหารและปกครองระยะยาว\n\n• รัฐประหาร 16 พฤษภาคม (ค.ศ. 1961): รัฐประหารทหาร, สภาทหารปฏิวัติ, บักจองฮีนำ\n• รัฐบาลที่ 3 (ค.ศ. 1963-1972): ประธานาธิบดีจากการเลือกตั้ง, แผนพัฒนาเศรษฐกิจ 5 ปี, การฟื้นฟูความสัมพันธ์กับญี่ปุ่น, การส่งทหารไปเวียดนาม\n• รัฐธรรมนูญยูชิน (ค.ศ. 1972): รัฐบาลที่ 4, ประธานาธิบดีเลือกโดยสมาชิกสภาทงอิลจูแช\n• การพัฒนาเศรษฐกิจ: ปาฏิหาริย์แม่น้ำฮัน, การส่งออก, อุตสาหกรรมหนักและเคมี\n  - แซมาอึลอุนดง: ขบวนการพัฒนาชนบท, ขยันขันแข็ง-พึ่งตนเอง-ร่วมมือ\n• ความตึงเครียดกับประชาธิปไตย: จำกัดสิทธิพื้นฐาน, ปราบขบวนการประชาธิปไตย\n• เหตุการณ์ 26 ตุลาคม (ค.ศ. 1979): บักจองฮีถูกลอบสังหารโดยคิมแจกยู ผอ.สำนักข่าวกรอง"
  },
  "ch_contemporary_06": {
    "title": "รัฐบาลชอนดูฮวันและขบวนการประชาธิปไตย",
    "theory": "หลังเหตุการณ์ 26 ตุลาคม ชอนดูฮวันยึดอำนาจและปกครองทหาร\n\n• รัฐประหาร 12.12 (ค.ศ. 1979): ชอนดูฮวันยึดอำนาจกองทัพ, กบฏทหาร\n• ฤดูใบไม้ผลิโซล (ค.ศ. 1980): ความต้องการประชาธิปไตยเพิ่มขึ้น, ประท้วงทั่วประเทศ\n• ขบวนการประชาธิปไตยกวังจู 18 พฤษภาคม (ค.ศ. 1980): ต่อต้านกฎอัยการศึก, ปราบปรามอย่างรุนแรง, เสียชีวิตมาก\n  - ประชาชนจัดตั้งกองกำลังพลเมือง, ต่อต้าน 10 วัน\n  - ความหมาย: จุดเปลี่ยนขบวนการประชาธิปไตยเกาหลี, มรดกโลกยูเนสโก\n• รัฐบาลที่ 5 (ค.ศ. 1981-1988): ประธานาธิบดีชอนดูฮวัน, ปกครองทหาร, ปราบสื่อ\n• ขบวนการ 10 มิถุนายน (ค.ศ. 1987): ขบวนการประชาธิปไตยระดับชาติ, ประกาศ 29 มิถุนายน\n  - การประกาศ 29 มิถุนายน (โรแทอู): เลือกตั้งประธานาธิบดีโดยตรง, รับประกันเสรีภาพสื่อ\n• ความสำเร็จ: บรรลุการแก้ไขรัฐธรรมนูญเลือกตั้งโดยตรง"
  },
  "ch_contemporary_07": {
    "title": "การพัฒนาประชาธิปไตย",
    "theory": "หลังประกาศ 29 มิถุนายน ประชาธิปไตยเกาหลีพัฒนาอย่างต่อเนื่อง\n\n• รัฐบาลที่ 6 (ค.ศ. 1988-1993): ประธานาธิบดีโรแทอู, รัฐธรรมนูญเลือกตั้งโดยตรง, โอลิมปิกโซล\n• รัฐบาลพลเรือน (ค.ศ. 1993-1998): ประธานาธิบดีคิมยองซัม, สิ้นสุดการปกครองทหาร\n  - การปฏิรูปการเงิน (ระบบใช้ชื่อจริง), ต่อต้านคอร์รัปชัน, แก้ไขประวัติศาสตร์\n  - วิกฤตการเงิน IMF (ค.ศ. 1997): วิกฤตเศรษฐกิจ, ขอความช่วยเหลือ IMF\n• รัฐบาลประชาชน (ค.ศ. 1998-2003): ประธานาธิบดีคิมแดจุง, เปลี่ยนรัฐบาลสันติครั้งแรก\n  - เอาชนะ IMF, นโยบายแสงแดด, รางวัลโนเบลสันติภาพ, การประชุมสุดยอดใต้-เหนือ\n• รัฐบาลมีส่วนร่วม (ค.ศ. 2003-2008): ประธานาธิบดีโนมูฮยอน, เน้นการมีส่วนร่วม, การกระจายอำนาจ\n• รัฐบาลหลังนั้น: ลึกซึ้งในการรวมอนุรักษนิยม-ก้าวหน้า, ประชาธิปไตยแข็งแกร่ง"
  },
  "ch_contemporary_08": {
    "title": "การพัฒนาเศรษฐกิจและการเปลี่ยนแปลงสังคม",
    "theory": "หลังสงครามเกาหลี เศรษฐกิจและสังคมเกาหลีเปลี่ยนแปลงอย่างน่าทึ่ง\n\n• การพัฒนาเศรษฐกิจ:\n  - ทศวรรษ 1960-70: แผนพัฒนาเศรษฐกิจ 5 ปี, เศรษฐกิจส่งออก, อุตสาหกรรมหนักและเคมี\n  - ทศวรรษ 1980: อุตสาหกรรมไฮเทค, ผู้ผลิตเซมิคอนดักเตอร์ระดับโลก\n  - ทศวรรษ 1990: วิกฤตการเงิน, การปรับโครงสร้าง, การเติบโตเศรษฐกิจใหม่\n  - ทศวรรษ 2000 ขึ้นไป: เศรษฐกิจ IT, เศรษฐกิจสร้างสรรค์, ฮันรยู (กระแสเกาหลี)\n• การเปลี่ยนแปลงสังคม:\n  - การขยายตัวของเมือง: ประชากรรวมในเมือง, ปัญหาเมืองใหญ่\n  - การเปลี่ยนแปลงโครงสร้างครอบครัว: ครอบครัวเดี่ยว, อัตราเกิดต่ำ, สังคมผู้สูงอายุ\n  - การขยายตัวทางการศึกษา: อัตราเข้ามหาวิทยาลัยสูง, ปัญหาการศึกษาเอกชน\n  - การเปลี่ยนแปลงวัฒนธรรม: การแพร่กระจายวัฒนธรรมมวลชน, ฮันรยู, ความหลากหลายทางวัฒนธรรม"
  },
  "ch_contemporary_09": {
    "title": "การเปลี่ยนแปลงนโยบายรวมชาติ",
    "theory": "นโยบายรวมชาติของเกาหลีใต้เปลี่ยนแปลงตามยุคสมัย\n\n• รัฐบาลอีซึงมัน: รวมชาติโดยเดินหน้าไปเหนือ, ต่อต้านคอมมิวนิสต์\n• รัฐบาลบักจองฮี: \n  - แถลงการณ์ 4 กรกฎาคมใต้-เหนือ (ค.ศ. 1972): หลักการรวมชาติสันติ (เอกราช, สันติ, ความสามัคคีแห่งชาติ)\n  - นโยบายเผชิญหน้ากับเกาหลีเหนือ, เน้นความมั่นคง\n• รัฐบาลชอนดูฮวัน: เสนอสูตรรวมชาติประชาธิปไตยชาติ\n• รัฐบาลโรแทอู: ประกาศ 7.7, เข้าสหประชาชาติพร้อมกันใต้-เหนือ (ค.ศ. 1991)\n  - ข้อตกลงพื้นฐานใต้-เหนือ (ค.ศ. 1991): คำมั่นปรองดอง ไม่รุกราน แลกเปลี่ยนและร่วมมือ\n• รัฐบาลคิมยองซัม: ยืนยันชุมชนชาติ, วิกฤตนิวเคลียร์เกาหลีเหนือ\n• รัฐบาลคิมแดจุง: นโยบายแสงแดด, การประชุมสุดยอดใต้-เหนือ (ค.ศ. 2000)\n• รัฐบาลโนมูฮยอน: สืบทอดนโยบายแสงแดด, การประชุมสุดยอดครั้งที่ 2 (ค.ศ. 2007)\n• รัฐบาลหลังนั้น: ผสมผสานความเข้มงวดและยืดหยุ่น, ความร่วมมือนานาชาติ"
  },
  "ch_contemporary_10": {
    "title": "การเปลี่ยนแปลงของเกาหลีเหนือและความสัมพันธ์ใต้-เหนือ",
    "theory": "เกาหลีเหนือพัฒนาระบบเฉพาะของตนและความสัมพันธ์ใต้-เหนือเปลี่ยนแปลงซับซ้อน\n\n• ระบบเกาหลีเหนือ:\n  - อุดมการณ์จูเช: การพึ่งตนเอง, เอกราชทางการเมือง, พึ่งตนเองทางเศรษฐกิจ, ป้องกันตนเอง\n  - ระบบสืบทอด: คิมอิลซอง → คิมจองอิล → คิมจองอึน (สืบทอด 3 รุ่น)\n  - วิกฤตเศรษฐกิจ: ความอดอยากทศวรรษ 1990, พึ่งพาความช่วยเหลือภายนอก\n  - พัฒนานิวเคลียร์: ทดลองนิวเคลียร์, ทดสอบขีปนาวุธ, วิกฤตนานาชาติ\n• ความสัมพันธ์ใต้-เหนือ:\n  - ช่วงเผชิญหน้า: ความตึงเครียดทางทหาร, การก่อการร้าย, ความขัดแย้ง\n  - ช่วงสนทนา: การสนทนากาชาด, แลกเปลี่ยนกีฬา, การประชุมครอบครัวพลัดพราก\n  - ช่วงร่วมมือ: เขตท่องเที่ยวคึมกังซัน, เขตอุตสาหกรรมแกซอง, โครงการร่วมมือเศรษฐกิจ\n  - สถานการณ์ปัจจุบัน: นิวเคลียร์เกาหลีเหนือ, การคว่ำบาตรนานาชาติ, สนทนาและเผชิญหน้าซ้ำ\n• ความท้าทายด้านรวมชาติ: ลดช่องว่างใต้-เหนือ, สร้างความไว้วางใจ, เตรียมค่าใช้จ่ายรวมชาติ"
  }
}
