{
  "ch_prehistoric_01": {
    "title": "Эпоха палеолита",
    "theory": "Эпоха палеолита началась примерно 700 000 лет назад. Люди использовали оббитые каменные орудия (ручные рубила, чопперы) и жили в пещерах или шалашах у рек. Они занимались охотой и собирательством, вели групповой образ жизни.\n\n• Основные памятники: Чонгок-ри, Ёнчхон (ручные рубила ашельского типа), Сокчанни Конджу, Комынмору Сангвон, Турубон Чхонвон\n• Особенности: кочевой образ жизни, эгалитарное общество, использование огня"
  },
  "ch_prehistoric_02": {
    "title": "Эпоха неолита",
    "theory": "Эпоха неолита началась около 10 000 лет назад (примерно 8000 г. до н.э.). Люди использовали шлифованные каменные орудия и керамику с гребенчатым орнаментом. Появились земледелие и скотоводство, что привело к оседлому образу жизни в полуземлянках.\n\n• Основные памятники: Амса-дон (Сеул), Донгсам-дон (Пусан), Осан-ри (Янъян)\n• Верования: анимизм, тотемизм, шаманизм\n• Особенности: пряслица и костяные иглы (примитивное ткачество), раковинные кучи (пэчхон)"
  },
  "ch_prehistoric_03": {
    "title": "Бронзовый век",
    "theory": "Бронзовый век начался около 2000-1500 гг. до н.э. Бронза использовалась в основном для изготовления оружия и ритуальных предметов, а сельскохозяйственные орудия по-прежнему делались из камня (полулунные каменные ножи). Началось активное рисоводство, возникло социальное расслоение.\n\n• Керамика: гладкая керамика (мумун), керамика типа Мисонни\n• Бронзовые изделия: кинжал в форме лютни (бипхахён), зеркала с грубым орнаментом\n• Погребения: дольмены (столовый/шахматный тип), каменные ящики (тольнольмудом)\n• Общество: вождество (кунджан), идея избранного народа"
  },
  "ch_prehistoric_04": {
    "title": "Железный век",
    "theory": "Железный век начался примерно в V-IV веках до н.э. Железо использовалось для изготовления сельскохозяйственных орудий и оружия, что увеличило производительность сельского хозяйства и способствовало завоевательным войнам. Расширились связи с Китаем.\n\n• Железные изделия: железные сельскохозяйственные орудия (серпы, мотыги), железное оружие\n• Бронзовые изделия: узкий бронзовый кинжал (сехён), зеркала с тонким орнаментом (корейский стиль)\n• Погребения: деревянные гробы (нольмудом), погребения в сосудах (токмудом)\n• Изменения: появление китайских монет (мёндоджон, панрянджон), использование кисти для письма"
  },
  "ch_gojoseon_01": {
    "title": "Основание и развитие Древнего Чосона",
    "theory": "Древний Чосон (Кочосон) был основан в 2333 году до н.э. Тангуном Вангомом (согласно записям «Самгук юса»). Государство развивалось на основе бронзовой культуры в районе Ляонин и северной части Корейского полуострова.\n\n• Развитие: Чосон Тангуна → Чосон Киджа (легенда) → Чосон Вимана\n• Чосон Вимана: основан в 194 г. до н.э., когда Виман сверг вана Чуна\n• Расцвет: освоение железной культуры, посредническая торговля между Хань и Чин\n• Падение: 108 г. до н.э. — вторжение императора У-ди династии Хань, создание четырёх округов Хань"
  },
  "ch_gojoseon_02": {
    "title": "Общество и культура Древнего Чосона",
    "theory": "Древний Чосон поддерживал общественный порядок с помощью «Закона восьми статей» (Помгым пальчо). До наших дней дошли только три статьи.\n\n• Закон восьми статей (сохранившиеся положения):\n  - Убивший человека подлежит смертной казни\n  - Причинивший телесные повреждения возмещает ущерб зерном\n  - Вор становится рабом (или выкуп 500 000 монет)\n\n• Значение: уважение к жизни, защита частной собственности, ценность труда\n• Общество: классовое общество, существование уголовного обычного права"
  },
  "ch_gojoseon_03": {
    "title": "Развитие ранних государств",
    "theory": "После падения Древнего Чосона в Маньчжурии и на Корейском полуострове возникли различные государства.\n\n• Пуё: союз пяти племён, Ёнго (ритуал неба в 12-м месяце), погребение слуг с хозяином, «Закон одной статьи и двенадцати законов»\n• Когурё: союз пяти племён, Тонмэн (октябрьский праздник), соокче (зять живёт в доме жены)\n• Окчо: платили дань Когурё, минмёнурипжэ (обычай «невеста-ребёнок»), кольчжанпжэ (семейное захоронение)\n• Тонъе: Мучхон (октябрьский праздник), экзогамия, чхэкхва (компенсация за нарушение границ)\n• Самхан: Махан, Чинхан, Пёнхан; Содо (священная территория, чхонгун), праздники неба в 5-м и 10-м месяцах"
  },
  "ch_three_kingdoms_01": {
    "title": "Основание и развитие Когурё",
    "theory": "Когурё было основано в 37 г. до н.э. Чумоном в Чольбоне. Государство развивалось в горных районах бассейна реки Амноккан (Ялу) и стало завоевательной державой.\n\n• Тхэджо-ван: завоевание Окчо, попытки продвижения в Ляодун\n• Когукчхон-ван: закон чиндэ (помощь бедным), упорядочение системы пяти бу\n• Тончхон-ван: кризис из-за вторжения вэйского полководца Гуаньцю Цзяня\n• Особенности: совет чега, кёндан (образование молодёжи), соокче"
  },
  "ch_three_kingdoms_02": {
    "title": "Расцвет Когурё",
    "theory": "В IV-V веках Когурё превратилось в могущественную державу Восточной Азии.\n\n• Сосурим-ван: принятие буддизма (372), основание Тхэхак, издание законов\n• Квангэтхо Тэван: расширение территории (Маньчжурия, север Корейского полуострова), помощь Силла (отражение набегов вэ)\n• Чансу-ван: перенос столицы в Пхеньян (427), политика продвижения на юг, захват бассейна реки Ханган\n• Стела Квангэтхо: летопись Когурё, находится в Цзилине, Маньчжурия\n• Максимальная территория: от Маньчжурии до центра Корейского полуострова (до Чхунджу)"
  },
  "ch_three_kingdoms_03": {
    "title": "Внешние войны и падение Когурё",
    "theory": "В VI-VII веках Когурё сражалось против вторжений Суй и Тан.\n\n• Ыльчи Мундок: битва при Сальсу (612), разгром 300-тысячной армии императора Ян-ди династии Суй\n• Ён Кэсомун: строительство Чхоллиджансон (Великой стены), отражение атаки Тай-цзуна (битва при Ансисон, 645)\n• Внешние войны: отражение 4 вторжений Суй, 3 вторжений Тан\n• Падение: 668 г. — поражение от объединённых сил Силла и Тан\n• Причины: раскол правящего класса, борьба за власть после смерти Ён Кэсомуна"
  },
  "ch_three_kingdoms_04": {
    "title": "Основание и развитие Пэкче",
    "theory": "Пэкче было основано в 18 г. до н.э. Онджо в Вирёсон (бассейн реки Ханган). Государство развивалось на основе бассейна Хангана.\n\n• Кои-ван: упорядочение системы рангов и форменной одежды, издание законов, учреждение 6 чвапхён\n• Кынчхого-ван: объединение Махана, нападение на Когурё (гибель Когуквон-вана)\n• Территория: продвижение в Ляоси, Шаньдун, Кюсю (меч Чхильджидо)\n• Особенности: развитие морской торговли, контакты с южными китайскими династиями"
  },
  "ch_three_kingdoms_05": {
    "title": "Расцвет и возрождение Пэкче",
    "theory": "В IV веке при Кынчхого-ване наступил расцвет, но затем государство ослабло под давлением Когурё с севера.\n\n• Кынчхого-ван: завоевание Махана, контроль над провинциями Хванхэ и Чолла, дарение меча Чхильджидо Японии\n• Кэро-ван: падение Хансона (475), гибель от рук Чансу-вана Когурё\n• Перенос столицы в Унджин (475): переезд в Конджу\n• Мурён-ван: возрождение, назначение 22 тамно (местных чиновников), связи с Лян\n• Сон-ван: перенос столицы в Саби (538), переименование государства в Намбуё, попытка вернуть бассейн Хангана (гибель в битве при Квансансон)"
  },
  "ch_three_kingdoms_06": {
    "title": "Движение за возрождение и падение Пэкче",
    "theory": "В VII веке Пэкче пало под ударами объединённых сил Силла и Тан.\n\n• Ыйджа-ван: атаки на Силла (захват Тэясона), политический хаос в конце правления\n• Падение: 660 г. — падение Сабисона под ударами войск Силла и Тан (Ким Юсин, Су Динфан)\n• Движение за возрождение: во главе с Поксином, Точхимом, Хыкчхи Санджи, при поддержке Японии\n• Битва при Пэккане (663): поражение японского флота, крах движения за возрождение\n• Значение: часть беженцев из Пэкче переселилась в Японию и Силла, распространение культуры"
  },
  "ch_three_kingdoms_07": {
    "title": "Основание и развитие Силла",
    "theory": "Силла было основано в 57 г. до н.э. Пак Хёккосе в Саро (Кёнджу). Из трёх государств развивалось позже всех.\n\n• Нэмуль-ван: установление наследственной власти рода Ким, титул «марипкан»\n• Попхын-ван: официальное признание буддизма (мученичество Ичхадона), издание законов, упорядочение системы кольпхум, присоединение Кымгван Кая\n• Чинхын-ван: реорганизация хваран, захват бассейна Хангана, завоевание равнины Хамхын и Тэгая\n• Памятные стелы: Пукхансанби, Чханнёнби, Маунрёнби, Хванчхорёнби"
  },
  "ch_three_kingdoms_08": {
    "title": "Расцвет Силла и объединение Трёх государств",
    "theory": "В VII веке Силла в союзе с Тан объединило Три государства.\n\n• Сондок-ёван: строительство Чхомсондэ, девятиярусная пагода храма Хванъюнса\n• Тхэджон Муёль-ван (Ким Чхунчху): первый ван из сословия чинголь, союз с Тан\n• Мунму-ван: после падения Пэкче (660) и Когурё (668) изгнание войск Тан\n• Война Силла-Тан: победы при Мэсосоне и Кибольпхо (676), изгнание Тан\n• Значение: объединение территории к югу от линии Тэдонган — Вонсан, основа национальной культуры"
  },
  "ch_three_kingdoms_09": {
    "title": "Образование и развитие Кая",
    "theory": "Кая — конфедерация государств в бассейне реки Нактонган. Процветала благодаря производству железа и морской торговле.\n\n• Ранняя Кая: центр в Кымгван Кая (Кимхэ), наследница Пёнхана\n• Поздняя Кая: центр в Тэгая (Корён), расцвет в V-VI веках\n• Особенности: экспорт железа (в Японию, Наннан), конфедерация (не удалось объединиться)\n• Падение: Кымгван Кая (532, Попхын-ван), Тэгая (562, Чинхын-ван)\n• Культура: каягым, железные доспехи, обычай погребения слуг"
  },
  "ch_three_kingdoms_10": {
    "title": "Буддизм и философия Трёх государств",
    "theory": "Буддизм способствовал укреплению королевской власти и объединению государства.\n\n• Когурё: 372 г. — монах Сундо из Цянь Цинь (при Сосурим-ване)\n• Пэкче: 384 г. — монах Маранантха из Восточной Цзинь (при Чхимню-ване)\n• Силла: 527 г. — официальное признание после мученичества Ичхадона (при Попхын-ване)\n• Особенности: государственный буддизм, принятие на государственном уровне"
  },
  "ch_three_kingdoms_11": {
    "title": "Курганы и памятники Трёх государств",
    "theory": "Курганы Трёх государств отражают культурные особенности каждого из них.\n\n• Когурё: каменные курганы → гробницы со сводчатой камерой, Мучхонтхон, Какчхочхон, Ссанъёнчхон (фрески)\n• Пэкче: гробницы со сводчатой камерой, гробница Мурён-вана (кирпичная), изображения четырёх духов-хранителей\n• Силла: курганы с деревянной камерой и каменной насыпью (Чхонмачхон, Хваннамтэчхон), находки золотых корон\n• Объединённое Силла: гробницы со сводчатой камерой (влияние кремации)\n• Пархэ: гробница принцессы Чонхё (сводчатая камера), наследие Когурё"
  },
  "ch_three_kingdoms_12": {
    "title": "Искусство и технологии Трёх государств",
    "theory": "Три государства развили самобытное искусство и научные технологии.\n\n• Когурё: фрески гробниц (четыре духа-хранителя), сцены охоты в Мучхонтхоне\n• Пэкче: позолоченная бронзовая курильница, скальный рельеф Сосан, каменная пагода Мирыкса\n• Силла: Чхомсондэ (древнейшая обсерватория Востока), девятиярусная пагода Хванъюнса, золотые короны\n• Наука: астрономические наблюдения, использование календаря, развитие кораблестроения\n• Передача в Японию: Атики и Вани (иероглифы, конфуцианство), Тамджин (бумага, тушь, краски)"
  },
  "ch_north_south_states_01": {
    "title": "Политика Объединённого Силла",
    "theory": "Объединённое Силла установило сильную королевскую власть и централизованную систему управления.\n\n• Синмун-ван: отмена ногып (кормлений), введение кваллёджон (служебных наделов), основание Кукхак (государственного училища), система 9 чу и 5 согён\n• Система управления: Чипсабу (высшее ведомство), Сандэтын (глава аристократии)\n• Провинции: 9 чу 5 согён, весаджон (инспекторы), хян и пугок (особые административные районы)\n• Армия: 9 содан (столичные войска), 10 чон (провинциальные войска)\n• Поздний период: борьба за престол, рост местных хочжок (豪族), недовольство 6-го ранга тупхум"
  },
  "ch_north_south_states_02": {
    "title": "Экономика Объединённого Силла",
    "theory": "Экономика Объединённого Силла развивалась благодаря расширению территории.\n\n• Земельная система: кваллёджон (право сбора налогов для чиновников), чонджон (земля для крестьян)\n• Минджон мунсо: перепись населения, земель и скота в деревнях (каждые 3 года), обнаружен в Сёсоин, Япония\n• Торговля: восточный и западный рынки Кёнджу, международные порты (Чхонхэджин, Ульсан)\n• Чан Бого: основал Чхонхэджин (828), контролировал морские пути, посредническая торговля Тан — Силла — Япония\n• Ремёсла: обработка золота и серебра, ткачество шёлка"
  },
  "ch_north_south_states_03": {
    "title": "Общество Объединённого Силла",
    "theory": "Объединённое Силла было сословным обществом, основанным на системе кольпхум.\n\n• Кольпхум: сонголь → чинголь → 6–1 тупхум, ограничения в чинах и повседневной жизни\n• Чинголь: высшая аристократия, право на престол, ниже 5 тупхум — ограничения в чинах\n• 6 тупхум: продвижение через науку и религию, студенты в Тан, критически мыслящая интеллигенция\n• Смута позднего периода: борьба за престол, раскол чинголь, недовольство 6 тупхум\n• Рост хочжок: самостоятельное усиление местных сил, основа для образования Поздних трёх государств"
  },
  "ch_north_south_states_04": {
    "title": "Культура Объединённого Силла",
    "theory": "Объединённое Силла объединило культуру Трёх государств и развило национальную культуру.\n\n• Буддизм: школа Хваом (Ыйсан), развитие Кёджон (доктринальных школ), распространение Сон (чань) в поздний период\n• Вонхё: учение хваджон (примирения противоречий), популяризация буддизма, песня Муэга\n• Архитектура: храм Пульгукса, грот Соккурам (главная статуя Будды), пагоды Таботхап и Соккатхап\n• Колокола: Колокол великого короля Сондок (Эмилле), колокол храма Санвонса\n• Литература: хянга (Чхоёнга, Чемангмэга), Сольчхон (систематизация иду)"
  },
  "ch_north_south_states_05": {
    "title": "Основание и политика Пархэ",
    "theory": "Пархэ было основано в 698 году Тэ Чоёном на горе Тонмосан. Государство создали беженцы из Когурё совместно с мохэ.\n\n• Тэ Чоён: выходец из военной знати Когурё, основал государство после победы над Тан\n• Му-ван: противостояние с Тан, атака Чан Мунхю на Шаньдунский полуостров\n• Мун-ван: мирные отношения с Тан, перенос столицы в Санъгён, упорядочение системы 3 сон 6 бу\n• Сон-ван: максимальная территория, титул «Хэдон сонгук» (Процветающее государство к востоку от моря)\n• Падение: 926 г. — завоёвано киданями"
  },
  "ch_north_south_states_06": {
    "title": "Общество и культура Пархэ",
    "theory": "Пархэ унаследовало культуру Когурё и испытало влияние Тан.\n\n• Управление: система 3 сон 6 бу (по образцу Тан), провинции — 5 столиц, 15 бу, 62 чу\n• Наследие Когурё: ондоль (отопление пола), каменные фонари, парные статуи Будды, структура гробницы принцессы Чонхё\n• Влияние Тан: Чуджагам (конфуцианское образование), участие в экзаменах пингонгва\n• Внешние связи: контакты с Тан, Силла, Японией; Силладо (торговый путь)\n• Культурное наследие: руины Санъгён Ёнчхонбу, гробницы принцесс Чонхе и Чонхё"
  },
  "ch_goryeo_01": {
    "title": "Основание Корё и система управления",
    "theory": "В 918 году Ван Гон сверг Кунъе и основал государство Корё. Объединил Поздние три государства (936) и интегрировал хочжок (местную знать).\n\n• Интеграция хочжок: брачная политика (29 жён), политика дарования фамилий, система киин, система сасимгван\n• Хунё сипчо: 10 заветов для будущих королей\n• Система управления: 2 сон (Чунсо мунхасон и Сансосон), 6 бу, Чунчхувон, Самса\n• Топёнмаса и Сикмок тогам: уникальные органы Корё\n• Провинции: 5 то и 2 кё, хян, пугок, со (особые административные районы)"
  },
  "ch_goryeo_02": {
    "title": "Становление и кризис аристократического общества",
    "theory": "В ранний период Корё обществом управляла родовая аристократия (мунболь квиджок).\n\n• Родовая аристократия: монополия на должности через кваго (экзамены) и ымсо (наследование), наследование конымджон\n• Мятеж Ли Чжагёма (1126): попытка внешней родни захватить власть\n• Мятеж Мёчхона (1135): требование переноса столицы в Согён и провозглашения императорского титула, подавлен Ким Бусиком\n• Особенности: формирование кланов вроде Кёнвон Ли, закрытые браки\n• Кризис: ослабление королевской власти, усиление дискриминации военных"
  },
  "ch_goryeo_03": {
    "title": "Установление и развитие военного режима",
    "theory": "В 1170 году Чон Чунбу и другие подняли военный мятеж, установив военный режим.\n\n• Причины: неправление Ыйджона, дискриминация военных (инцидент в Похёнвоне)\n• Развитие: Чон Чунбу → Кён Тэсын → Ли Ыймин → Чхве Чхунхон\n• Режим Чхве: Кёджон тогам (высший орган власти), Самбёльчхо (личная армия), Чонбан (кадровые назначения)\n• Восстания крестьян и рабов: восстание Манджока, восстание Мани и Мансои\n• Итог: ослабление королевской власти, монополия военных на власть"
  },
  "ch_goryeo_04": {
    "title": "Сопротивление монголам и Самбёльчхо",
    "theory": "В XIII веке Корё сопротивлялось вторжениям монголов (Юань).\n\n• Перенос столицы на Канхвадо (1232): решимость военного режима сопротивляться, 39 лет борьбы\n• Народное сопротивление: Чхоинсон (Ким Юнху), Чхунджусон, Квиджусон\n• Пхальман Тэджангён: Трипитака Кореана, создана с молитвой об изгнании монголов\n• Возвращение в Кэгён (1270): Вонджон, крах военного режима\n• Сопротивление Самбёльчхо: Пэ Чунсон, Чиндо → Чеджудо, подавлено в 1273 году"
  },
  "ch_goryeo_05": {
    "title": "Период юаньского влияния и квонмун сечжок",
    "theory": "В период юаньского влияния (1270–1356) Корё подвергалось вмешательству Юань во внутренние дела.\n\n• Вмешательство: учреждение Чондон хэнсон, назначение даругачи, требование гунё (дев) и ынбан (соколиной охоты)\n• Королевский дом: браки с юаньскими принцессами, короли росли в Юань\n• Понижение титулов: ван → Чхунъёль-ван, пхеха → чонха, 6 бу → 4 са\n• Квонмун сечжок: проюаньская знать, крупные землевладельцы, контроль над Топхёнъыйсаса\n• Социальные изменения: мода на монгольский стиль, появление хлопка и пороха"
  },
  "ch_goryeo_06": {
    "title": "Реформы Конмин-вана и новые конфуцианцы",
    "theory": "Конмин-ван (1351–1374) проводил антиюаньскую политику и укреплял королевскую власть.\n\n• Антиюаньская политика: упразднение Чондон хэнсон, освобождение Ссансон чхонгванбу, отказ от юаньских девизов и титулов\n• Внутренние реформы: Чонмин бёнджон тогам (возврат земель квонмун сечжок), назначение Синдона\n• Синджин садэбу: выходцы из экзаменов, неоконфуцианство, критика квонмун сечжок\n• Ограничения: набеги хунгончок и вэгу, политический хаос после устранения Синдона\n• Ли Сонге: поворот на Вихвадо (1388), союз с синджин садэбу"
  },
  "ch_goryeo_07": {
    "title": "Экономика Корё",
    "theory": "Корё развивало аграрную экономику и международную торговлю.\n\n• Земельная система: чонсигва (право сбора налогов для чиновников и военных), конымджон (наследование для 5-го ранга и выше)\n• Сельское хозяйство: двухполье-трёхполье, развитие удобрений, Нонсан чипё (китайский агрономический трактат)\n• Торговля: рынки Кэгёна, Пённандо (международный порт), тэсикгугин (арабские купцы)\n• Ремёсла: казённые мастерские, со (специализированные производства)\n• Деньги: Конвон чунбо, ынбён (серебряные слитки), слабое обращение"
  },
  "ch_goryeo_08": {
    "title": "Сословная система и общество Корё",
    "theory": "Корё было сословным обществом: аристократия, средний слой, свободные, рабы.\n\n• Аристократия: родовая знать, квонмун сечжок, монополия через экзамены и ымсо\n• Средний слой: хянни (местная администрация), намбан (военное сословие), сори\n• Свободные: крестьяне (пэкчон), налоги, подати и повинности\n• Рабы: ноби (принцип «дитя рабыни — раб»), жители хян, пугок, со\n• Особенности: относительно высокий статус женщин, повторный брак аристократок возможен"
  },
  "ch_goryeo_09": {
    "title": "Буддизм в Корё",
    "theory": "Буддизм был государственной религией Корё и влиял на всё общество.\n\n• Государственный буддизм: Ёндынхве и Пхальгванхве (государственные праздники), монашеские экзамены\n• Школы: Кёджон (Хваом, Попсан), Сонджон (Чогечжон)\n• Ыйчхон: основал школу Чхонтхэ, кёгван кёмсу (совмещение учёности и созерцания), составление Сокчжангён\n• Чинуль: реформировал Чогечжон, чонхе ссансу (параллельное развитие сосредоточения и мудрости), тоно чомсу (внезапное просветление, постепенное совершенствование), община Сусонса\n• Трипитака: Чходжо Тэджангён (против киданей), Пхальман Тэджангён (против монголов)"
  },
  "ch_goryeo_10": {
    "title": "Конфуцианство и исторические труды Корё",
    "theory": "В поздний период Корё неоконфуцианство стало идейной основой синджин садэбу.\n\n• Конфуцианство: Кукчагам (высшее учебное заведение), система кваго\n• Неоконфуцианство: введено Ан Хяном (при Чхунъёль-ване), продолжено Пэк Иджоном, Ли Чехёном, Ли Сэком, Чон Монджу\n• Исторические труды: Самгук саги (Ким Бусик, древнейшая сохранившаяся история, конфуцианский подход)\n• Самгук юса (Ирён), Чеван унги (Ли Сынхю): записи о Тангуне, национальное самосознание\n• Чхильдэ силлок: не сохранились"
  },
  "ch_goryeo_11": {
    "title": "Наука и книгопечатание в Корё",
    "theory": "Корё обладало передовыми технологиями книгопечатания и металлообработки мирового уровня.\n\n• Книгопечатание: Пхальман Тэджангён (крупнейший сохранившийся ксилограф), Чикчи симчхё ёджоль (древнейшая сохранившаяся книга, напечатанная металлическим шрифтом)\n• Инкрустированный селадон: расцвет в XII веке, уникальная техника Корё\n• Компас: развитие навигации\n• Порох: Чхве Мусон, учреждение Хватхон тогам, отражение набегов вэгу\n• Прочее: астрономические наблюдения, изучение календаря, развитие медицины"
  },
  "ch_goryeo_12": {
    "title": "Искусство Корё",
    "theory": "Корё развило самобытное искусство на основе буддийской и аристократической культуры.\n\n• Селадон: чистый селадон → инкрустированный селадон (XII в.), ваза мэбён с инкрустацией облаков и журавлей\n• Буддийская живопись: яркие цвета, Кванъгён бёнсандо\n• Архитектура: стиль чусимпхо (зал Кынаккджон храма Понджонса, зал Мурянсуджон храма Пусокса)\n• Каменные пагоды: разнообразные стили (восьмигранная девятиярусная пагода храма Вольджонса, десятиярусная пагода Кёнчхонса)\n• Ремёсла: техника серебряной инкрустации, лаковые изделия с перламутром"
  },
  "ch_joseon_early_01": {
    "title": "Основание Чосон и система управления",
    "theory": "В 1392 году Ли Сонге основал государство Чосон. Неоконфуцианство стало государственной идеологией.\n\n• Основание: поворот на Вихвадо (1388) → введение квачжонпоп → основание Чосон\n• Тхэджо: перенос столицы в Ханъян, строительство дворца Кёнбоккун\n• Тхэджон: система прямого подчинения 6 чо, упразднение частных армий, закон о хопхэ (удостоверениях)\n• Система управления: Ыйджонбу и 6 чо, Самса (Сахонбу, Саганвон, Хонмунгван)\n• Провинции: 8 то, назначение кванчхальса и сурён, контроль над хянни"
  },
  "ch_joseon_early_02": {
    "title": "Политика от Седжона до Сонджона",
    "theory": "Ранние короли Чосон укрепили конфуцианское правление и развили культуру.\n\n• Седжон: Чипхёнджон, хунмин чоным (корейский алфавит), освоение 4 крепостей и 6 гарнизонов, система Ыйджонбу сосадже\n• Седжо: упразднение Чипхёнджона, система прямого подчинения 6 чо, начало составления Кёнгук тэджон\n• Сонджон: завершение и обнародование Кёнгук тэджон, учреждение Хонмунгвана, привлечение сарим\n• Направление правления: баланс королевской и министерской власти\n• Чипхёнджон: научно-исследовательское учреждение Седжона"
  },
  "ch_joseon_early_03": {
    "title": "Рост сарим и литературные чистки",
    "theory": "После Сонджона сарим укрепились, но столкновения с хунгу привели к литературным чисткам.\n\n• Сарим: последователи Ким Чонджика, опора на деревни, совоны и хянъяк, акцент на дохак (道學)\n• Хунгу: приближённые Седжо, контроль над центральным правительством\n• 4 великие чистки: Муо (1498), Капча (1504), Кимё (1519), Ыльса (1545)\n• Чистка Муо: «Чоыйджемун» Ким Чонджика, Ёнсан-гун\n• Чистка Кимё: реформы Чо Кванджо (хёллянгва, упразднение Согёксо), Чунджон"
  },
  "ch_joseon_early_04": {
    "title": "Начало фракционной политики",
    "theory": "При Сонджо сарим пришли к власти, и началась фракционная политика.\n\n• Формирование фракций: вопрос назначения Иджо чонран, тонъин (Ким Хёвон) и соин (Сим Ыйгём)\n• Раскол тонъин: мятеж Чон Ёрипа → намин (умеренные) и пугин (радикальные)\n• Соин: линия Ли И и Сон Хона, регион Кихо\n• Тонъин: линия Ли Хвана, регион Ённам\n• Особенности: основа на учёных и земляческих связях, взаимная критика и контроль, важность общественного мнения"
  },
  "ch_joseon_early_05": {
    "title": "Имджинская война",
    "theory": "В 1592 году Япония вторглась в Чосон, началась Имджинская война (Имджин вэран).\n\n• Причина: амбиции Тоётоми Хидэёси завоевать континент\n• Начало: падение Пусанджина и Тоннэсона, взятие Хансона за 20 дней\n• Флот: подвиги Ли Сунсина (победы при Хансандо и Мённяне)\n• Ополчение: Квак Чэу, Чо Хон, Ко Гённён, монахи Сосан тэса и Самён тэса\n• Итоги: разорение страны, сокращение населения, разграбление культурных ценностей, развитие японской культуры"
  },
  "ch_joseon_early_06": {
    "title": "Маньчжурское вторжение и теория северного похода",
    "theory": "В 1636 году Цин вторглась в Чосон — началась война Пёнджа хоран.\n\n• Чонмё хоран (1627): вторжение Поздней Цзинь, заключение «братских» отношений\n• Пёнджа хоран (1636): вторжение Цин, оборона в крепости Намхансансон, унижение у Самджондо\n• Итоги: вассальные отношения с Цин, наследники Сохён сэджа и Понним тэгун в заложниках, стела Самджондо\n• Пукпольлон: Хёджон и Сон Сиёль, призыв к походу против Цин, не реализован\n• Влияние: антицинские настроения, пуккакнон (теория заимствования у Цин)"
  },
  "ch_joseon_early_07": {
    "title": "Экономика раннего Чосон",
    "theory": "В ранний период Чосон сформировалась аграрная экономическая система.\n\n• Земельная система: квачжонпоп (земли Кёнги), чикчонпоп (Седжо), квансугвангыпче (Сонджон)\n• Сельское хозяйство: Нонса чиксоль (Седжон), система ёнбун кутынпоп и чонбун юктынпоп, двухполье-трёхполье\n• Торговля: сиджон (Чонно), надзор Кёнсисо, слабое обращение чохва и Чосон тхонбо\n• Ремёсла: преобладание казённого ремесла, регистрация ремесленников\n• Горное дело: добыча серебра и меди, выплавка золота и серебра"
  },
  "ch_joseon_early_08": {
    "title": "Сословная система и общество раннего Чосон",
    "theory": "Чосон было сословным обществом: янбан, чунъин, янъин, чхонмин.\n\n• Янбан: гражданские и военные чиновники, экзамены кваго и ымсо, освобождение от повинностей\n• Чунъин: технические чиновники (переводчики, врачи, счетоводы), соль (незаконнорождённые)\n• Янъин: крестьяне, торговцы, ремесленники, налоги и повинности\n• Чхонмин: ноби (принцип «дитя рабыни — раб»), пэкчон, актёры и др.\n• Семья: усиление патрилинейности, составление чокпо (родословных), распространение чонпоп (законов о наследовании)"
  },
  "ch_joseon_early_09": {
    "title": "Неоконфуцианство и образование в раннем Чосон",
    "theory": "Неоконфуцианство было государственной идеологией и социальной нормой Чосон.\n\n• Неоконфуцианство: теория ли-ци (дуализм Ли Хвана, монизм Ли И)\n• Учебные заведения: Сонгюнгван (высшее образование), 4 хак (среднее), хянгё (провинциальные)\n• Совоны: образовательные учреждения сарим, Пэгундон совон Чу Себуна (первый)\n• Экзамены: мунгва, мугва, чапква; сэнвон и чинса (малые экзамены)\n• Ритуалистика: Карё (Чуджа карё), распространение обрядов кванхонсандже"
  },
  "ch_joseon_early_10": {
    "title": "Исторические и географические труды раннего Чосон",
    "theory": "Чосон проводило масштабные государственные издательские проекты.\n\n• Исторические труды: Чосон ванджо силлок (ЮНЕСКО), Корёса, Корёса чорё\n• Географические труды: Тонгук ёджи сынрам, Синджын тонгук ёджи сынрам\n• Своды законов: Кёнгук тэджон (Сонджон), Тэджон соннок, Тэджон хусоннок\n• Ритуальные книги: Кукчо орёый (от Седжона до Сонджона)\n• Агрономические труды: Нонса чиксоль (Седжон)"
  },
  "ch_joseon_early_11": {
    "title": "Наука и технологии раннего Чосон",
    "theory": "Эпоха Седжона стала золотым веком науки и техники.\n\n• Астрономия: хончхоный, каный, анбуильгу, чагённу (Чан Ёнсиль)\n• Дождемер: первый в мире прибор для измерения осадков\n• Книгопечатание: шрифты кемиджа и капинджа (металлический шрифт), Седжон\n• Карты: Хонильганни ёктэгук тоджидо (древнейшая сохранившаяся карта мира)\n• Медицина: Хянъяк чипсонбан (Седжон), Ыйбан ючхви, Тоный погам (Кванхэгун)"
  },
  "ch_joseon_early_12": {
    "title": "Искусство раннего Чосон",
    "theory": "В раннем Чосон неоконфуцианские идеалы отразились в искусстве.\n\n• Живопись: Ан Гён (Монъю товондо), Кан Хиан, развитие литературной живописи\n• Керамика: пунчхон саги → белый фарфор (XVI в.), простота и сдержанность\n• Архитектура: конфуцианские постройки (дворцы, Чонмё), ворота Сунъемун, дворец Кёнбоккун\n• Музыка: упорядочение аак (Пак Ён), нотация чонганбо (Седжон)\n• Ремёсла: деревянные изделия, лаковые изделия с перламутром"
  },
  "ch_joseon_late_01": {
    "title": "Вырождение фракционной политики",
    "theory": "Во второй половине XVII века фракционная политика выродилась в однопартийный деспотизм.\n\n• Споры о трауре (есон): вопрос о сроке траура после смерти Хёджона, соин против намин\n• Кёнсин хвангук (1680): падение намин, приход к власти соин\n• Киса хвангук (1689): падение соин, приход к власти намин, казнь Сон Сиёля\n• Капсуль хвангук (1694): падение намин, приход к власти соин (норон и сорон)\n• Итог: утрата взаимного контроля, однопартийный деспотизм"
  },
  "ch_joseon_late_02": {
    "title": "Политика тхангпхён",
    "theory": "Ёнджо и Чонджо проводили политику тхангпхён для преодоления пороков фракционности.\n\n• Ёнджо: умеренный тхангпхён (назначение умеренных), ослабление полномочий Иджо чонран, закон кюнёкпоп\n• Чонджо: строгий тхангпхён (по способностям), создание Кюджангак, Чанъённён, крепость Хвасон в Сувоне\n• Реформы Чонджо: система чхогё мунсин, допуск соль к должностям, отмена привилегий сиджон (Синхэ тхонгон)\n• Ограничения: рост влияния сэдо семей, основа для вмешательства внешней родни\n• Значение: укрепление королевской власти, культурное возрождение"
  },
  "ch_joseon_late_03": {
    "title": "Политика сэдо",
    "theory": "После Сунджо внешние семьи монополизировали власть — наступила эпоха политики сэдо.\n\n• Семьи сэдо: Андон Ким (Сунджо), Пхунъян Чо (Хонджон, Чхольджон)\n• Хаос «трёх управлений»: чонджон (земельный налог), кунджон (воинская повинность), хвангок (зерновые ссуды)\n• Крестьянские восстания: восстание Хон Гённэ (1811), крестьянское восстание Имсуль (1862, Чинджу)\n• Социальные волнения: распространение пиги и точхамсоль (пророчеств), частые бунты\n• Итог: ослабление королевской власти, упадок государственной дисциплины, задержка модернизации"
  },
  "ch_joseon_late_04": {
    "title": "Экономические изменения позднего Чосон",
    "theory": "В позднем Чосон развилась товарно-денежная экономика.\n\n• Сельское хозяйство: распространение иянпоп (пересадки рассады), кванджак (крупные хозяйства), товарные культуры (табак, женьшень, хлопок)\n• Ремёсла: приватизация, система сондэдже (снабжение сырьём купцами)\n• Торговля: сасан (торговцы вне сиджон), сонсан, мансан, кэсон санин, пятидневные рынки\n• Деньги: общегосударственное обращение санпхён тхонбо (при Сукчоне)\n• Горное дело: система сольджом сусэдже (частное управление рудниками)"
  },
  "ch_joseon_late_05": {
    "title": "Расшатывание сословной системы в позднем Чосон",
    "theory": "В позднем Чосон сословная система расшатывалась, происходили социальные изменения.\n\n• Янбан: рост числа обедневших янбан, хянбан и чанбан\n• Чунъин: движение за повышение статуса, требование права на ёкква (экзамены для переводчиков), движение сочхон\n• Соль: требование хотхон (допуска к должностям), назначение в кёмсогваны Кюджангака\n• Крестьяне: повышение статуса через напсок и конмёнчхоп (покупка должностей)\n• Ноби: освобождение казённых рабов (Сунджо, 1801), сокращение числа рабов"
  },
  "ch_joseon_late_06": {
    "title": "Развитие сирхак",
    "theory": "В XVII–XVIII веках развилось учение сирхак, направленное на социальные реформы.\n\n• Школа кёнсе чхиёнъ (аграрная): Ю Хёнвон (Пангё сурок), Ли Ик (Сонхо сасоль), Чон Ягён (Мокмин симсо, Кёнсе юпхё)\n• Школа иён хусэнъ (торговая): Ю Сувон, Пак Чивон (Ёрха ильги), Пак Чега (Пуккаккы), Хон Дэён\n• Чон Ягён: кочжунги (подъёмный кран для Хвасона), ёджонджё и чонджонджё, Мокмин симсо\n• Влияние: укрепление государства, стабильность жизни народа, формирование современного сознания\n• Ограничения: не принято правящим классом"
  },
  "ch_joseon_late_07": {
    "title": "Развитие национальных исследований",
    "theory": "В позднем Чосон возрос интерес к национальной культуре и истории.\n\n• Изучение языка: Син Гёнджун (Хунмин чонъым унхэ), Ю Хи (Онмунджи)\n• Исторические труды: Ан Джонбок (Тонса канмок), Ли Гыник (Ёллёсиль кисуль), Хан Чхиюн (Хэдон ёкса)\n• Географические труды: Чон Санги (Тонгук чидо), Ким Джонхо (Тэдон ёджидо)\n• Энциклопедии: Ли Ик (Сонхо сасоль), Ли Докму (Чхонджангван чонсо)\n• Особенности: эмпирический и объективный подход, поиск национальной идентичности"
  },
  "ch_joseon_late_08": {
    "title": "Развитие народной культуры",
    "theory": "В позднем Чосон благодаря росту благосостояния простого народа развилась массовая культура.\n\n• Литература: романы на хангыле (Хон Гильдон чон, Чхунхян чон), пхансори, сасоль сиджо\n• Живопись: жанровая живопись (Ким Хондо, Син Юнбок), минхва (народная живопись), чингён сансухва (Чон Сон)\n• Представления: тхальчхум (танец в масках Понсан), пхансори, кукольный театр\n• Особенности: сатира на янбан, критика реальности, юмор\n• Ким Джонхи: почерк Чхуса, картина Сехандо (литературная живопись)"
  },
  "ch_joseon_late_09": {
    "title": "Наука и технологии позднего Чосон",
    "theory": "В позднем Чосон под влиянием сирхак развивались наука и техника.\n\n• Картография: Чон Санги (Тонгук чидо, масштаб 100 ри), Ким Джонхо (Тэдон ёджидо, ксилография)\n• Медицина: Хо Джун (Тоный погам), Чон Ягён (Магва хветхонъ)\n• Астрономия: Хон Дэён (теория вращения Земли), восприятие западной астрономии\n• Сельское хозяйство: Пак Седанъ (Сэккён), инновации в агротехнике\n• Техника: кочжунги (Чон Ягён), водяное колесо (предложено школой пуккак)"
  },
  "ch_joseon_late_10": {
    "title": "Появление новых религий",
    "theory": "В позднем Чосон появились новые религии и учения.\n\n• Католицизм: пришёл как «западное учение» в XVII в., крещение Ли Сынхуна (1784), гонения Синхэ и Кихэ\n• Тонхак: основано Чхве Чеу в 1860 г., инэчхон (человек есть небо), антифеодализм и антииностранщина\n• Пророческие учения: Чонгамнок, распространение пиги и точхамсоль\n• Вера в Майтрейю: народные чаяния спасения\n• Особенности: критика социальных противоречий, идеи равенства"
  },
  "ch_modern_01": {
    "title": "Реформы Хынсон Тэвонгуна",
    "theory": "Хынсон Тэвонгун проводил реформы для укрепления королевской власти и стабилизации жизни народа.\n\n• Укрепление королевской власти: реконструкция дворца Кёнбоккун, упразднение Пибёнса, восстановление Самгунбу\n• Свержение политики сэдо: изгнание клана Андон Ким, назначение талантов\n• Реформа «трёх управлений»: хопходже (военный налог на янбан), сачханчже (замена хвангок)\n• Закрытие совонов: оставлено лишь 47, отмена налоговых и трудовых привилегий\n• Отказ от торговли и дипломатии: Пёнъин янъё (1866), Синми янъё (1871), стелы чхокхваби"
  },
  "ch_modern_02": {
    "title": "Открытие портов и неравноправные договоры",
    "theory": "В 1876 году по Канхвадоскому договору Чосон открыло порты.\n\n• Инцидент с «Унъё» (1875): японский военный корабль вторгся к Канхвадо\n• Канхвадоский договор (1876): первый современный договор, неравноправный\n  - Открытие Пусана, Вонсана, Инчхона; экстерриториальность; право на съёмку побережья\n• Корейско-американский договор (1882): статус наибольшего благоприятствования, посредничество\n• Затем договоры с Британией, Германией, Россией, Францией\n• Влияние: начало модернизации и экономической эксплуатации"
  },
  "ch_modern_03": {
    "title": "Движение за просвещение и виджон чхокса",
    "theory": "После открытия портов столкнулись кэхвапха (реформаторы) и виджон чхокса (консерваторы).\n\n• Кэхвапха: открытие границ, принятие западной культуры, модернизация\n  - Умеренные реформаторы (тондо соги): Ким Хонджип, О Юнджун\n  - Радикальные реформаторы (мунмён кэхва): Ким Оккюн, Пак Ёнхё, Хон Ёнсик\n• Виджон чхокса: защита неоконфуцианства, отпор иностранцам\n  - Ли Ханно, Ки Джонджин, Чхве Икхён (теория «японцы и западники едины»)\n• Тхонни кимуамун: орган проведения реформаторской политики"
  },
  "ch_modern_04": {
    "title": "Мятеж Имо и переворот Капсин",
    "theory": "В 1880-х годах Чосон переживало политические потрясения.\n\n• Мятеж Имо (1882): восстание старых войск, возвращение Тэвонгуна к власти\n  - Вмешательство Цин, похищение Тэвонгуна в Китай, Чемульпхоский договор\n• Переворот Капсин (1884): переворот радикальных реформаторов, программа из 14 пунктов\n  - «Три дня у власти», провал из-за вмешательства Цин, эмиграция Ким Оккюна\n• Итог: усиление вмешательства Цин, идея нейтрализации Кореи\n• Хансонский и Тяньцзиньский договоры: баланс сил Японии и Цин"
  },
  "ch_modern_05": {
    "title": "Крестьянское движение тонхак",
    "theory": "В 1894 году крестьянская армия тонхак подняла антифеодальное и антииностранное восстание.\n\n• Предпосылки: хаос «трёх управлений», японская экономическая эксплуатация, движение за реабилитацию основателя\n• 1-е восстание: мятеж в Кобу (Чон Бонджун), победы при Хванъгохёне и Хваннён-чхоне\n• Чонджуское перемирие: 12 пунктов реформ, создание чипкансо\n• 2-е восстание: протест против захвата японцами Кёнбоккуна, поражение при Угымчхи\n• Значение: антифеодализм и антиимпериализм, влияние на реформы Капо"
  },
  "ch_modern_06": {
    "title": "Реформы Капо и Ыльми",
    "theory": "В 1894–1896 годах проводились современные реформы.\n\n• Реформы Капо (1894): Кунгук кимучхо, отмена экзаменов кваго, отмена сословной системы\n  - Серебряный стандарт, унификация мер и весов, учреждение судов\n• Реформы Ыльми (1895): григорианский календарь, указ о стрижке волос, начальные школы\n• Инцидент Ыльми (1895): убийство императрицы Мин японцами\n• Агван пхачхон (1896): бегство Коджона в русскую миссию\n• Ограничения: японское руководство, народное сопротивление (ополчение Ыльми)"
  },
  "ch_modern_07": {
    "title": "Общество независимости и Корейская империя",
    "theory": "Во второй половине 1890-х развернулось движение за независимость и модернизацию.\n\n• Общество независимости (1896): Со Джэпхиль, газета «Тоннип синмун», Арка независимости\n  - Манмин кондонхве, движение за парламент, «6 статей Хоный»\n• Корейская империя (1897): Коджон провозглашён императором, реформы Кванму\n  - Кубонсинчхам (новое на основе старого)\n  - Земельная перепись, выдача чигё (документов на землю), создание Вонсубу\n• Ограничения: консервативные реформы, усиление давления держав"
  },
  "ch_modern_08": {
    "title": "Антияпонское движение ыйбён",
    "theory": "После открытия портов против японской агрессии развернулось движение ыйбён (ополчения).\n\n• Ыйбён Ыльми (1895): протест против указа о стрижке волос и убийства императрицы, конфуцианские учёные\n  - Ю Инсок, Ли Соын и другие\n• Ыйбён Ыльса (1905): протест против договора Ыльса, Мин Чонсик, Чхве Икхён\n• Ыйбён Чонми (1907): протест против роспуска армии, присоединение бывших солдат\n  - Армия 13 провинций (Ли Инён), поход на Сеул\n• Ограничения: ослаблено японской карательной операцией на юге (1909)"
  },
  "ch_modern_09": {
    "title": "Патриотическое просветительское движение",
    "theory": "Развернулось движение за восстановление суверенитета через развитие сил нации.\n\n• Организации: Поанхве (противодействие японскому освоению пустошей), Хонджон ёнгухве, Тэхан чаганхве\n• Синминхве (1907): Ан Чхангхо, Ян Гитхак, тайное общество, курс на республику\n  - Школы Осан и Тэсон, издательство Тхэгык согван, керамическая компания\n• Образование: основание частных школ, национальное образование\n• Пресса: «Хвансон синмун», «Тэхан мэиль синбо» (Бетэл), движение за погашение госдолга\n• Ограничения: акцент на развитие сил, японские репрессии"
  },
  "ch_modern_10": {
    "title": "Утрата национального суверенитета",
    "theory": "Япония поэтапно лишала Корею суверенитета.\n\n• Договор Ыльса (1905): лишение дипломатических прав, учреждение Генерального резидентства (Ито Хиробуми)\n• Гаагская миссия (1907): Ли Джун, Ли Сансоль, Ли Виджон; принудительное отречение Коджона\n• Договор Чонми (1907): лишение внутренних полномочий, роспуск армии\n• Меморандум Киюу (1909): лишение судебной и полицейской власти\n• Аннексия Кореи (29.08.1910): договор о присоединении, утрата суверенитета\n• Сопротивление: Ан Джунгын застрелил Ито Хиробуми (1909)"
  },
  "ch_japanese_occupation_01": {
    "title": "Военное правление 1910-х годов",
    "theory": "В 1910-х годах Япония установила военное правление с опорой на жандармскую полицию.\n\n• Генерал-губернаторство Кореи: генерал-губернатор (генерал армии или флота), законодательная, судебная и исполнительная власть\n• Жандармская полиция: право суммарного наказания (телесные наказания), слежка за корейцами\n• Земельная перепись (1910–1918): система регистрации, конфискация незарегистрированных земель\n  - Создание Восточно-колониальной компании, рост числа японских землевладельцев\n• Закон о компаниях: разрешительная система, подавление роста национального капитала\n• Образование: политика оглупления, ограничение преподавания корейского языка"
  },
  "ch_japanese_occupation_02": {
    "title": "Культурное правление 1920-х годов",
    "theory": "После Первомартовского движения Япония ввела «культурное правление» (обманчивая политика смягчения).\n\n• Обычная полиция: отмена жандармской полиции, но фактическое увеличение численности и оснащения\n• Пресса и собрания: разрешение «Чосон ильбо» и «Тона ильбо» (цензура), деятельность Общества корейского языка\n• Образование: разрешение университетов (Кёнсон, 1924), расширение начальных школ\n• План увеличения производства риса: рост урожая → экспорт в Японию, нехватка продовольствия в Корее\n• Ограничения: воспитание коллаборационистов, раскол нации"
  },
  "ch_japanese_occupation_03": {
    "title": "Политика уничтожения нации 1930–40-х годов",
    "theory": "С 1930-х годов Япония проводила политику уничтожения корейской нации для ведения войны.\n\n• Японизация: присяга подданных императора, принудительное поклонение в синтоистских храмах, поклоны в сторону дворца\n• Уничтожение культуры: запрет корейского языка, репрессии против Общества корейского языка (1942)\n• Смена имён (1940): принуждение к японским именам\n• Людские ресурсы: добровольцы → воинская повинность, студенты-добровольцы, трудовая мобилизация\n• Эксплуатация женщин: принудительная мобилизация «женщин для утешения» японской армии\n• Материальные ресурсы: система реквизиции, принудительный сбор металла"
  },
  "ch_japanese_occupation_04": {
    "title": "Первомартовское движение",
    "theory": "Первомартовское движение 1919 года стало крупнейшим национальным движением периода японской оккупации.\n\n• Предпосылки: принцип самоопределения наций Вильсона, Декларация независимости 8 февраля (Токио), слухи об отравлении Коджона\n• Ход событий: 1 марта, парк Тхапколь, чтение Декларации независимости, демонстрации «Мансэ»\n  - От студентов и верующих → все слои общества по всей стране, распространение за рубеж (Кандо, Приморье)\n• Японские репрессии: резня в Чеамни, поджог крепости Хвасон в Сувоне\n• Значение: создание Временного правительства, переход от ненасилия к вооружённой борьбе\n• Влияние: Движение 4 мая в Китае, ненасильственное движение в Индии"
  },
  "ch_japanese_occupation_05": {
    "title": "Временное правительство Республики Корея",
    "theory": "В 1919 году в Шанхае было создано Временное правительство Республики Корея.\n\n• Создание: Шанхай (объединённое временное правительство), демократическая республика, президент Ли Сынман\n• Деятельность: система ёнтхонджё и кётхонгук, газета «Тоннип синмун», архивное бюро\n• Кризис: импичмент Ли Сынмана, раскол на Национальном представительном конгрессе (1923)\n• Руководство Ким Гу: Корейский патриотический отряд, теракт Юн Бонгиля (1932)\n• Переезд в Чунцин (1940): создание Корейской освободительной армии, объявление войны Японии\n• Значение: центр движения за независимость, традиция демократической республики"
  },
  "ch_japanese_occupation_06": {
    "title": "Борьба Ыйёльдана и Корейский патриотический отряд",
    "theory": "С 1920-х годов развернулась индивидуальная борьба ыйёль (праведная ярость).\n\n• Ыйёльдан (1919): Ким Вонбон, Син Чхэхо («Декларация корейской революции»), вооружённая борьба\n  - Пак Джэхёк (полицейское управление Пусана), Ким Иксан (Генерал-губернаторство), На Сокчу (Восточно-колониальная компания)\n• Корейский патриотический отряд (1931): организован Ким Гу, спецоперации\n  - Ли Бончхан: бросил бомбу в японского императора (1932, неудачно)\n  - Юн Бонгиль: теракт в парке Хункоу в Шанхае (1932), ликвидация японских генералов\n• Значение: демонстрация воли к независимости, повод для поддержки Китая"
  },
  "ch_japanese_occupation_07": {
    "title": "Вооружённая борьба за независимость",
    "theory": "С 1920-х годов в Маньчжурии и Китае велась вооружённая борьба за независимость.\n\n• Бой при Понъодоне (1920): Хон Бомдо, Армия независимости Кореи, разгром японских войск\n• Победа при Чхонсанни (1920): Ким Чваджин, Северный штаб, крупнейшая победа\n• Резня в Кандо (1920): массовое убийство корейцев японскими войсками\n• Трагедия в Свободном (1921): гибель бойцов от рук Красной Армии\n• Объединение трёх штабов: Чхамыйбу, Чонъыйбу, Синминбу → Кунминбу, Хёксин ыйхве\n• Корейская освободительная армия (1940): подчинена временному правительству, подготовка операции в Корее"
  },
  "ch_japanese_occupation_08": {
    "title": "Социально-экономическое национальное движение",
    "theory": "В период японской оккупации развивались различные социально-экономические национальные движения.\n\n• Движение за поощрение отечественных товаров (1920): Чо Мансик, «Моё хозяйство — моими товарами»\n• Движение за создание национального университета (1922): Ли Санджэ, сбор средств, противодействие Японии\n• Крестьянское движение: арендные споры (забастовка на острове Амтхэ)\n• Рабочее движение: всеобщая забастовка в Вонсане (1929), Корейская федерация труда\n• Синганхве (1927): единая национальная партия, левоправое сотрудничество, поддержка Кванджуского студенческого движения"
  },
  "ch_japanese_occupation_09": {
    "title": "Движение за сохранение национальной культуры",
    "theory": "В период японской оккупации продолжались усилия по сохранению национальной культуры и идентичности.\n\n• Изучение языка: Общество корейского языка (Единые правила орфографии хангыля, стандартный язык), учреждение Дня хангыля\n• Изучение истории: Пак Ынсик («История страданий Кореи»), Син Чхэхо («Древняя история Чосона»), националистическая историография\n• Движение за национальные исследования: Чон Инбо (чосонхак), Мун Ильпхён, Ан Джэхон\n• Образование: национальные частные школы (Осан, Тэсон), движение вечерних школ\n• Религия: Чхондогё, Тэджонгё, Вонбульгё, воспитание национального сознания"
  },
  "ch_japanese_occupation_10": {
    "title": "Деятельность зарубежной диаспоры",
    "theory": "В период японской оккупации зарубежные корейцы также участвовали в борьбе за независимость.\n\n• Маньчжурия: Западное Кандо (Кёнхакса, Синхын военная школа), Северное Кандо (Мёндон, резня в Кандо)\n• Приморье: Квонопхве, Правительство Армии освобождения Кореи, трагедия в Свободном\n• США: Корейская национальная ассоциация, Пак Ёнман (военное обучение), Ли Сынман (дипломатия)\n• Гавайи: работа на сахарных плантациях, финансирование независимости\n• Япония: Декларация независимости 8 февраля, студенческое движение"
  },
  "ch_contemporary_01": {
    "title": "Освобождение и раздел",
    "theory": "15 августа 1945 года наступило освобождение, но Корейский полуостров был разделён.\n\n• Освобождение: безоговорочная капитуляция Японии, плод борьбы за независимость\n• Раздел: разделение по 38-й параллели, оккупация США и СССР\n• Комитет подготовки государства: Ё Унхён, провозглашение Народной республики (не признана американской военной администрацией)\n• Московское совещание министров иностранных дел (1945): создание временного правительства, 5-летняя опека\n  - Сторонники опеки (левые) против противников (правые)\n• Совместная советско-американская комиссия: провал, передача в ООН"
  },
  "ch_contemporary_02": {
    "title": "Создание правительства Республики Корея",
    "theory": "В 1948 году было создано правительство Республики Корея.\n\n• Резолюция ООН: всеобщие выборы пропорционально населению, отказ СССР\n• Переговоры Север-Юг (1948): Ким Гу и Ким Гюсик, визит в Пхеньян, неудача\n• Выборы 10 мая (1948): под наблюдением ООН, формирование Учредительного собрания\n• Конституция: демократическая республика, президентская + парламентская система\n• Создание правительства (15.08.1948): Ли Сынман — первый президент\n• Признание ООН: единственное законное правительство на полуострове"
  },
  "ch_contemporary_03": {
    "title": "Корейская война",
    "theory": "25 июня 1950 года началась война в результате вторжения Северной Кореи.\n\n• Предпосылки: объявление линии Ачесона, подготовка Севера к войне\n• Ход событий: вторжение Севера → оборона на Нактонгане → Инчхонская десантная операция → освобождение Сеула\n  → продвижение к Ялу → вступление китайских войск → отступление 4 января → тупик на 38-й параллели\n• Перемирие (27.07.1953): Пханмунджом, состояние перемирия сохраняется\n• Потери: миллионы погибших, 10 миллионов разделённых семей, разрушение страны\n• Последствия: усиление антикоммунистической идеологии, закрепление раздела"
  },
  "ch_contemporary_04": {
    "title": "Правительство Ли Сынмана и Апрельская революция",
    "theory": "Против длительного правления Ли Сынмана вспыхнула Апрельская революция.\n\n• Правительство Ли Сынмана: антикоммунизм, поправка Пальчхве (1952), поправка Сасаоип (1954)\n• Фальсифицированные выборы 15 марта (1960): подтасовка Либеральной партией\n• Революция 19 апреля: протесты в Масане → обнаружение тела Ким Джуёля → распространение по стране\n  - Требования демократизации от студентов и граждан, военное положение, демонстрация профессоров\n• Итог: отставка Ли Сынмана, временное правительство Хо Джона, Вторая республика (кабинет Чан Мёна)\n• Значение: демократическое движение студентов и граждан, первая демократическая революция"
  },
  "ch_contemporary_05": {
    "title": "Правительство Пак Чонхи",
    "theory": "В 1961 году в результате военного переворота было создано правительство Пак Чонхи.\n\n• Военный переворот 16 мая (1961): захват власти военными, Высший совет национальной реконструкции\n• Третья республика (1963): президентская система, пятилетние планы экономического развития\n• Корейско-японский договор (1965): нормализация отношений, протесты 3 июня\n• Режим Юсин (1972): октябрьская реформа, чрезвычайные полномочия, Национальное собрание по объединению\n• Восстание Пума (1979): протесты в Пусане и Масане\n• Инцидент 26 октября (1979): убийство Пак Чонхи"
  },
  "ch_contemporary_06": {
    "title": "Правительство Чон Духвана и демократическое движение",
    "theory": "В 1980 году новые военные во главе с Чон Духваном захватили власть.\n\n• Инцидент 12 декабря (1979): новые военные Чон Духвана, захват военной власти\n• Движение за демократизацию 18 мая (1980): Кванджу, протест против расширения военного положения, формирование гражданского ополчения\n  - Жестокое подавление, сотни жертв\n• Пятая республика: непрямые президентские выборы, один 7-летний срок\n• Июньское восстание (1987): требования отмены Хохон и прямых выборов, гибель Ли Ханёля\n• Декларация 29 июня: принятие прямых выборов, Но Тхэу\n• Значение: решающий поворот к демократизации"
  },
  "ch_contemporary_07": {
    "title": "Развитие демократии",
    "theory": "После 1987 года демократия развивалась, происходила мирная смена власти.\n\n• Шестая республика (1988): прямые президентские выборы, один 5-летний срок\n• Правительство Но Тхэу: северная дипломатия, отношения с СССР и Китаем, одновременное вступление в ООН (1991)\n• Правительство Ким Ёнсама: гражданское правительство, финансовая прозрачность, исправление истории, кризис МВФ\n• Правительство Ким Дэджуна: первая мирная смена власти, межкорейский саммит (2000), Декларация 15 июня\n• Далее: демократические выборы, расширение прав человека и свободы прессы"
  },
  "ch_contemporary_08": {
    "title": "Экономическое развитие и социальные изменения",
    "theory": "Республика Корея пережила стремительный экономический рост и социальные изменения.\n\n• Экономическое развитие: 1–4-й пятилетние планы (1962–1981)\n  - Лёгкая промышленность → тяжёлая и химическая, экспортно-ориентированный рост\n• «Чудо на реке Хан»: от страны-получателя помощи к стране-донору, вступление в ОЭСР (1996)\n• Кризис МВФ (1997): валютный кризис, реструктуризация, преодоление\n• Социальные изменения: урбанизация, нуклеарная семья, старение, IT-держава\n• Культура: Халлю (K-POP, дорамы, кино), мировое признание"
  },
  "ch_contemporary_09": {
    "title": "Изменения политики объединения",
    "theory": "Политика объединения правительства Республики Корея менялась со временем.\n\n• Ли Сынман: теория объединения путём похода на Север (силовое объединение)\n• Пак Чонхи: Совместное заявление Севера и Юга 4 июля (1972), самостоятельность, мир, национальное единство\n• Чон Духван: встреча разделённых семей Севера и Юга (1985)\n• Но Тхэу: северная дипломатия, Базовое соглашение Север-Юг (1991)\n• Ким Дэджун: политика «солнечного тепла», туризм на Кымгансан, первый межкорейский саммит (2000)\n• Далее: Кэсонский промышленный комплекс, второй и третий саммиты"
  },
  "ch_contemporary_10": {
    "title": "Изменения в Северной Корее и межкорейские отношения",
    "theory": "После раздела режим Северной Кореи и межкорейские отношения менялись.\n\n• Режим Северной Кореи: Ким Ир Сен → Ким Чен Ир → Ким Чен Ын, наследственная власть в трёх поколениях\n  - Идеи чучхе, политика сонгун (приоритет армии), ядерная программа\n• Межкорейские отношения: конфронтация (1950–1970) → диалог (1970–) → примирение и сотрудничество (1990–)\n  - Чередование напряжённости и разрядки\n• Основные события: теракт в Рангуне (1983), «Чхонан» (2010), Ёнпхёндо (2010)\n• Межкорейские обмены: встречи разделённых семей, туризм на Кымгансан, Кэсонский комплекс\n• Задачи: установление мира, подготовка к объединению, национальное примирение"
  }
}
