{
  "ch_prehistoric_01": {
    "title": "Thời kỳ Đồ đá cũ",
    "theory": "Thời kỳ Đồ đá cũ bắt đầu từ khoảng 700.000 năm trước. Người nguyên thủy sử dụng công cụ đá ghè (rìu tay, công cụ chặt) và sống trong hang động hoặc lều ven sông. Họ sinh sống bằng săn bắn và hái lượm theo từng nhóm.\n\n• Di tích tiêu biểu: Jeongok-ri, Yeoncheon (rìu tay kiểu Acheulean), Seokjang-ri Gongju, Geomeunmoru Sangwon, Durubong Cheongwon\n• Đặc điểm: Đời sống du cư, xã hội bình đẳng, sử dụng lửa"
  },
  "ch_prehistoric_02": {
    "title": "Thời kỳ Đồ đá mới",
    "theory": "Thời kỳ Đồ đá mới bắt đầu từ khoảng 10.000 năm trước (khoảng 8000 TCN). Người nguyên thủy sử dụng công cụ đá mài và đồ gốm hoa văn răng lược. Nông nghiệp và chăn nuôi bắt đầu xuất hiện, dẫn đến đời sống định cư trong các nhà hầm.\n\n• Di tích tiêu biểu: Amsa-dong Seoul, Dongsam-dong Busan, Osan-ri Yangyang\n• Tín ngưỡng: Vật linh giáo (Animism), Tô tem giáo (Totemism), Sa man giáo (Shamanism)\n• Đặc điểm: Xa quay và kim xương (dệt thủ công), bãi vỏ sò (paechong)"
  },
  "ch_prehistoric_03": {
    "title": "Thời kỳ Đồ đồng",
    "theory": "Thời kỳ Đồ đồng bắt đầu vào khoảng 2000-1500 TCN. Đồ đồng chủ yếu được dùng làm vũ khí và dụng cụ nghi lễ, trong khi nông cụ vẫn là đồ đá (dao đá hình bán nguyệt). Nghề trồng lúa nước phát triển mạnh và xã hội bắt đầu phân chia giai cấp.\n\n• Đồ gốm: Gốm trơn (Mumun), gốm kiểu Misong-ri\n• Đồ đồng: Kiếm đồng hình đàn tỳ bà (Bipahyeong), gương đồng hoa văn thô\n• Mộ táng: Mộ đá (Goindol) kiểu bàn/kiểu bàn cờ, mộ đá hộp (Dolnolmudoom)\n• Xã hội: Xã hội tù trưởng (Gunjang), tư tưởng dân tộc được chọn"
  },
  "ch_prehistoric_04": {
    "title": "Thời kỳ Đồ sắt",
    "theory": "Thời kỳ Đồ sắt bắt đầu vào khoảng thế kỷ 5-4 TCN. Đồ sắt được sử dụng làm nông cụ và vũ khí, giúp tăng năng suất nông nghiệp và thúc đẩy chiến tranh chinh phục. Giao lưu với Trung Quốc được mở rộng.\n\n• Đồ sắt: Nông cụ sắt (liềm sắt, cuốc sắt), vũ khí sắt\n• Đồ đồng: Kiếm đồng thon (Sehyeong), gương đồng hoa văn tinh xảo (phong cách Hàn Quốc)\n• Mộ táng: Mộ gỗ (Neolmudoom), mộ vò (Dokmudoom)\n• Thay đổi: Tiền Trung Quốc (Myeongdojeon, Banryangjeon) du nhập, sử dụng bút lông"
  },
  "ch_gojoseon_01": {
    "title": "Sự thành lập và phát triển của Gojoseon",
    "theory": "Gojoseon (Cổ Triều Tiên) được thành lập năm 2333 TCN bởi Dangun Wanggeom (theo ghi chép trong Samguk Yusa). Dựa trên nền văn hóa đồ đồng, quốc gia này phát triển ở vùng Liêu Ninh và phía bắc bán đảo Triều Tiên.\n\n• Phát triển: Dangun Joseon → Gija Joseon (truyền thuyết) → Wiman Joseon\n• Wiman Joseon: Năm 194 TCN, Wiman lật đổ vua Jun và lập nước\n• Thời kỳ thịnh vượng: Tiếp nhận văn hóa đồ sắt, buôn bán trung gian giữa nhà Hán và Trung Nguyên\n• Diệt vong: Năm 108 TCN bị Hán Vũ Đế xâm lược, thiết lập Tứ quận Hán"
  },
  "ch_gojoseon_02": {
    "title": "Xã hội và văn hóa Gojoseon",
    "theory": "Gojoseon duy trì trật tự xã hội bằng Luật 8 điều (Beomgeum 8 jo). Hiện chỉ còn 3 điều được truyền lại.\n\n• Luật 8 điều (nội dung còn lại):\n  - Người giết người bị xử tử hình\n  - Người gây thương tích cho người khác phải bồi thường bằng ngũ cốc\n  - Kẻ trộm cắp bị biến thành nô lệ (hoặc nộp tiền chuộc 500.000 đồng)\n\n• Ý nghĩa: Tôn trọng sinh mạng, bảo vệ tài sản tư nhân, coi trọng lao động\n• Xã hội: Xã hội phân cấp, tồn tại luật tục hình sự"
  },
  "ch_gojoseon_03": {
    "title": "Sự phát triển của các quốc gia",
    "theory": "Sau khi Gojoseon diệt vong, nhiều quốc gia phát triển ở Mãn Châu và bán đảo Triều Tiên.\n\n• Buyeo (Phù Dư): Liên minh 5 bộ tộc, lễ Yeonggo (tháng 12), tục tuẫn táng, Luật 1 trách 12 điều\n• Goguryeo (Cao Câu Ly): Liên minh 5 bộ tộc, lễ Dongmaeng (tháng 10), chế độ Seook (ở rể)\n• Okjeo (Ốc Trư): Cống nạp cho Goguryeo, tục Minmyeoneuri (con dâu nhỏ), Goljangje (mộ gia đình)\n• Dongye (Đông Uế): Lễ Mucheon (tháng 10), hôn nhân ngoại tộc, Chaekhwa (bồi thường khi xâm phạm ranh giới)\n• Samhan (Tam Hàn): Mahan, Jinhan, Byeonhan, Sodo (vùng đất thiêng), lễ tế trời tháng 5 và 10"
  },
  "ch_three_kingdoms_01": {
    "title": "Sự thành lập và phát triển của Goguryeo",
    "theory": "Goguryeo (Cao Câu Ly) được thành lập năm 37 TCN bởi Jumong tại Jolbon. Quốc gia này phát triển từ vùng núi ven sông Áp Lục và trở thành một cường quốc chinh phạt.\n\n• Vua Taejo: Chinh phục Okjeo, thử tiến vào Liêu Đông\n• Vua Gogukcheon: Luật Jindae (cứu trợ người nghèo), củng cố hệ thống 5 bộ\n• Vua Dongcheon: Khủng hoảng do Guanqiujian của nước Ngụy xâm lược\n• Đặc điểm: Hội nghị Jega, Gyeongdang (giáo dục thanh niên), chế độ Seook"
  },
  "ch_three_kingdoms_02": {
    "title": "Thời kỳ hoàng kim của Goguryeo",
    "theory": "Thế kỷ 4-5, Goguryeo phát triển thành cường quốc Đông Á.\n\n• Vua Sosurim: Tiếp nhận Phật giáo (372), thành lập Thái học, ban hành luật lệ\n• Vua Gwanggaeto Đại đế: Mở rộng lãnh thổ (Mãn Châu, bắc bán đảo), hỗ trợ Silla (đánh đuổi Oa khấu)\n• Vua Jangsu: Dời đô về Bình Nhưỡng (427), chính sách Nam tiến, chiếm lưu vực sông Hán\n• Bia Gwanggaeto Đại đế: Ghi chép lịch sử Goguryeo, tọa lạc tại Cát Lâm, Mãn Châu\n• Lãnh thổ cực đại: Từ Mãn Châu đến trung bộ bán đảo (Chungju)"
  },
  "ch_three_kingdoms_03": {
    "title": "Cuộc kháng chiến đối ngoại và sự diệt vong của Goguryeo",
    "theory": "Thế kỷ 6-7, Goguryeo chống lại sự xâm lược của nhà Tùy và Đường.\n\n• Eulji Mundeok: Trận Salsu (612), đánh bại 300.000 quân của Tùy Dạng Đế\n• Yeon Gaesomun: Xây Trường thành nghìn dặm, đánh bại Đường Thái Tông (Trận Ansi, 645)\n• Kháng chiến đối ngoại: Đẩy lùi 4 lần xâm lược của Tùy, 3 lần của Đường\n• Diệt vong: Năm 668 bị liên quân Silla-Đường tiêu diệt\n• Nguyên nhân: Tầng lớp thống trị phân hóa, tranh giành quyền lực sau khi Yeon Gaesomun qua đời"
  },
  "ch_three_kingdoms_04": {
    "title": "Sự thành lập và phát triển của Baekje",
    "theory": "Baekje (Bách Tế) được thành lập năm 18 TCN bởi Onjo tại Wiryeseong (lưu vực sông Hán). Quốc gia phát triển dựa trên lưu vực sông Hán.\n\n• Vua Goi: Củng cố chế độ quan đẳng và quan phục, ban hành luật lệ, 6 Jwapyeong\n• Vua Geunchogo: Thống nhất Mahan, tấn công Goguryeo (vua Gogugwon tử trận)\n• Lãnh thổ: Tiến vào Liêu Tây, Sơn Đông, Kyushu (thanh kiếm Chilji)\n• Đặc điểm: Phát triển thương mại hàng hải, giao lưu với Nam triều"
  },
  "ch_three_kingdoms_05": {
    "title": "Thời kỳ hoàng kim và phục hưng của Baekje",
    "theory": "Thế kỷ 4 dưới thời vua Geunchogo là thời kỳ hoàng kim, nhưng sau đó suy yếu do Goguryeo Nam tiến.\n\n• Vua Geunchogo: Chinh phục Mahan, chiếm Hwanghae-do và Jeolla-do, ban tặng kiếm Chilji cho Nhật Bản\n• Vua Gaero: Hanseong thất thủ (475), tử trận trước vua Jangsu của Goguryeo\n• Dời đô về Ungjin (475): Chuyển thủ đô đến Gongju\n• Vua Muryeong: Phục hưng, phái 22 Damno (quan địa phương), giao lưu với nhà Lương\n• Vua Seong: Dời đô về Sabi (538), đổi quốc hiệu thành Nambuyeo, cố gắng chiếm lại lưu vực sông Hán (tử trận tại Gwansanseong)"
  },
  "ch_three_kingdoms_06": {
    "title": "Phong trào phục hưng và sự diệt vong của Baekje",
    "theory": "Thế kỷ 7, Baekje bị liên quân Silla-Đường tiêu diệt.\n\n• Vua Uija: Tấn công Silla (chiếm Daeyaseong), cuối đời chính trị rối loạn\n• Diệt vong: Năm 660 thành Sabi thất thủ trước liên quân Silla-Đường (Kim Yusin, So Jeongbang)\n• Phong trào phục hưng: Do Boksin, Dochim, Heukchi Sangji lãnh đạo, được Nhật Bản hỗ trợ\n• Trận Baekgang (663): Hải quân Nhật Bản thất bại, phong trào phục hưng thất bại\n• Ý nghĩa: Một số di dân Baekje di cư sang Nhật Bản và Silla, truyền bá văn hóa"
  },
  "ch_three_kingdoms_07": {
    "title": "Sự thành lập và phát triển của Silla",
    "theory": "Silla (Tân La) được thành lập năm 57 TCN bởi Bak Hyeokgeose tại Saroguk (Gyeongju). Là nước phát triển muộn nhất trong Tam Quốc.\n\n• Vua Naemul: Xác lập ngôi vua cha truyền con nối họ Kim, xưng hiệu Maripgan\n• Vua Beopheung: Công nhận Phật giáo (Ichadon tuẫn đạo), ban hành luật lệ, củng cố chế độ Golpum, sáp nhập Geumgwan Gaya\n• Vua Jinheung: Cải tổ Hwarangdo, chiếm lưu vực sông Hán, chinh phục đồng bằng Hamheung và Đại Gaya\n• Bia Sunsu: Bia Bukhansan, bia Changnyeong, bia Maunryeong, bia Hwangchoryeong"
  },
  "ch_three_kingdoms_08": {
    "title": "Thời kỳ hoàng kim và thống nhất Tam Quốc của Silla",
    "theory": "Thế kỷ 7, Silla liên minh với nhà Đường thống nhất Tam Quốc.\n\n• Nữ vương Seondeok: Xây Cheomseongdae, tháp gỗ 9 tầng Hwangnyongsa\n• Vua Taejong Muyeol (Kim Chunchu): Vị vua Jingol đầu tiên, liên minh với nhà Đường\n• Vua Munmu: Sau khi Baekje (660) và Goguryeo (668) diệt vong, đuổi quân Đường\n• Chiến tranh Silla-Đường: Đánh bại nhà Đường tại trận Maeso-seong và Gibeolpo (676)\n• Ý nghĩa: Thống nhất từ sông Đại Đồng đến vịnh Wonsan về phía nam, nền tảng văn hóa dân tộc"
  },
  "ch_three_kingdoms_09": {
    "title": "Sự hình thành và phát triển của Gaya",
    "theory": "Gaya (Già Da) là liên minh vương quốc phát triển ở lưu vực sông Nakdong. Thịnh vượng nhờ sản xuất sắt và thương mại hàng hải.\n\n• Gaya thời kỳ đầu: Trung tâm Geumgwan Gaya (Gimhae), kế thừa Byeonhan\n• Gaya thời kỳ sau: Trung tâm Đại Gaya (Goryeong), thời kỳ hoàng kim thế kỷ 5-6\n• Đặc điểm: Xuất khẩu sắt (sang Nhật Bản, Nakrang), liên minh vương quốc (thất bại thống nhất)\n• Diệt vong: Geumgwan Gaya (532, vua Beopheung), Đại Gaya (562, vua Jinheung)\n• Văn hóa: Đàn Gayageum, giáp sắt, tục tuẫn táng"
  },
  "ch_three_kingdoms_10": {
    "title": "Phật giáo và tư tưởng Tam Quốc",
    "theory": "Phật giáo đóng góp vào việc củng cố vương quyền và thống nhất quốc gia.\n\n• Goguryeo: Năm 372 Sundo truyền đến từ Tiền Tần (vua Sosurim)\n• Baekje: Năm 384 Marananta truyền đến từ Đông Tấn (vua Chimnyu)\n• Silla: Năm 527 được công nhận sau khi Ichadon tuẫn đạo (vua Beopheung)\n• Đặc điểm: Phật giáo hộ quốc, tiếp nhận ở cấp quốc gia"
  },
  "ch_three_kingdoms_11": {
    "title": "Cổ mộ và di tích Tam Quốc",
    "theory": "Cổ mộ Tam Quốc thể hiện đặc trưng văn hóa của mỗi nước.\n\n• Goguryeo: Mộ đá xếp → Mộ đá hầm, Muyongchong, Gakjeochong, Ssangyeongchong (bích họa)\n• Baekje: Mộ đá hầm, Lăng mộ vua Muryeong (mộ gạch), Tứ thần đồ\n• Silla: Mộ đá xếp gỗ (Cheonmachong, Hwangnamdaechong), khai quật vương miện vàng\n• Silla thống nhất: Mộ đá hầm (ảnh hưởng hỏa táng)\n• Balhae: Mộ công chúa Jeonghyo (mộ đá hầm), kế thừa Goguryeo"
  },
  "ch_three_kingdoms_12": {
    "title": "Nghệ thuật và khoa học kỹ thuật Tam Quốc",
    "theory": "Tam Quốc phát triển nghệ thuật và khoa học kỹ thuật độc đáo.\n\n• Goguryeo: Bích họa cổ mộ (Tứ thần đồ), tranh săn bắn Muyongchong\n• Baekje: Lư hương đồng mạ vàng, Phật Ma Nhai tam tôn Seosan, tháp đá Mireuksa\n• Silla: Cheomseongdae (đài thiên văn cổ nhất phương Đông), tháp gỗ 9 tầng Hwangnyongsa, vương miện vàng\n• Khoa học: Quan sát thiên văn, sử dụng lịch pháp, phát triển kỹ thuật đóng tàu\n• Truyền sang Nhật Bản: Ajikgi, Wang In (chữ Hán, Nho học), Damjing (giấy, mực, màu sắc)"
  },
  "ch_north_south_states_01": {
    "title": "Chính trị Silla thống nhất",
    "theory": "Silla thống nhất xác lập vương quyền mạnh mẽ và chế độ tập quyền trung ương.\n\n• Vua Sinmun: Bãi bỏ Nogeup, cấp Gwanryojeon, thành lập Gukhak, 9 châu 5 tiểu kinh\n• Hệ thống cai trị: Jipsabu (cơ quan tối cao), Sangdaedeung (đại diện quý tộc)\n• Địa phương: 9 châu 5 tiểu kinh, Oesajeong (giám sát), Hyang-Bugok (đơn vị hành chính đặc biệt)\n• Quân sự: 9 Seodang (quân trung ương), 10 Jeong (quân địa phương)\n• Hạ đại: Tranh giành ngôi vua, hào tộc địa phương phát triển, 6 đầu phẩm phản kháng"
  },
  "ch_north_south_states_02": {
    "title": "Kinh tế Silla thống nhất",
    "theory": "Silla thống nhất phát triển kinh tế nhờ mở rộng lãnh thổ.\n\n• Chế độ ruộng đất: Gwanryojeon (quyền thu thuế của quan lại), Jeongjeon (ruộng nông dân)\n• Văn thư Minjeong: Điều tra dân số, ruộng đất, gia súc thôn làng (3 năm/lần), phát hiện tại Shosoin Nhật Bản\n• Thương mại: Chợ Đông-Tây Gyeongju, cảng thương mại quốc tế (Cheonghaejin, cảng Ulsan)\n• Jang Bogo: Thiết lập Cheonghaejin (828), kiểm soát quyền hàng hải, buôn bán trung gian Đường-Silla-Nhật\n• Thủ công nghiệp: Chế tác vàng bạc, dệt lụa"
  },
  "ch_north_south_states_03": {
    "title": "Xã hội Silla thống nhất",
    "theory": "Silla thống nhất là xã hội thân phận dựa trên chế độ Golpum.\n\n• Chế độ Golpum: Seonggol → Jingol → 6-1 đầu phẩm, hạn chế quan đẳng và đời sống\n• Jingol: Quý tộc cao nhất, quyền kế thừa ngôi vua, dưới 5 đầu phẩm bị hạn chế quan đẳng\n• 6 đầu phẩm: Tiến thân qua học vấn và tôn giáo, du học sinh tại Đường, trí thức phê phán\n• Hạ đại bất ổn: Tranh giành ngôi vua, nội bộ Jingol phân hóa, 6 đầu phẩm phản kháng\n• Hào tộc phát triển: Thế lực địa phương tự lập, nền tảng Hậu Tam Quốc"
  },
  "ch_north_south_states_04": {
    "title": "Văn hóa Silla thống nhất",
    "theory": "Silla thống nhất dung hợp văn hóa Tam Quốc để phát triển văn hóa dân tộc.\n\n• Phật giáo: Hoa Nghiêm tông (Uisang), Giáo tông phát triển, Thiền tông thịnh hành (Hạ đại)\n• Wonhyo: Tư tưởng Hwa-jaeng, Phật giáo đại chúng hóa, Mua-ega\n• Kiến trúc: Chùa Bulguksa, Hang Seokguram (Bản tôn Phật), tháp Dabotap-Seokgatap\n• Chuông: Chuông vua Seongdeok Đại vương (chuông Emille), chuông đồng chùa Sangwonsa\n• Văn học: Hyangga (Cheoyongga, Jemangmaega), Seolchong (chỉnh lý Idu)"
  },
  "ch_north_south_states_05": {
    "title": "Sự thành lập và chính trị của Balhae",
    "theory": "Balhae (Bột Hải) được thành lập năm 698 bởi Dae Joyeong tại núi Dongmo. Là quốc gia được lập bởi di dân Goguryeo và người Malgal.\n\n• Dae Joyeong: Xuất thân tướng lĩnh Goguryeo, thành lập sau khi thắng nhà Đường\n• Vua Mu: Đối đầu với Đường, Jang Munhyu tấn công bán đảo Sơn Đông\n• Vua Mun: Hữu hảo với Đường, dời đô về Thượng Kinh, củng cố 3 tỉnh 6 bộ\n• Vua Seon: Lãnh thổ cực đại, danh hiệu 'Hải Đông thịnh quốc'\n• Diệt vong: Năm 926 bị Khiết Đan tiêu diệt"
  },
  "ch_north_south_states_06": {
    "title": "Xã hội và văn hóa Balhae",
    "theory": "Balhae kế thừa văn hóa Goguryeo và cũng chịu ảnh hưởng của nhà Đường.\n\n• Cai trị: 3 tỉnh 6 bộ (chế độ Đường), địa phương 5 kinh 15 phủ 62 châu\n• Kế thừa Goguryeo: Ondol (sưởi sàn), đèn đá, tượng Phật ngồi hai mặt, cấu trúc mộ công chúa Jeonghyo\n• Ảnh hưởng Đường: Jujagam (giáo dục Nho học), thi Bingongkwa\n• Quan hệ đối ngoại: Giao lưu với Đường, Silla, Nhật Bản, đường Sillado (giao thông)\n• Di sản văn hóa: Di tích Thượng Kinh Long Tuyền phủ, mộ công chúa Jeonghye và Jeonghyo"
  },
  "ch_goryeo_01": {
    "title": "Sự thành lập và hệ thống cai trị của Goryeo",
    "theory": "Năm 918, Wang Geon lật đổ Gung Ye và thành lập Goryeo. Thống nhất Hậu Tam Quốc (936) và hợp nhất các hào tộc.\n\n• Hợp nhất hào tộc: Chính sách hôn nhân (29 phu nhân), chính sách ban họ, chế độ Giin, chế độ Sasimgwan\n• 10 điều Hunyo: Di huấn để lại cho các vua đời sau\n• Hệ thống cai trị: 2 tỉnh (Jungseo-munhaseong, Sangseoseong), 6 bộ, Jungchuwon, Samsa\n• Dobyeongmasa, Sikmokdogam: Cơ quan độc đáo của Goryeo\n• Địa phương: 5 đạo 2 giới, Hyang-Bugok-So (đơn vị hành chính đặc biệt)"
  },
  "ch_goryeo_02": {
    "title": "Sự hình thành và biến động của xã hội quý tộc môn phiệt",
    "theory": "Goryeo thời kỳ đầu là xã hội do quý tộc môn phiệt thống trị.\n\n• Quý tộc môn phiệt: Độc quyền quan chức qua khoa cử và ấm tử, thế tập Gongeum-jeon\n• Loạn Yi Ja-gyeom (1126): Thế lực ngoại thích cố độc quyền quyền lực\n• Loạn Myo Cheong (1135): Chủ trương dời đô về Tây Kinh và xưng đế, bị Kim Bu-sik dẹp\n• Đặc điểm: Hình thành môn phiệt như họ Yi Gyeongwon, hôn nhân khép kín\n• Biến động: Vương quyền suy yếu, phân biệt võ thần nghiêm trọng"
  },
  "ch_goryeo_03": {
    "title": "Sự thành lập và phát triển của chính quyền võ thần",
    "theory": "Năm 1170, Jeong Jung-bu và các võ thần khác phát động chính biến, thiết lập chính quyền võ thần.\n\n• Nguyên nhân: Thất chính của vua Uijong, phân biệt võ thần (sự kiện Bohyeonwon)\n• Diễn biến: Jeong Jung-bu → Gyeong Dae-seung → Yi Ui-min → Choe Chung-heon\n• Chính quyền họ Choe: Gyojeong-dogam (cơ quan quyền lực tối cao), Sambyeolcho (quân riêng), Jeongbang (quyền nhân sự)\n• Khởi nghĩa nông dân-tiện dân: Loạn Manjeok, loạn Mang-i Mang-soi\n• Kết quả: Vương quyền suy yếu, võ thần độc quyền quyền lực"
  },
  "ch_goryeo_04": {
    "title": "Kháng chiến chống Mông Cổ và Sambyeolcho",
    "theory": "Thế kỷ 13, Goryeo kháng chiến chống xâm lược của Mông Cổ (Nguyên).\n\n• Dời đô về Ganghwa (1232): Ý chí kháng chiến của chính quyền võ thần, chống cự 39 năm\n• Kháng chiến nhân dân: Thành Cheo-in (Kim Yun-hu), thành Chungju, thành Gwiju\n• Bát Vạn Đại Tạng Kinh: Cầu nguyện đánh đuổi Mông Cổ bằng sức mạnh Phật\n• Hoàn đô về Gaegyeong (1270): Vua Wonjong, sụp đổ chính quyền võ thần\n• Kháng chiến Sambyeolcho: Bae Jung-son, Jindo → đảo Jeju, bị dẹp năm 1273"
  },
  "ch_goryeo_05": {
    "title": "Thời kỳ can thiệp của Nguyên và Quyền môn thế tộc",
    "theory": "Thời kỳ can thiệp của Nguyên (1270-1356), Goryeo chịu sự can thiệp nội chính của nhà Nguyên.\n\n• Can thiệp: Thiết lập Jeongdong-haengseong, phái Darughachi, yêu cầu cống nữ và diều hâu\n• Hoàng thất: Hôn nhân với công chúa Nguyên, vua lớn lên ở Nguyên\n• Hạ bậc quan chế: Vương → Chungnyeol-wang, Bệ hạ → Điện hạ, 6 bộ → 4 ty\n• Quyền môn thế tộc: Phe thân Nguyên, sở hữu đại điền địa, kiểm soát Dopyeonguisasa\n• Biến đổi xã hội: Phong cách Mông Cổ thịnh hành, du nhập bông và thuốc súng"
  },
  "ch_goryeo_06": {
    "title": "Cải cách của vua Gongmin và Tân tiến sĩ đại phu",
    "theory": "Vua Gongmin (1351-1374) đẩy mạnh chính sách tự chủ chống Nguyên và củng cố vương quyền.\n\n• Chính sách chống Nguyên: Bãi bỏ Jeongdong-haengseong, thu hồi Ssangseong-chonggwanbu, bỏ niên hiệu và quan chế Nguyên\n• Cải cách nội chính: Jeonmin-byeonjeong-dogam (thu hồi đất của Quyền môn thế tộc), trọng dụng Sin Don\n• Tân tiến sĩ đại phu: Xuất thân khoa cử, Tống Nho học, phê phán Quyền môn thế tộc\n• Hạn chế: Hồng Cân tặc và Oa khấu xâm lược, hỗn loạn chính trị sau khi Sin Don bị loại\n• Yi Seong-gye: Hồi quân ở Wihwado (1388), liên minh với Tân tiến sĩ đại phu"
  },
  "ch_goryeo_07": {
    "title": "Kinh tế Goryeo",
    "theory": "Goryeo phát triển kinh tế nông nghiệp và thương mại quốc tế.\n\n• Chế độ ruộng đất: Jeonsigwa (quyền thu thuế của quan lại và quân nhân), Gongeum-jeon (thế tập từ ngũ phẩm trở lên)\n• Nông nghiệp: 2 năm 3 vụ, phát triển kỹ thuật bón phân, Nongsangjibyo (nông thư từ Nguyên)\n• Thương mại: Chợ Gaegyeong, Byeokrando (cảng thương mại quốc tế), thương nhân Đại Thực (Ả Rập)\n• Thủ công nghiệp: Thủ công nghiệp quan phủ (quốc doanh), So (sản xuất đặc biệt)\n• Tiền tệ: Geonwon-jungbo, Eunbyeong (Hwalgu), lưu thông yếu"
  },
  "ch_goryeo_08": {
    "title": "Chế độ thân phận và xã hội Goryeo",
    "theory": "Goryeo là xã hội thân phận gồm quý tộc, tầng lớp trung lưu, lương dân và tiện dân.\n\n• Quý tộc: Quý tộc môn phiệt, Quyền môn thế tộc, độc quyền khoa cử và ấm tử\n• Tầng lớp trung lưu: Hương lại (hành chính địa phương), Namban (tầng lớp quân nhân), Seori\n• Lương dân: Nông dân (Baekjeong), gánh chịu thuế, cống phẩm và sưu dịch\n• Tiện dân: Nô tỳ (Ilcheon-jeukcheon), dân Hyang-Bugok-So\n• Đặc điểm: Địa vị phụ nữ tương đối cao, phụ nữ quý tộc có thể tái giá"
  },
  "ch_goryeo_09": {
    "title": "Phật giáo Goryeo",
    "theory": "Goryeo lấy Phật giáo làm quốc giáo, ảnh hưởng toàn bộ xã hội.\n\n• Phật giáo quốc gia: Lễ Yeondeunghoe và Palgwanhoe (lễ hội quốc gia), chế độ Seunggwa\n• Tông phái: Giáo tông (Hoa Nghiêm tông, Pháp Tướng tông), Thiền tông (Tào Khê tông)\n• Uicheon: Sáng lập Thiên Thai tông, Gyo-gwan-gyeomsu, biên soạn Tục Tạng Kinh\n• Jinul: Chỉnh đốn Tào Khê tông, Jeongye-ssangsu, Dono-jeomsu, kết xã Suseonsa\n• Đại Tạng Kinh: Sơ điêu Đại Tạng Kinh (cầu nguyện đánh đuổi Khiết Đan), Bát Vạn Đại Tạng Kinh (đánh đuổi Mông Cổ)"
  },
  "ch_goryeo_10": {
    "title": "Nho học và sách sử Goryeo",
    "theory": "Cuối Goryeo, Tống Nho học được truyền vào, trở thành nền tảng tư tưởng của Tân tiến sĩ đại phu.\n\n• Nho học: Gukjagam (cơ quan giáo dục tối cao), hoàn thiện chế độ khoa cử\n• Tống Nho học: An Hyang giới thiệu (vua Chungnyeol), Baek Yi-jeong, Yi Je-hyeon, Yi Saek, Jeong Mong-ju kế thừa\n• Sách sử: Samguk Sagi (Kim Bu-sik, sách sử cổ nhất còn tồn tại, quan điểm Nho giáo)\n• Samguk Yusa (Ilyeon), Jewang Ungi (Yi Seung-hyu): Ghi chép về Dangun, ý thức dân tộc\n• Thất lục 7 đời: Không còn tồn tại"
  },
  "ch_goryeo_11": {
    "title": "Khoa học kỹ thuật và in ấn Goryeo",
    "theory": "Goryeo sở hữu kỹ thuật in ấn và kim loại đạt trình độ thế giới.\n\n• Kỹ thuật in: Bát Vạn Đại Tạng Kinh (bản khắc gỗ lớn nhất còn tồn tại), Jikji Simche Yojeol (bản in kim loại cổ nhất còn tồn tại)\n• Gốm xanh khảm: Phát triển thế kỷ 12, kỹ thuật độc đáo của Goryeo\n• La bàn: Phát triển kỹ thuật hàng hải\n• Thuốc súng: Choe Mu-seon, thiết lập Hwatong-dogam, đánh đuổi Oa khấu\n• Khác: Quan sát thiên văn, nghiên cứu lịch pháp, phát triển y học"
  },
  "ch_goryeo_12": {
    "title": "Nghệ thuật Goryeo",
    "theory": "Goryeo phát triển nghệ thuật độc đáo dựa trên văn hóa Phật giáo và quý tộc.\n\n• Gốm xanh: Gốm xanh thuần → Gốm xanh khảm (thế kỷ 12), bình gốm xanh khảm vân hạc\n• Tranh Phật: Màu sắc hoa lệ, Quan Kinh Biến Tướng Đồ\n• Kiến trúc: Phong cách Jusimpo (Geukrakjeon chùa Bongjeongsa, Muryangsujeon chùa Buseoksa)\n• Tháp đá: Đa dạng phong cách (tháp đá 8 tầng bát giác chùa Woljeongsa, tháp đá 10 tầng di tích chùa Gyeongcheonsa)\n• Công nghệ: Kỹ thuật khảm bạc, sơn mài khảm xà cừ"
  },
  "ch_joseon_early_01": {
    "title": "Sự thành lập và hệ thống cai trị của Joseon",
    "theory": "Năm 1392, Yi Seong-gye thành lập Joseon. Lấy Tống Nho học làm lý tưởng cai trị.\n\n• Thành lập: Hồi quân Wihwado (1388) → Thi hành Gwajeonbeop → Thành lập Joseon\n• Vua Taejo: Dời đô về Hanyang, xây cung Gyeongbok\n• Vua Taejong: Chế độ 6 bộ trực tiếp, giải tán quân riêng, Hopaebeop\n• Hệ thống cai trị: Uijeongbu và 6 bộ, Tam ty (Saheombu, Saganwon, Hongmungwan)\n• Địa phương: 8 đạo, phái Gwanchalsa và Suryeong, kiểm soát Hyang-ri"
  },
  "ch_joseon_early_02": {
    "title": "Chính trị từ Sejong đến Seongjong",
    "theory": "Các vua đầu Joseon thiết lập nền chính trị Nho giáo và phát triển văn hóa.\n\n• Vua Sejong: Jiphyeonjeon, Hunminjeongeum, khai phá 4 quận 6 trấn, Uijeongbu-seosaje\n• Vua Sejo: Bãi bỏ Jiphyeonjeon, chế độ 6 bộ trực tiếp, bắt đầu biên soạn Gyeongguk Daejeon\n• Vua Seongjong: Hoàn thành và ban hành Gyeongguk Daejeon, thành lập Hongmungwan, trọng dụng Sarim\n• Hướng cai trị: Hài hòa vương quyền và thần quyền\n• Jiphyeonjeon: Cơ quan nghiên cứu học thuật của vua Sejong"
  },
  "ch_joseon_early_03": {
    "title": "Sự phát triển của Sarim và các vụ Sahwa",
    "theory": "Sau Seongjong, Sarim phát triển nhưng đối đầu với Hungu dẫn đến các vụ Sahwa.\n\n• Sarim: Phái Kim Jong-jik, cơ sở hương thôn, Seowon và Hyangyak, coi trọng Đạo học\n• Hungu: Thế lực công thần của Sejo, kiểm soát chính trường trung ương\n• 4 vụ Sahwa lớn: Muo (1498), Gapja (1504), Gimyo (1519), Eulsa (1545)\n• Sahwa Muo: Joeui-jemun của Kim Jong-jik, vua Yeonsangun\n• Sahwa Gimyo: Cải cách của Jo Gwang-jo (Hyeonryanggwa, bãi bỏ Sogyeokseo), vua Jungjong"
  },
  "ch_joseon_early_04": {
    "title": "Sự khởi đầu của chính trị Bungdang",
    "theory": "Dưới thời vua Seonjo, Sarim nắm quyền và chính trị Bungdang bắt đầu.\n\n• Hình thành Bungdang: Vấn đề bổ nhiệm Ijo Jeonrang, Dongin (Kim Hyo-won) và Seoin (Sim Ui-gyeom)\n• Phân hóa Dongin: Mưu phản Jeong Yeo-rip → Namin (ôn hòa) và Bukin (cứng rắn)\n• Seoin: Phái Yi I và Seong Hon, vùng Giho\n• Dongin: Phái Yi Hwang, vùng Yeongnam\n• Đặc điểm: Dựa trên học duyên và địa duyên, phê phán kiềm chế lẫn nhau, coi trọng công luận"
  },
  "ch_joseon_early_05": {
    "title": "Chiến tranh Imjin",
    "theory": "Năm 1592, Nhật Bản xâm lược Joseon, chiến tranh Imjin bùng nổ.\n\n• Nguyên nhân: Tham vọng xâm lược đại lục của Toyotomi Hideyoshi\n• Giai đoạn đầu: Thành Busanjin và Dongnaeseong thất thủ, Hanseong thất thủ sau 20 ngày\n• Thủy quân: Hoạt động xuất sắc của Yi Sun-sin (Đại thắng Hansando, Đại thắng Myeongnyang)\n• Nghĩa binh: Gwak Jae-u, Jo Heon, Go Gyeong-myeong, Đại sư Seosan, Đại sư Samyeong\n• Kết quả: Đất nước hoang tàn, dân số giảm, văn vật bị cướp, văn hóa Nhật Bản phát triển"
  },
  "ch_joseon_early_06": {
    "title": "Chiến tranh Byeongja Horan và Bắc phạt luận",
    "theory": "Năm 1636, nhà Thanh xâm lược, chiến tranh Byeongja Horan bùng nổ.\n\n• Jeongmyo Horan (1627): Hậu Kim xâm lược, thiết lập quan hệ huynh đệ\n• Byeongja Horan (1636): Nhà Thanh xâm lược, kháng cự tại Namhansanseong, nhục nhã Samjeondo\n• Kết quả: Làm thần cho nhà Thanh, Thái tử Sohyeon và Bongnim Đại quân làm con tin, Bia Samjeondo\n• Bắc phạt luận: Vua Hyojong và Song Si-yeol, chủ trương chinh phạt nhà Thanh, không thực hiện được\n• Ảnh hưởng: Ý thức chống Thanh, Bắc học luận (thuyết tiếp thu văn vật nhà Thanh)"
  },
  "ch_joseon_early_07": {
    "title": "Kinh tế Joseon thời kỳ đầu",
    "theory": "Joseon thời kỳ đầu xác lập hệ thống kinh tế lấy nông nghiệp làm trung tâm.\n\n• Chế độ ruộng đất: Gwajeonbeop (ruộng Gyeonggi), Jikjeonbeop (Sejo), Gwansu-gwangeupje (Seongjong)\n• Nông nghiệp: Nongsajikseol (Sejong), Yeonbun 9 đẳng pháp và Jeonbun 6 đẳng pháp, 2 năm 3 vụ\n• Thương mại: Sijeon (Jongno), giám sát Gyeongsiseo, Jeohwa và Joseon Tongbo lưu thông yếu\n• Thủ công nghiệp: Thủ công nghiệp quốc doanh làm chủ, chế độ đăng ký thợ\n• Khai mỏ: Khai thác bạc và đồng, luyện vàng bạc"
  },
  "ch_joseon_early_08": {
    "title": "Chế độ thân phận và xã hội Joseon thời kỳ đầu",
    "theory": "Joseon là xã hội thân phận gồm Yangban, Jungin, Yangin và Cheonmin.\n\n• Yangban: Quan văn và võ, khoa cử và ấm tử, đặc quyền miễn dịch\n• Jungin: Quan kỹ thuật (thông dịch, y quan, toán học), thứ tử\n• Yangin: Nông dân, thương nhân, thợ thủ công, gánh chịu thuế, cống phẩm, sưu dịch\n• Cheonmin: Nô tỳ (Ilcheon-jeukcheon), Baekjeong, nghệ nhân...\n• Gia đình: Tăng cường phụ hệ, biên soạn gia phả, phổ biến tông pháp"
  },
  "ch_joseon_early_09": {
    "title": "Tống Nho học và giáo dục Joseon thời kỳ đầu",
    "theory": "Tống Nho học là lý tưởng cai trị và quy phạm xã hội của Joseon.\n\n• Tống Nho học: Lý khí luận (Yi Hwang Lý Khí nhị nguyên luận, Yi I Lý Khí nhất nguyên luận)\n• Cơ quan giáo dục: Seonggyungwan (giáo dục tối cao), 4 học (trung đẳng), Hyanggyo (địa phương)\n• Seowon: Cơ quan giáo dục của Sarim, Baegundong Seowon của Ju Se-bung (đầu tiên)\n• Khoa cử: Văn khoa, Võ khoa, Tạp khoa, thi Saengwon và Jinsa (Tiểu khoa)\n• Lễ học: Gia lễ (Chu Tử gia lễ), phổ biến quan hôn tang tế"
  },
  "ch_joseon_early_10": {
    "title": "Sách sử và địa lý Joseon thời kỳ đầu",
    "theory": "Joseon thúc đẩy các dự án biên soạn đa dạng do nhà nước chủ đạo.\n\n• Sách sử: Joseon Wangjo Sillok (UNESCO), Goryeosa, Goryeosa Jeolyo\n• Sách địa lý: Dongguk Yeoji Seungnam, Sinjeung Dongguk Yeoji Seungnam\n• Pháp điển: Gyeongguk Daejeon (Seongjong), Daejeon Songnok, Daejeon Husongnok\n• Sách nghi lễ: Gukjo Oryeui (Sejong đến Seongjong)\n• Nông thư: Nongsajikseol (Sejong)"
  },
  "ch_joseon_early_11": {
    "title": "Khoa học kỹ thuật Joseon thời kỳ đầu",
    "theory": "Thời vua Sejong là thời kỳ hoàng kim của khoa học kỹ thuật.\n\n• Thiên văn: Honcheonui, Ganui, Angbuilgu, Jagyeongnu (Jang Yeong-sil)\n• Cheugugi: Dụng cụ đo lượng mưa đầu tiên trên thế giới\n• In ấn: Gyemija, Gabinja (hoạt tự kim loại), Sejong\n• Bản đồ: Honil Gangni Yeokdae Gukdo Jido (bản đồ thế giới cổ nhất còn tồn tại)\n• Y học: Hyangyak Jipseongbang (Sejong), Uibang Yuchwi, Donguibogam (Gwanghaegun)"
  },
  "ch_joseon_early_12": {
    "title": "Nghệ thuật Joseon thời kỳ đầu",
    "theory": "Joseon thời kỳ đầu phản ánh lý tưởng Tống Nho học vào nghệ thuật.\n\n• Hội họa: An Gyeon (Mongyudowondo), Gang Hui-an, phát triển tranh văn nhân\n• Gốm sứ: Buncheong-sagi → Bạch sứ (thế kỷ 16), vẻ đẹp mộc mạc tiết chế\n• Kiến trúc: Kiến trúc Nho giáo (cung điện, Jongmyo), Sungnyemun, cung Gyeongbok\n• Âm nhạc: Chỉnh đốn Nhã nhạc (Bak Yeon), Jeongganbo (Sejong)\n• Công nghệ: Mộc nghệ, sơn mài khảm xà cừ"
  },
  "ch_joseon_late_01": {
    "title": "Sự biến chất của chính trị Bungdang",
    "theory": "Cuối thế kỷ 17, chính trị Bungdang biến chất thành chế độ độc đảng chuyên chế.\n\n• Tranh luận Yesong: Vấn đề tang phục sau khi vua Hyojong băng hà, Seoin vs Namin\n• Gyeongsin Hwanguk (1680): Namin thất thế, Seoin nắm quyền\n• Gisa Hwanguk (1689): Seoin thất thế, Namin nắm quyền, Song Si-yeol bị xử tử\n• Gapsul Hwanguk (1694): Namin thất thế, Seoin (Noron-Soron) nắm quyền\n• Kết quả: Mất chức năng kiềm chế lẫn nhau, chế độ độc đảng chuyên chế"
  },
  "ch_joseon_late_02": {
    "title": "Chính trị Tangpyeong",
    "theory": "Vua Yeongjo và Jeongjo thực hiện chính sách Tangpyeong để khắc phục tệ nạn Bungdang.\n\n• Vua Yeongjo: Tangpyeong ôn hòa (trọng dụng phái ôn hòa), giảm quyền Ijo Jeonrang, Gyunyeokbeop\n• Vua Jeongjo: Tangpyeong nghiêm khắc (trọng năng lực), thành lập Gyujanggak, Jangnyongyeong, thành Suwon Hwaseong\n• Cải cách của Jeongjo: Chế độ Chogyemunsin, cho phép thứ tử (Seoeol Heotong), bãi bỏ đặc quyền Sijeon (Sinhae Tonggong)\n• Hạn chế: Gia tộc Sedo phát triển, ngoại thích lộng hành\n• Ý nghĩa: Củng cố vương quyền, phục hưng văn hóa"
  },
  "ch_joseon_late_03": {
    "title": "Chính trị Sedo",
    "theory": "Sau vua Sunjo, chính trị Sedo do các gia tộc ngoại thích độc quyền quyền lực.\n\n• Gia tộc Sedo: Họ Kim Andong (Sunjo), họ Jo Pungyang (Heonjong, Cheoljong)\n• Samjeong văn loạn: Jeonjeong (thuế ruộng), Gunjeong (quân dịch), Hwangok (lãi suất) tệ nạn\n• Khởi nghĩa nông dân: Loạn Hong Gyeong-rae (1811), Khởi nghĩa nông dân Imsul (1862, Jinju)\n• Bất ổn xã hội: Thịnh hành Bigi và Đồ sấm thuyết, nổi loạn thường xuyên\n• Kết quả: Vương quyền suy yếu, kỷ cương quốc gia lỏng lẻo, chậm trễ khai hóa"
  },
  "ch_joseon_late_04": {
    "title": "Biến đổi kinh tế Joseon thời kỳ sau",
    "theory": "Joseon thời kỳ sau phát triển kinh tế hàng hóa tiền tệ.\n\n• Nông nghiệp: Phương pháp cấy mạ (Iangbeop) lan rộng, Gwangjak (tầng lớp phú nông), cây trồng thương phẩm (thuốc lá, nhân sâm, bông)\n• Thủ công nghiệp: Tư nhân hóa, Seondaeje (thương nhân cung cấp nguyên liệu)\n• Thương mại: Sasang (thương nhân ngoài Sijeon), Songsang-Mansang-thương nhân Gaeseong, chợ phiên 5 ngày\n• Tiền tệ: Sangpyeong Tongbo lưu thông toàn quốc (Sukjong)\n• Khai mỏ: Chế độ Seoljeomsuseje (kinh doanh mỏ tư nhân)"
  },
  "ch_joseon_late_05": {
    "title": "Biến động chế độ thân phận Joseon thời kỳ sau",
    "theory": "Joseon thời kỳ sau chế độ thân phận biến động, xã hội thay đổi.\n\n• Tầng lớp Yangban: Tăng Yangban sa sút, Hyangban-Janban\n• Tầng lớp Jungin: Phong trào nâng cao thân phận, yêu cầu quyền thi Yeokgwa, phong trào Socheong\n• Seoeol: Yêu cầu Heotong, tiến vào Geomseogwan của Gyujanggak\n• Tầng lớp nông dân: Nâng cao thân phận bằng Napsok-Gongmyeongcheop\n• Nô tỳ: Giải phóng công nô tỳ (Sunjo, 1801), giảm dân số nô tỳ"
  },
  "ch_joseon_late_06": {
    "title": "Sự phát triển của Thực học",
    "theory": "Thế kỷ 17-18, Thực học theo đuổi cải cách xã hội phát triển.\n\n• Phái Gyeongse-chiyong (trọng nông): Yu Hyeong-won (Bangye Surok), Yi Ik (Seongho Saseol), Jeong Yak-yong (Mongmin Simseo, Gyeongse Yupyo)\n• Phái Iyong-husaeng (trọng thương): Yu Su-won, Bak Ji-won (Yeolha Ilgi), Bak Je-ga (Bukhakui), Hong Dae-yong\n• Jeong Yak-yong: Geojunggi (thành Suwon Hwaseong), Yeojeonje-Jeongjeonje, Mongmin Simseo\n• Ảnh hưởng: Phú quốc cường binh, ổn định dân sinh, hình thành ý thức cận đại\n• Hạn chế: Không được tầng lớp cầm quyền áp dụng"
  },
  "ch_joseon_late_07": {
    "title": "Sự phát triển của Quốc học",
    "theory": "Joseon thời kỳ sau quan tâm cao đến văn hóa và lịch sử dân tộc.\n\n• Nghiên cứu quốc ngữ: Sin Gyeong-jun (Hunminjeongeum Unhae), Yu Hui (Eonmunji)\n• Sách sử: An Jeong-bok (Dongsa Gangmok), Yi Geung-ik (Yeonnyeosil Gisul), Han Chi-yun (Haedong Yeoksa)\n• Sách địa lý: Jeong Sang-gi (Dongguk Jido), Kim Jeong-ho (Daedongyeojido)\n• Bách khoa toàn thư: Yi Ik (Seongho Saseol), Yi Deok-mu (Cheongjang-gwan Jeonseo)\n• Đặc điểm: Nghiên cứu thực chứng và khách quan, tìm kiếm bản sắc dân tộc"
  },
  "ch_joseon_late_08": {
    "title": "Sự phát triển của văn hóa thứ dân",
    "theory": "Joseon thời kỳ sau văn hóa đại chúng phát triển do sức mạnh kinh tế của thứ dân tăng.\n\n• Văn học: Tiểu thuyết Hangeul (Honggildong-jeon, Chunhyang-jeon), Pansori, Saseol Sijo\n• Hội họa: Tranh phong tục (Kim Hong-do, Sin Yun-bok), tranh dân gian, Jingyeong Sansuhwa (Jeong Seon)\n• Biểu diễn: Múa mặt nạ (Múa mặt nạ Bongsan), Pansori, Kkokdu-gaksi-noreum\n• Đặc điểm: Châm biếm Yangban, phê phán hiện thực, hài hước\n• Kim Jeong-hui: Thể chữ Chusa, Sehando (tranh văn nhân)"
  },
  "ch_joseon_late_09": {
    "title": "Khoa học kỹ thuật Joseon thời kỳ sau",
    "theory": "Joseon thời kỳ sau khoa học kỹ thuật phát triển dưới ảnh hưởng Thực học.\n\n• Bản đồ: Jeong Sang-gi (Dongguk Jido, tỷ lệ 100 lý), Kim Jeong-ho (Daedongyeojido, bản gỗ)\n• Y học: Heo Jun (Donguibogam), Jeong Yak-yong (Magwa Hoetong)\n• Thiên văn: Hong Dae-yong (Thuyết Địa chuyển), tiếp thu thiên văn học phương Tây\n• Nông nghiệp: Bak Se-dang (Saekgyeong), cách tân kỹ thuật nông nghiệp\n• Kỹ thuật: Geojunggi (Jeong Yak-yong), Sucha (Phái Bắc học chủ trương du nhập)"
  },
  "ch_joseon_late_10": {
    "title": "Sự xuất hiện của các tôn giáo mới",
    "theory": "Joseon thời kỳ sau các tôn giáo và tư tưởng mới xuất hiện.\n\n• Thiên Chúa giáo: Thế kỷ 17 truyền đến như Tây học, Yi Seung-hun rửa tội (1784), Bách hại Sinhae-Gihae\n• Đông học: 1860 Choe Je-u sáng lập, Innaecheon (con người là trời), chống phong kiến và ngoại bang\n• Tư tưởng tiên tri: Jeong Gam-rok, thịnh hành Bigi và Đồ sấm thuyết\n• Tín ngưỡng Di Lặc: Niềm mong cầu cứu độ của dân chúng\n• Đặc điểm: Phê phán mâu thuẫn xã hội, tư tưởng bình đẳng"
  },
  "ch_modern_01": {
    "title": "Cải cách của Heungseon Daewongun",
    "theory": "Heungseon Daewongun thúc đẩy cải cách để củng cố vương quyền và ổn định dân sinh.\n\n• Củng cố vương quyền: Trùng tu cung Gyeongbok, bãi bỏ Bibyeonsa, phục hồi Samgunbu\n• Xóa bỏ chính trị Sedo: Trục xuất thế lực họ Kim Andong, trọng dụng nhân tài\n• Cải cách Samjeong: Hopoje (Yangban đóng quân bố), Sachangje (thay thế Hwangok)\n• Triệt phá Seowon: Chỉ giữ lại 47 Seowon, bãi bỏ đặc quyền miễn thuế và miễn dịch\n• Từ chối thông thương: Byeongin Yangyo (1866), Sinmi Yangyo (1871), Bia Cheokhwa"
  },
  "ch_modern_02": {
    "title": "Mở cửa và các điều ước bất bình đẳng",
    "theory": "Năm 1876, Joseon mở cửa bằng Điều ước Ganghwado.\n\n• Sự kiện tàu Unyo (1875): Tàu chiến Nhật Bản xâm phạm Ganghwado\n• Điều ước Ganghwado (1876): Điều ước cận đại đầu tiên, điều ước bất bình đẳng\n  - Mở cửa Busan, Wonsan, Incheon, quyền trị ngoại pháp, quyền đo đạc bờ biển\n• Điều ước thông thương Joseon-Mỹ (1882): Đãi ngộ tối huệ quốc, điều đình trung gian\n• Sau đó thiết lập quan hệ ngoại giao với Anh, Đức, Nga, Pháp\n• Ảnh hưởng: Cơ hội cận đại hóa, bắt đầu xâm chiếm kinh tế"
  },
  "ch_modern_03": {
    "title": "Phong trào khai hóa và Vệ chính xích tà",
    "theory": "Sau khi mở cửa, phái Khai hóa và phái Vệ chính xích tà đối đầu nhau.\n\n• Phái Khai hóa: Mở cửa văn hóa, tiếp thu văn vật phương Tây, thúc đẩy cận đại hóa\n  - Phái Khai hóa ôn hòa (Đông đạo Tây khí): Kim Hong-jip, Eo Yun-jung\n  - Phái Khai hóa cấp tiến (Văn minh khai hóa): Kim Ok-gyun, Bak Yeong-hyo, Hong Yeong-sik\n• Vệ chính xích tà: Bảo vệ Tống Nho học, bài xích ngoại thế\n  - Yi Hang-ro, Gi Jeong-jin, Choe Ik-hyeon (Thuyết Oa Dương nhất thể)\n• Tongri-gimua-mun: Cơ quan thúc đẩy chính sách khai hóa"
  },
  "ch_modern_04": {
    "title": "Binh biến Imo và Chính biến Gapsin",
    "theory": "Thập niên 1880, Joseon bước vào thời kỳ biến động chính trị.\n\n• Binh biến Imo (1882): Binh lính cũ nổi dậy, Daewongun tái chấp chính\n  - Thanh can thiệp, Daewongun bị bắt sang Thanh, Điều ước Jemulpo\n• Chính biến Gapsin (1884): Chính biến của phái Khai hóa cấp tiến, 14 điều cải cách\n  - 3 ngày thiên hạ, thất bại do Thanh can thiệp, Kim Ok-gyun lưu vong\n• Kết quả: Tăng cường can thiệp nội chính của Thanh, thuyết trung lập hóa Joseon\n• Điều ước Hanseong và Điều ước Thiên Tân: Cân bằng thế lực Nhật-Thanh"
  },
  "ch_modern_05": {
    "title": "Phong trào nông dân Đông học",
    "theory": "Năm 1894, nghĩa quân nông dân Đông học triển khai phong trào chống phong kiến và chống ngoại bang.\n\n• Bối cảnh: Samjeong văn loạn, Nhật Bản xâm chiếm kinh tế, phong trào Gyojo Sinwon\n• Khởi nghĩa lần 1: Khởi nghĩa Gobu (Jeon Bong-jun), thắng trận Hwangtohyeon và Hwangryongchon\n• Hòa ước Jeonju: 12 điều cải cách tệ chính, thiết lập Jipgangso\n• Khởi nghĩa lần 2: Chống quân Nhật chiếm cung Gyeongbok, thất bại trận Ugeumchi\n• Ý nghĩa: Chống phong kiến và xâm lược, ảnh hưởng đến cải cách Gabo"
  },
  "ch_modern_06": {
    "title": "Cải cách Gabo và cải cách Eulmi",
    "theory": "1894-1896, cải cách cận đại được thúc đẩy.\n\n• Cải cách Gabo (1894): Gunguk-gimucheo, bãi bỏ khoa cử, xóa bỏ chế độ thân phận\n  - Chế độ bản vị bạc, thống nhất độ lượng hình, thiết lập tòa án\n• Cải cách Eulmi (1895): Sử dụng dương lịch, lệnh cắt tóc, thành lập tiểu học\n• Sự biến Eulmi (1895): Nhật Bản ám sát Hoàng hậu Myeongseong\n• Agwan Pacheon (1896): Vua Gojong lánh nạn tại công sứ quán Nga\n• Hạn chế: Do Nhật Bản chủ đạo, dân chúng phản kháng (Nghĩa binh Eulmi)"
  },
  "ch_modern_07": {
    "title": "Hội Độc lập và Đế quốc Đại Hàn",
    "theory": "Cuối thập niên 1890, phong trào độc lập tự chủ và cận đại hóa được triển khai.\n\n• Hội Độc lập (1896): Seo Jae-pil, Báo Độc lập, xây Cổng Độc lập\n  - Hội Manmin Gongdonghoe, phong trào thành lập nghị hội, 6 điều Heonui\n• Đế quốc Đại Hàn (1897): Vua Gojong lên ngôi Hoàng đế, cải cách Gwangmu\n  - Gubon Sincham (đưa cái mới vào dựa trên cái cũ)\n  - Công việc đo đạc ruộng đất, cấp Jigye, thiết lập Wonsubu\n• Hạn chế: Cải cách bảo thủ, các cường quốc xâm chiếm trầm trọng"
  },
  "ch_modern_08": {
    "title": "Phong trào nghĩa binh kháng Nhật",
    "theory": "Sau khi mở cửa, phong trào nghĩa binh chống xâm lược của Nhật được triển khai.\n\n• Nghĩa binh Eulmi (1895): Chống lệnh cắt tóc và ám sát Hoàng hậu Myeongseong, do nho sinh lãnh đạo\n  - Yu In-seok, Yi So-eung và các hoạt động khác\n• Nghĩa binh Eulsa (1905): Chống Điều ước Eulsa, Min Jong-sik, Choe Ik-hyeon\n• Nghĩa binh Jeongmi (1907): Chống giải tán quân đội, binh lính giải tán gia nhập\n  - 13 đạo Changui-gun (Yi In-yeeong), chiến dịch tiến công Seoul\n• Hạn chế: Suy yếu do chiến dịch Đại thảo phạt Nam Hàn của Nhật (1909)"
  },
  "ch_modern_09": {
    "title": "Phong trào khai sáng ái quốc",
    "theory": "Phong trào theo đuổi khôi phục chủ quyền thông qua bồi dưỡng thực lực được triển khai.\n\n• Tổ chức: Boan-hoe (ngăn chặn quyền khai khẩn hoang địa của Nhật), Heonjeongyeongu-hoe, Daehan Jagang-hoe\n• Sinmin-hoe (1907): An Chang-ho, Yang Gi-tak, hội kín, hướng đến cộng hòa\n  - Trường Osan, Trường Daeseong, Nhà sách Taegeuk, Công ty Jagi\n• Giáo dục: Thành lập trường tư lập, giáo dục dân tộc\n• Báo chí: Hwangseong Sinmun, Daehan Maeil Sinbo (Bethell), Phong trào bồi thường quốc trái\n• Hạn chế: Tập trung bồi dưỡng thực lực, bị Nhật đàn áp"
  },
  "ch_modern_10": {
    "title": "Quá trình mất chủ quyền quốc gia",
    "theory": "Nhật Bản từng bước xâm chiếm chủ quyền của Joseon.\n\n• Điều ước Eulsa (1905): Tước đoạt quyền ngoại giao, thiết lập Thống giám phủ (Ito Hirobumi)\n• Đặc sứ The Hague (1907): Yi Jun, Yi Sang-seol, Yi Wi-jong, vua Gojong bị ép thoái vị\n• 7 điều ước Jeongmi (1907): Tước đoạt quyền nội chính, giải tán quân đội\n• Giác thư Giyu (1909): Tước đoạt quyền tư pháp và cảnh sát\n• Quốc sỉ Gyeongsul (29/8/1910): Điều ước sáp nhập Hàn-Nhật, mất chủ quyền quốc gia\n• Kháng cự: An Jung-geun ám sát Ito Hirobumi (1909)"
  },
  "ch_japanese_occupation_01": {
    "title": "Thống trị võ đoán thập niên 1910",
    "theory": "Thập niên 1910, Nhật Bản thực hiện chế độ thống trị võ đoán với lực lượng hiến binh cảnh sát.\n\n• Phủ Toàn quyền Joseon: Toàn quyền (Đại tướng lục-hải quân), nắm quyền lập pháp, tư pháp, hành pháp\n• Chế độ hiến binh cảnh sát: Quyền xử lý tức quyết (hình phạt đánh roi), giám sát người Joseon\n• Sự nghiệp điều tra ruộng đất (1910-1918): Chủ nghĩa khai báo, tịch thu đất không khai báo\n  - Thành lập Công ty Thực dân Đông Dương, tăng địa chủ người Nhật\n• Lệnh Công ty: Chế độ cấp phép thành lập công ty, kìm hãm tư bản dân tộc phát triển\n• Giáo dục: Giáo dục ngu dân, hạn chế giáo dục tiếng Joseon"
  },
  "ch_japanese_occupation_02": {
    "title": "Thống trị văn hóa thập niên 1920",
    "theory": "Sau phong trào 3·1, Nhật Bản thực hiện chính sách thống trị văn hóa (chính sách hòa hoãn lừa dối).\n\n• Chế độ cảnh sát thường: Bãi bỏ cảnh sát hiến binh, thực tế tăng số lượng và trang bị cảnh sát\n• Báo chí, hội họp: Cho phép Chosun Ilbo, Dong-A Ilbo (kiểm duyệt), hoạt động Hội Ngôn ngữ Joseon\n• Giáo dục: Cho phép thành lập đại học (Đại học Gyeongseong, 1924), mở rộng trường phổ thông\n• Kế hoạch tăng sản lượng gạo: Tăng sản lượng gạo → xuất khẩu sang Nhật, Joseon thiếu lương thực\n• Hạn chế: Bồi dưỡng phái thân Nhật, mưu toan chia rẽ dân tộc"
  },
  "ch_japanese_occupation_03": {
    "title": "Thống trị hủy diệt dân tộc thập niên 1930-40",
    "theory": "Từ thập niên 1930, Nhật Bản cưỡng hành chính sách hủy diệt dân tộc để tiến hành chiến tranh.\n\n• Hoàng quốc thần dân hóa: Lời thề Hoàng quốc thần dân, bắt buộc tham bái thần xã, vái cung điện\n• Hủy diệt văn hóa dân tộc: Cấm sử dụng tiếng Joseon, đàn áp Hội Ngôn ngữ Joseon (1942)\n• Changssigaemyeong (1940): Bắt buộc đổi họ tên kiểu Nhật\n• Vơ vét nhân lực: Chế độ lính tình nguyện → chế độ tòng quân, lính sinh viên, cưỡng bức lao động\n• Vơ vét phụ nữ: Cưỡng bức động viên 'Phụ nữ giải khuây' quân Nhật\n• Vơ vét vật lực: Chế độ cống nạp, cưỡng bức nộp kim loại"
  },
  "ch_japanese_occupation_04": {
    "title": "Phong trào 3·1",
    "theory": "Phong trào 3·1 năm 1919 là phong trào dân tộc lớn nhất thời kỳ Nhật chiếm đóng.\n\n• Bối cảnh: Chủ nghĩa dân tộc tự quyết của Wilson, Tuyên ngôn độc lập 2·8 (Tokyo), tin đồn vua Gojong bị đầu độc\n• Diễn biến: Ngày 1 tháng 3 tại công viên Tapgol, đọc Tuyên ngôn độc lập, biểu tình vạn tuế\n  - Học sinh, tôn giáo → lan rộng toàn tầng lớp, toàn quốc, mở rộng ra nước ngoài (Gando, Primorsky)\n• Đàn áp của Nhật: Thảm sát Jeam-ri, đốt thành Suwon Hwaseong\n• Ý nghĩa: Thành lập Chính phủ Lâm thời Đại Hàn Dân Quốc, chuyển từ bất bạo động → đấu tranh vũ trang\n• Ảnh hưởng: Phong trào Ngũ Tứ Trung Quốc, phong trào bất bạo động Ấn Độ"
  },
  "ch_japanese_occupation_05": {
    "title": "Chính phủ Lâm thời Đại Hàn Dân Quốc",
    "theory": "Năm 1919, Chính phủ Lâm thời Đại Hàn Dân Quốc được thành lập tại Thượng Hải.\n\n• Thành lập: Thượng Hải (Lâm chính thống nhất), chế độ dân chủ cộng hòa, Tổng thống Yi Seung-man\n• Hoạt động: Yeontonge và Gyotongguk, Báo Độc lập, Sở biên soạn sử liệu\n• Khủng hoảng: Yi Seung-man bị luận tội, chia rẽ Hội nghị Đại biểu Quốc dân (1923)\n• Lãnh đạo của Kim Gu: Hội Ái quốc Hàn nhân, nghĩa cử Yun Bong-gil (1932)\n• Di chuyển đến Trùng Khánh (1940): Thành lập Quân Quang phục Hàn Quốc, tuyên chiến với Nhật\n• Ý nghĩa: Trung tâm phong trào độc lập, truyền thống dân chủ cộng hòa"
  },
  "ch_japanese_occupation_06": {
    "title": "Đấu tranh nghĩa liệt và Hội Ái quốc Hàn nhân",
    "theory": "Từ thập niên 1920, các cuộc đấu tranh nghĩa liệt cá nhân được triển khai.\n\n• Nghĩa Liệt Đoàn (1919): Kim Won-bong, Sin Chae-ho (Tuyên ngôn Cách mạng Joseon), đấu tranh bạo lực\n  - Bak Jae-hyeok (Đồn cảnh sát Busan), Kim Ik-sang (Phủ Toàn quyền Joseon), Na Seok-ju (Công ty Thực dân Đông Dương)\n• Hội Ái quốc Hàn nhân (1931): Kim Gu tổ chức, hoạt động đặc vụ\n  - Yi Bong-chang: Ném bom Nhật hoàng (1932, thất bại)\n  - Yun Bong-gil: Nghĩa cử công viên Hongkou Thượng Hải (1932), xử tử tướng lĩnh quân Nhật\n• Ý nghĩa: Thể hiện ý chí độc lập, cơ hội để Trung Quốc hỗ trợ"
  },
  "ch_japanese_occupation_07": {
    "title": "Chiến tranh độc lập vũ trang",
    "theory": "Từ thập niên 1920, chiến tranh độc lập vũ trang được triển khai tại Mãn Châu và Trung Quốc.\n\n• Trận Bongodong (1920): Đại Hàn Độc lập quân của Hong Beom-do, đại phá quân Nhật\n• Đại thắng Cheongsanri (1920): Bắc Lộ Quân chính thự của Kim Jwa-jin, chiến công lớn nhất\n• Thảm sát Gando (1920): Quân Nhật thảm sát người Joseon tại Gando\n• Thảm sát Jayu-si (1921): Độc lập quân bị Hồng quân Liên Xô sát hại\n• Thống nhất 3 phủ: Chamui-bu, Jeongui-bu, Sinmin-bu → Gukmin-bu, Hyeoksin-uihoe\n• Quân Quang phục Hàn Quốc (1940): Trực thuộc Lâm chính, chuẩn bị chiến dịch tiến công trong nước"
  },
  "ch_japanese_occupation_08": {
    "title": "Phong trào dân tộc xã hội và kinh tế",
    "theory": "Thời kỳ Nhật chiếm đóng, các phong trào dân tộc xã hội và kinh tế đa dạng được triển khai.\n\n• Phong trào khuyến khích sản phẩm nội địa (1920): Jo Man-sik, ưu tiên dùng hàng nội địa, 'Sống bằng đồ của mình'\n• Phong trào thành lập đại học dân lập (1922): Yi Sang-jae, vận động quyên góp, Nhật cản trở\n• Phong trào nông dân: Tranh chấp tá điền (tranh chấp tá điền đảo Amtae)\n• Phong trào công nhân: Tổng đình công Wonsan (1929), Tổng liên đoàn Lao động Joseon\n• Hội Tân Can (1927): Đảng duy nhất dân tộc, hợp tác tả hữu, hỗ trợ phong trào học sinh Gwangju"
  },
  "ch_japanese_occupation_09": {
    "title": "Phong trào bảo vệ văn hóa dân tộc",
    "theory": "Thời kỳ Nhật chiếm đóng, nỗ lực bảo vệ văn hóa và bản sắc dân tộc tiếp tục.\n\n• Nghiên cứu quốc ngữ: Hội Ngôn ngữ Joseon (Phương án thống nhất chính tả Hangeul, tiếng chuẩn), thiết lập Ngày Hangeul\n• Nghiên cứu lịch sử: Bak Eun-sik (Hàn Quốc Thống sử), Sin Chae-ho (Joseon Thượng cổ sử), sử học chủ nghĩa dân tộc\n• Phong trào Quốc học: Jeong In-bo (Triều Tiên học), Mun Il-pyeong, An Jae-hong\n• Giáo dục: Trường tư thục dân tộc (Trường Osan, Trường Daeseong), phong trào dạ học\n• Tôn giáo: Thiên Đạo giáo, Đại Tông giáo, Viên Phật giáo, nâng cao ý thức dân tộc"
  },
  "ch_japanese_occupation_10": {
    "title": "Hoạt động của kiều bào hải ngoại",
    "theory": "Thời kỳ Nhật chiếm đóng, kiều bào hải ngoại cũng tham gia phong trào độc lập.\n\n• Mãn Châu: Tây Gando (Gyeonghaksa, Trường Sinheung Mugwan), Bắc Gando (Trường Myeongdong, Thảm sát Gando)\n• Primorsky: Gwoneop-hoe, Chính phủ Quân chính Đại Hàn Quang phục, Thảm sát Jayu-si\n• Mỹ: Hội Quốc dân Đại Hàn, Bak Yong-man (huấn luyện quân sự), Yi Seung-man (hoạt động ngoại giao)\n• Hawaii: Lao động nông trường mía, hỗ trợ quỹ độc lập\n• Nhật Bản: Tuyên ngôn độc lập 2·8, phong trào du học sinh"
  },
  "ch_contemporary_01": {
    "title": "Quang phục và chia cắt",
    "theory": "Ngày 15 tháng 8 năm 1945 đón Quang phục nhưng bán đảo Triều Tiên bị chia cắt.\n\n• Quang phục: Nhật Bản đầu hàng vô điều kiện, thành quả của phong trào độc lập\n• Chia cắt: Mỹ-Xô phân chia chiếm đóng theo vĩ tuyến 38\n• Ủy ban Chuẩn bị Kiến quốc: Yeo Un-hyeong, tuyên bố Cộng hòa Nhân dân (Quân chính Mỹ không công nhận)\n• Hội nghị Ngoại trưởng 3 nước Moscow (1945): Thành lập chính phủ lâm thời, 5 năm ủy thác thống trị\n  - Ủng hộ ủy thác (cánh tả) vs Phản đối ủy thác (cánh hữu) đối đầu\n• Ủy ban Hỗn hợp Mỹ-Xô: Tan vỡ, chuyển sang Liên Hợp Quốc"
  },
  "ch_contemporary_02": {
    "title": "Thành lập Chính phủ Đại Hàn Dân Quốc",
    "theory": "Năm 1948, Chính phủ Đại Hàn Dân Quốc được thành lập.\n\n• Nghị quyết Liên Hợp Quốc: Tổng tuyển cử theo tỷ lệ dân số, Liên Xô từ chối\n• Hiệp thương Nam-Bắc (1948): Kim Gu, Kim Gyu-sik, thăm Bình Nhưỡng, thất bại\n• Tổng tuyển cử 10/5 (1948): Giám sát của Liên Hợp Quốc, thành lập Quốc hội Chế hiến\n• Hiến pháp Chế hiến: Dân chủ cộng hòa, chế độ tổng thống + chế độ nội các\n• Thành lập Chính phủ Đại Hàn Dân Quốc (15/8/1948): Yi Seung-man Tổng thống đầu tiên\n• Liên Hợp Quốc công nhận: Chính phủ hợp pháp duy nhất trên bán đảo Triều Tiên"
  },
  "ch_contemporary_03": {
    "title": "Chiến tranh 25/6",
    "theory": "Ngày 25 tháng 6 năm 1950, chiến tranh bùng nổ do Bắc Triều Tiên xâm lược miền Nam.\n\n• Bối cảnh: Công bố Đường Acheson, Bắc Triều Tiên chuẩn bị chiến tranh\n• Diễn biến: Bắc Triều Tiên xâm lược → Phòng tuyến Nakdonggang → Đổ bộ Incheon → Thu hồi Seoul\n  → Tiến quân sông Áp Lục → Quân Trung Quốc can thiệp → Rút lui 4/1 → Bế tắc vĩ tuyến 38\n• Đình chiến (27/7/1953): Panmunjom, tình trạng đình chiến tiếp tục đến nay\n• Thiệt hại: Hàng triệu người thương vong, hàng chục triệu gia đình ly tán, đất nước hoang tàn\n• Ảnh hưởng: Tăng cường ý thức hệ chống cộng, cố định hóa chia cắt"
  },
  "ch_contemporary_04": {
    "title": "Chính phủ Yi Seung-man và Cách mạng 19/4",
    "theory": "Cách mạng 19/4 nổ ra chống lại sự cầm quyền lâu dài của chính phủ Yi Seung-man.\n\n• Chính phủ Yi Seung-man: Chính sách chống cộng, sửa đổi hiến pháp trích lục (1952), sửa đổi hiến pháp tứ xá ngũ nhập (1954)\n• Bầu cử gian lận 15/3 (1960): Đảng Tự do gian lận bầu Tổng thống và Phó Tổng thống\n• Cách mạng 19/4: Biểu tình Masan → Phát hiện thi thể Kim Ju-yeol → Lan rộng toàn quốc\n  - Học sinh và công dân yêu cầu dân chủ hóa, thiết quân luật, giáo sư biểu tình\n• Kết quả: Yi Seung-man hạ đài, chính phủ quá độ Heo Jeong, Đệ nhị Cộng hòa (Nội các Jang Myeon)\n• Ý nghĩa: Phong trào dân chủ hóa của học sinh và công dân, cuộc cách mạng dân chủ đầu tiên"
  },
  "ch_contemporary_05": {
    "title": "Chính phủ Park Chung-hee",
    "theory": "Năm 1961, chính phủ Park Chung-hee được thành lập qua chính biến quân sự.\n\n• Chính biến quân sự 16/5 (1961): Quân đội nắm chính quyền, Hội đồng Tái thiết Quốc gia Tối cao\n• Đệ tam Cộng hòa (1963): Chế độ tổng thống, Kế hoạch Phát triển Kinh tế 5 năm\n• Hiệp định Hàn-Nhật (1965): Bình thường hóa quan hệ ngoại giao, biểu tình 3/6 (phong trào phản đối)\n• Thể chế Duy tân (1972): Duy tân tháng 10, quyền biện pháp khẩn cấp, Hội đồng Thống nhất Chủ thể Quốc dân\n• Khởi nghĩa dân chủ Buma (1979): Biểu tình Busan-Masan\n• Sự kiện 26/10 (1979): Park Chung-hee bị ám sát"
  },
  "ch_contemporary_06": {
    "title": "Chính phủ Chun Doo-hwan và phong trào dân chủ hóa",
    "theory": "Năm 1980, tân quân phiệt Chun Doo-hwan nắm chính quyền.\n\n• Sự kiện 12/12 (1979): Tân quân phiệt Chun Doo-hwan nắm quyền quân sự\n• Phong trào Dân chủ hóa 18/5 (1980): Gwangju, chống mở rộng thiết quân luật, tổ chức quân dân\n  - Tân quân phiệt đàn áp bằng vũ lực, hàng trăm người hy sinh\n• Đệ ngũ Cộng hòa: Tổng thống gián tiếp, nhiệm kỳ 7 năm một lần\n• Khởi nghĩa Dân chủ tháng 6 (1987): Yêu cầu bãi bỏ hộ hiến và bầu cử trực tiếp, Yi Han-yeol hy sinh\n• Tuyên bố 29/6: Chấp nhận sửa đổi hiến pháp bầu cử trực tiếp, Roh Tae-woo\n• Ý nghĩa: Bước ngoặt quyết định của dân chủ hóa"
  },
  "ch_contemporary_07": {
    "title": "Sự phát triển của dân chủ",
    "theory": "Sau năm 1987, dân chủ phát triển và chuyển giao chính quyền hòa bình được thực hiện.\n\n• Đệ lục Cộng hòa (1988): Bầu cử trực tiếp Tổng thống, nhiệm kỳ 5 năm một lần\n• Chính phủ Roh Tae-woo: Ngoại giao phương Bắc, thiết lập quan hệ với Liên Xô-Trung Quốc, Nam-Bắc cùng gia nhập Liên Hợp Quốc (1991)\n• Chính phủ Kim Young-sam: Chính phủ dân sự, chế độ thực danh tài chính, chỉnh đốn lịch sử, khủng hoảng IMF\n• Chính phủ Kim Dae-jung: Chuyển giao chính quyền hòa bình đầu tiên, Hội nghị thượng đỉnh Nam-Bắc (2000), Tuyên bố 15/6\n• Sau đó: Bầu cử dân chủ, mở rộng nhân quyền và tự do báo chí"
  },
  "ch_contemporary_08": {
    "title": "Phát triển kinh tế và biến đổi xã hội",
    "theory": "Đại Hàn Dân Quốc trải nghiệm tăng trưởng kinh tế nhanh chóng và biến đổi xã hội.\n\n• Phát triển kinh tế: Kế hoạch Phát triển Kinh tế 5 năm lần 1-4 (1962-1981)\n  - Công nghiệp nhẹ → Công nghiệp nặng hóa chất, tăng trưởng dẫn dắt bởi xuất khẩu\n• Kỳ tích sông Hàn: Từ nước nhận viện trợ → nước viện trợ, gia nhập OECD (1996)\n• Khủng hoảng IMF (1997): Khủng hoảng ngoại hối, tái cơ cấu, vượt qua\n• Biến đổi xã hội: Đô thị hóa, gia đình hạt nhân, già hóa dân số, cường quốc IT\n• Văn hóa: Hallyu (K-POP, phim truyền hình, điện ảnh), vị thế toàn cầu"
  },
  "ch_contemporary_09": {
    "title": "Sự thay đổi của chính sách thống nhất",
    "theory": "Chính sách thống nhất của Chính phủ Đại Hàn Dân Quốc thay đổi theo thời đại.\n\n• Yi Seung-man: Thuyết thống nhất Bắc tiến (thống nhất bằng vũ lực)\n• Park Chung-hee: Tuyên bố chung Nam-Bắc 4/7 (1972), tự chủ-hòa bình-đại đoàn kết dân tộc\n• Chun Doo-hwan: Đoàn tụ gia đình ly tán Nam-Bắc (1985)\n• Roh Tae-woo: Ngoại giao phương Bắc, Hiệp định cơ bản Nam-Bắc (1991)\n• Kim Dae-jung: Chính sách Ánh dương, du lịch núi Geumgang, Hội nghị thượng đỉnh Nam-Bắc lần 1 (2000)\n• Sau đó: Khu công nghiệp Gaeseong, Hội nghị thượng đỉnh lần 2 và 3"
  },
  "ch_contemporary_10": {
    "title": "Sự thay đổi của Bắc Triều Tiên và quan hệ Nam-Bắc",
    "theory": "Từ sau chia cắt, thể chế Bắc Triều Tiên và quan hệ Nam-Bắc đã thay đổi.\n\n• Thể chế Bắc Triều Tiên: Kim Il-sung → Kim Jong-il → Kim Jong-un, 3 đời cha truyền con nối\n  - Tư tưởng Juche, chính trị Tiên quân, phát triển hạt nhân\n• Quan hệ Nam-Bắc: Đối đầu (1950-1970) → Đối thoại (1970-) → Hòa giải và hợp tác (1990-)\n  - Căng thẳng và hòa giải lặp đi lặp lại\n• Sự kiện chính: Khủng bố Aung San (1983), Cheonan (2010), Yeonpyeong (2010)\n• Giao lưu Nam-Bắc: Đoàn tụ gia đình ly tán, du lịch núi Geumgang, Khu công nghiệp Gaeseong\n• Thách thức: Thiết lập hòa bình, chuẩn bị thống nhất, hòa giải dân tộc"
  }
}
