Repository: Wearablock/korean-history-bite
Catalog: lib/l10n/app_*.arb
Languages: ja, pt, zh, zh_hant

# appTitle
source: Korean History Bite
ja: 韓国史一口
pt: História da Coreia em Doses
zh: 韩国史一口
zh_hant: 韓國史一口

source: Home
ja: ホーム
pt: Início
zh: 首页
zh_hant: 首頁

source: Progress
ja: 進捗
pt: Progresso
zh: 进度
zh_hant: 進度

source: Settings
ja: 設定
pt: Configurações
zh: 设置
zh_hant: 設定

source: Wrong Answers
ja: 間違いノート
pt: Respostas Erradas
zh: 错题本
zh_hant: 錯題本

# error
source: Error: {message}
ja: エラー: {message}
pt: Erro: {message}
zh: 错误：{message}
zh_hant: 錯誤：{message}

source: Start Study
ja: 学習開始
pt: Iniciar Estudo
zh: 开始学习
zh_hant: 開始學習

source: Continue Study
ja: 学習を続ける
pt: Continuar Estudo
zh: 继续学习
zh_hant: 繼續學習

source: Start Review
ja: 復習開始
pt: Iniciar Revisão
zh: 开始复习
zh_hant: 開始複習

# todayStudy
source: Today's Study
ja: 今日の学習
pt: Estudo de Hoje
zh: 今日学习
zh_hant: 今日學習

source: All Chapters Completed!
ja: 全チャプター完了！
pt: Todos os Capítulos Concluídos!
zh: 全部章节已完成！
zh_hant: 全部章節已完成！

# reviewEncouragement
source: Keep practicing with reviews to master the content.
ja: 復習を続けて内容をマスターしましょう。
pt: Continue praticando com revisões para dominar o conteúdo.
zh: 通过复习继续巩固所学内容吧。
zh_hant: 透過複習繼續鞏固所學內容吧。

source: Next Chapter
ja: 次のチャプター
pt: Próximo Capítulo
zh: 下一章节
zh_hant: 下一章節

# questionsCount
source: {count} questions
ja: {count}問
pt: {count} questões
zh: {count}道题
zh_hant: {count}道題

# todayQuestionsCompleted
source: {count} questions completed today
ja: 今日{count}問完了
pt: {count} questões concluídas hoje
zh: 今日已完成{count}道题
zh_hant: 今日已完成{count}道題

# todayGoal
source: Today's Goal
ja: 今日の目標
pt: Meta de Hoje
zh: 今日目标
zh_hant: 今日目標

# chaptersProgress
source: {studied}/{goal} chapters
ja: {studied}/{goal}チャプター
pt: {studied}/{goal} capítulos
zh: {studied}/{goal}章节
zh_hant: {studied}/{goal}章節

# streakDays
source: {days} day streak!
ja: {days}日連続！
pt: Sequência de {days} dias!
zh: 连续学习{days}天！
zh_hant: 連續學習{days}天！

source: Overall Progress
ja: 全体進捗
pt: Progresso Geral
zh: 整体进度
zh_hant: 整體進度

source: Mastered
ja: マスター済み
pt: Dominado
zh: 已掌握
zh_hant: 已掌握

source: Studied Once
ja: 1回学習済み
pt: Estudado Uma Vez
zh: 学习一次
zh_hant: 學習一次

# totalQuestions
source: Total {count} questions
ja: 全{count}問
pt: Total de {count} questões
zh: 共{count}道题
zh_hant: 共{count}道題

# questionsMastered
source: {count} / {total} questions mastered
ja: {count} / {total}問マスター
pt: {count} / {total} questões dominadas
zh: 已掌握 {count} / {total} 道题
zh_hant: 已掌握 {count} / {total} 道題

source: Study
ja: 学習
pt: Estudo
zh: 学习
zh_hant: 學習

source: Notifications
ja: 通知
pt: Notificações
zh: 通知
zh_hant: 通知

source: App Settings
ja: アプリ設定
pt: Configurações do App
zh: 应用设置
zh_hant: 應用程式設定

source: Info
ja: 情報
pt: Informações
zh: 信息
zh_hant: 資訊

source: App Version
ja: アプリバージョン
pt: Versão do App
zh: 应用版本
zh_hant: 應用程式版本

# termsAndPolicies
source: Terms & Policies
ja: 利用規約・ポリシー
pt: Termos e Políticas
zh: 条款与政策
zh_hant: 條款與政策

source: Terms of Service
ja: 利用規約
pt: Termos de Serviço
zh: 服务条款
zh_hant: 服務條款

source: Privacy Policy
ja: プライバシーポリシー
pt: Política de Privacidade
zh: 隐私政策
zh_hant: 隱私權政策

source: Support
ja: サポート
pt: Suporte
zh: 支持
zh_hant: 支援

source: Data
ja: データ
pt: Dados
zh: 数据
zh_hant: 資料

source: Reset Study Records
ja: 学習記録をリセット
pt: Redefinir Registros de Estudo
zh: 重置学习记录
zh_hant: 重置學習記錄

# resetStudyRecordsDesc
source: Delete all study records
ja: すべての学習記録を削除
pt: Excluir todos os registros de estudo
zh: 删除所有学习记录
zh_hant: 刪除所有學習記錄

# resetStudyRecordsConfirm
source: All study records will be deleted. This action cannot be undone.
ja: すべての学習記録が削除されます。 この操作は元に戻せません。
pt: Todos os registros de estudo serão excluídos. Esta ação não pode ser desfeita.
zh: 所有学习记录将被删除。 此操作无法撤销。
zh_hant: 所有學習記錄將被刪除。 此操作無法復原。

source: Cannot open link.
ja: リンクを開けません。
pt: Não foi possível abrir o link.
zh: 无法打开链接。
zh_hant: 無法開啟連結。

source: Cancel
ja: キャンセル
pt: Cancelar
zh: 取消
zh_hant: 取消

source: Reset
ja: リセット
pt: Redefinir
zh: 重置
zh_hant: 重置

source: Confirm
ja: 確認
pt: Confirmar
zh: 确认
zh_hant: 確認

# studyRecordsReset
source: Study records have been reset.
ja: 学習記録がリセットされました。
pt: Os registros de estudo foram redefinidos.
zh: 学习记录已重置。
zh_hant: 學習記錄已重置。

source: Daily Study Amount
ja: 1日の学習量
pt: Quantidade de Estudo Diário
zh: 每日学习量
zh_hant: 每日學習量

# chaptersUnit
source: {count} chapters
ja: {count}チャプター
pt: {count} capítulos
zh: {count}章节
zh_hant: {count}章節

# customSetting
source: Custom
ja: カスタム
pt: Personalizado
zh: 自定义
zh_hant: 自訂

source: Theme
ja: テーマ
pt: Tema
zh: 主题
zh_hant: 主題

source: Select Theme
ja: テーマを選択
pt: Selecionar Tema
zh: 选择主题
zh_hant: 選擇主題

# themeSystem
source: System Default
ja: システムデフォルト
pt: Padrão do Sistema
zh: 跟随系统
zh_hant: 跟隨系統

# themeLight
source: Light Mode
ja: ライトモード
pt: Modo Claro
zh: 浅色模式
zh_hant: 淺色模式

# themeDark
source: Dark Mode
ja: ダークモード
pt: Modo Escuro
zh: 深色模式
zh_hant: 深色模式

source: Study Complete
ja: 学習完了
pt: Estudo Concluído
zh: 学习完成
zh_hant: 學習完成

source: Good job!
ja: よくできました！
pt: Bom trabalho!
zh: 做得好！
zh_hant: 做得好！

# continueReviewWithCount
source: Continue Review ({count} remaining)
ja: 復習を続ける（残り{count}問）
pt: Continuar Revisão ({count} restantes)
zh: 继续复习（剩余{count}道）
zh_hant: 繼續複習（剩餘{count}道）

source: Go Home
ja: ホームへ
pt: Ir para Início
zh: 返回首页
zh_hant: 返回首頁

# additionalStudy
source: Study More
ja: 追加学習
pt: Estudar Mais
zh: 继续学习
zh_hant: 繼續學習

# todayStudyCompleteMessage
source: Today's study is complete!
ja: 今日の学習完了！
pt: O estudo de hoje está completo!
zh: 今日学习已完成！
zh_hant: 今日學習已完成！

# excellentComplete
source: Excellent! You've completed today's study!
ja: 素晴らしい！ 今日の学習を完了しました！
pt: Excelente! Você completou o estudo de hoje!
zh: 太棒了！ 今日学习已完成！
zh_hant: 太棒了！ 今日學習已完成！

# goodComplete
source: Great job! You've completed today's study!
ja: よくできました！ 今日の学習を完了しました！
pt: Bom trabalho! Você completou o estudo de hoje!
zh: 做得好！ 今日学习已完成！
zh_hant: 做得好！ 今日學習已完成！

source: Accuracy
ja: 正答率
pt: Precisão
zh: 正确率
zh_hant: 正確率

source: Correct
ja: 正解
pt: Correto
zh: 正确
zh_hant: 正確

source: Wrong
ja: 不正解
pt: Errado
zh: 错误
zh_hant: 錯誤

source: Time Spent
ja: 学習時間
pt: Tempo Gasto
zh: 用时
zh_hant: 用時

# phaseResults
source: Results by Phase
ja: フェーズ別結果
pt: Resultados por Fase
zh: 分阶段结果
zh_hant: 分階段結果

source: Wrong Review
ja: 間違い復習
pt: Revisão de Erros
zh: 错题复习
zh_hant: 錯題複習

source: Spaced Review
ja: 間隔復習
pt: Revisão Espaçada
zh: 间隔复习
zh_hant: 間隔複習

source: New Learning
ja: 新規学習
pt: Novo Aprendizado
zh: 新学习
zh_hant: 新學習

# errorOccurred
source: An error occurred
ja: エラーが発生しました
pt: Ocorreu um erro
zh: 发生错误
zh_hant: 發生錯誤

source: Retry
ja: 再試行
pt: Tentar Novamente
zh: 重试
zh_hant: 重試

source: Stop Study
ja: 学習を中止
pt: Parar Estudo
zh: 停止学习
zh_hant: 停止學習

# stopStudyConfirm
source: Do you want to stop studying? Your progress will be saved.
ja: 学習を中止しますか？ 進捗は保存されます。
pt: Deseja parar o estudo? Seu progresso será salvo.
zh: 确定要停止学习吗？ 进度将被保存。
zh_hant: 確定要停止學習嗎？ 進度將被儲存。

# continueStudyButton
source: Continue
ja: 続ける
pt: Continuar
zh: 继续
zh_hant: 繼續

source: Stop
ja: 中止
pt: Parar
zh: 停止
zh_hant: 停止

source: Chapter not found.
ja: チャプターが見つかりません。
pt: Capítulo não encontrado.
zh: 未找到章节。
zh_hant: 未找到章節。

# eraProgress
source: Progress by Era
ja: 時代別進捗
pt: Progresso por Era
zh: 各时代进度
zh_hant: 各時代進度

# reviewAvailable
source: You have questions to review!
ja: 復習する問題があります！
pt: Você tem questões para revisar!
zh: 有题目需要复习！
zh_hant: 有題目需要複習！

# reviewWaiting
source: {count} questions waiting for review
ja: {count}問が復習待ち
pt: {count} questões aguardando revisão
zh: {count}道题等待复习
zh_hant: {count}道題等待複習

source: Welcome!
ja: ようこそ！
pt: Bem-vindo!
zh: 欢迎！
zh_hant: 歡迎！

# howManyChapters
source: How many chapters per day?
ja: 1日何チャプター学習しますか？
pt: Quantos capítulos por dia?
zh: 每天学习几个章节？
zh_hant: 每天學習幾個章節？

# canChangeInSettings
source: You can change this in settings later
ja: 後で設定で変更できます
pt: Você pode alterar isso nas configurações depois
zh: 之后可在设置中更改
zh_hant: 之後可在設定中更改

source: Start
ja: 開始
pt: Iniciar
zh: 开始
zh_hant: 開始

source: Light start
ja: 軽く始める
pt: Início leve
zh: 轻松开始
zh_hant: 輕鬆開始

source: Moderate amount
ja: 適度な量
pt: Quantidade moderada
zh: 适量学习
zh_hant: 適量學習

source: Intensive study
ja: 集中学習
pt: Estudo intensivo
zh: 强化学习
zh_hant: 強化學習

# settingsSaveError
source: Error saving settings: {error}
ja: 設定保存エラー: {error}
pt: Erro ao salvar configurações: {error}
zh: 保存设置时出错：{error}
zh_hant: 儲存設定時出錯：{error}

source: Overall Study Stats
ja: 全体学習統計
pt: Estatísticas Gerais de Estudo
zh: 整体学习统计
zh_hant: 整體學習統計

source: Total Study
ja: 総学習
pt: Estudo Total
zh: 总学习量
zh_hant: 總學習量

# accuracyRate
source: Accuracy
ja: 正答率
pt: Precisão
zh: 正确率
zh_hant: 正確率

source: Study Days
ja: 学習日数
pt: Dias de Estudo
zh: 学习天数
zh_hant: 學習天數

# daysCount
source: {count} days
ja: {count}日
pt: {count} dias
zh: {count}天
zh_hant: {count}天

source: Study Time
ja: 学習時間
pt: Tempo de Estudo
zh: 学习时长
zh_hant: 學習時長

source: Streak Record
ja: 連続記録
pt: Recorde de Sequência
zh: 连续记录
zh_hant: 連續記錄

source: Current Streak
ja: 現在の連続
pt: Sequência Atual
zh: 当前连续
zh_hant: 目前連續

source: Longest Streak
ja: 最長連続
pt: Maior Sequência
zh: 最长连续
zh_hant: 最長連續

# newRecord
source: You're setting a new record!
ja: 新記録達成中！
pt: Você está estabelecendo um novo recorde!
zh: 正在创造新纪录！
zh_hant: 正在創造新紀錄！

# weekStreak
source: One week streak! Amazing!
ja: 1週間連続！すごい！
pt: Uma semana de sequência! Incrível!
zh: 连续一周！太棒了！
zh_hant: 連續一週！太棒了！

source: Keep it up!
ja: この調子で頑張ろう！
pt: Continue assim!
zh: 继续加油！
zh_hant: 繼續加油！

# todayComplete
source: Today's study complete!
ja: 今日の学習完了！
pt: Estudo de hoje completo!
zh: 今日学习完成！
zh_hant: 今日學習完成！

source: Level Distribution
ja: レベル分布
pt: Distribuição de Níveis
zh: 等级分布
zh_hant: 等級分佈

# fullyMastered
source: Mastered
ja: マスター
pt: Dominado
zh: 已掌握
zh_hant: 已掌握

source: Review Level 4
ja: 復習レベル4
pt: Nível de Revisão 4
zh: 复习等级4
zh_hant: 複習等級4

source: Review Level 3
ja: 復習レベル3
pt: Nível de Revisão 3
zh: 复习等级3
zh_hant: 複習等級3

source: Review Level 2
ja: 復習レベル2
pt: Nível de Revisão 2
zh: 复习等级2
zh_hant: 複習等級2

source: Review Level 1
ja: 復習レベル1
pt: Nível de Revisão 1
zh: 复习等级1
zh_hant: 複習等級1

# wrongOrReset
source: Wrong/Reset
ja: 不正解/リセット
pt: Errado/Redefinido
zh: 错误/重置
zh_hant: 錯誤/重置

source: Unknown
ja: 不明
pt: Desconhecido
zh: 未知
zh_hant: 未知

source: Unstudied
ja: 未学習
pt: Não Estudado
zh: 未学习
zh_hant: 未學習

source: Learning
ja: 学習中
pt: Aprendendo
zh: 学习中
zh_hant: 學習中

source: Study Notification
ja: 学習通知
pt: Notificação de Estudo
zh: 学习提醒
zh_hant: 學習提醒

# dailyNotification
source: Daily reminder at set time
ja: 設定時刻に毎日リマインド
pt: Lembrete diário no horário definido
zh: 每天在设定时间提醒
zh_hant: 每天在設定時間提醒

source: Notification off
ja: 通知オフ
pt: Notificação desativada
zh: 提醒已关闭
zh_hant: 提醒已關閉

# notificationChannelName
source: Study Reminder
ja: 学習リマインダー
pt: Lembrete de Estudo
zh: 学习提醒
zh_hant: 學習提醒

# notificationChannelDesc
source: Daily study time reminders
ja: 毎日の学習時間リマインダー
pt: Lembretes diários de horário de estudo
zh: 每日学习时间提醒
zh_hant: 每日學習時間提醒

# notificationTitle
source: Korean History Bite
ja: 韓国史一口
pt: História da Coreia em Doses
zh: 韩国史一口
zh_hant: 韓國史一口

# notificationBody
source: Time to start today's study!
ja: 今日の学習を始めましょう！
pt: Hora de começar o estudo de hoje!
zh: 是时候开始今天的学习了！
zh_hant: 是時候開始今天的學習了！

source: Notification Time
ja: 通知時刻
pt: Horário da Notificação
zh: 提醒时间
zh_hant: 提醒時間

source: Select notification time
ja: 通知時刻を選択
pt: Selecionar horário da notificação
zh: 选择提醒时间
zh_hant: 選擇提醒時間

# amTime
source: {hour}:{minute} AM
ja: 午前{hour}:{minute}
zh: 上午{hour}:{minute}
zh_hant: 上午{hour}:{minute}

# pmTime
source: {hour}:{minute} PM
ja: 午後{hour}:{minute}
zh: 下午{hour}:{minute}
zh_hant: 下午{hour}:{minute}

source: Wrong answers (Coming soon)
ja: 間違いノート（準備中）
pt: Respostas erradas (Em breve)
zh: 错题本（即将推出）
zh_hant: 錯題本（即將推出）

source: No wrong answers!
ja: 間違いなし！
pt: Nenhuma resposta errada!
zh: 没有错题！
zh_hant: 沒有錯題！

# noWrongAnswersDesc
source: You're doing great! Keep up the good work and continue building your knowledge!
ja: よくできています！この調子で 知識を積み重ねていきましょう！
pt: Você está indo muito bem! Continue assim e continue construindo seu conhecimento!
zh: 做得好！继续加油， 不断巩固你的知识！
zh_hant: 做得好！繼續加油， 不斷鞏固你的知識！

# wrongCount
source: Wrong {count} times
ja: {count}回間違い
pt: Errado {count} vezes
zh: 错误{count}次
zh_hant: 錯誤{count}次

# correctAnswer
source: Correct!
ja: 正解！
pt: Correto!
zh: 正确！
zh_hant: 正確！

source: Your Answer
ja: あなたの回答
pt: Sua Resposta
zh: 你的答案
zh_hant: 你的答案

source: Explanation
ja: 解説
pt: Explicação
zh: 解析
zh_hant: 解析

source: Next Question
ja: 次の問題
pt: Próxima Questão
zh: 下一题
zh_hant: 下一題

# sessionComplete
source: Today's Study Complete!
ja: 今日の学習完了！
pt: Estudo de Hoje Concluído!
zh: 今日学习完成！
zh_hant: 今日學習完成！

# questionsCompleted
source: {completed} of {total} questions completed
ja: {total}問中{completed}問完了
pt: {completed} de {total} questões concluídas
zh: 已完成 {completed} / {total} 道题
zh_hant: 已完成 {completed} / {total} 道題

# eraPrehistoric
source: Prehistoric
ja: 先史時代
pt: Pré-história
zh: 史前时代
zh_hant: 史前時代

# eraGojoseon
source: Gojoseon
ja: 古朝鮮
zh: 古朝鲜
zh_hant: 古朝鮮

# eraThreeKingdoms
source: Three Kingdoms
ja: 三国時代
pt: Três Reinos
zh: 三国时代
zh_hant: 三國時代

# eraNorthSouthStates
source: North-South States
ja: 南北国時代
pt: Estados Norte-Sul
zh: 南北国时代
zh_hant: 南北國時代

# eraGoryeo
source: Goryeo
ja: 高麗
zh: 高丽时代
zh_hant: 高麗時代

# eraJoseonEarly
source: Early Joseon
ja: 朝鮮前期
pt: Joseon Inicial
zh: 朝鲜前期
zh_hant: 朝鮮前期

# eraJoseonLate
source: Late Joseon
ja: 朝鮮後期
pt: Joseon Tardio
zh: 朝鲜后期
zh_hant: 朝鮮後期

# eraModern
source: Modern Era
ja: 近代
pt: Era Moderna
zh: 近代
zh_hant: 近代

# eraJapaneseOccupation
source: Japanese Occupation
ja: 日本統治時代
pt: Ocupação Japonesa
zh: 日据时代
zh_hant: 日據時代

# eraContemporary
source: Contemporary
ja: 現代
pt: Contemporâneo
zh: 现代
zh_hant: 現代

source: Studied
ja: 学習済み
pt: Estudado
zh: 已学习
zh_hant: 已學習

# masteredShort
source: Mastered
ja: マスター
pt: Dominado
zh: 已掌握
zh_hant: 已掌握

# studiedStats
source: Studied {studied}/{total} · Mastered {mastered}
ja: 学習 {studied}/{total} · マスター {mastered}
pt: Estudado {studied}/{total} · Dominado {mastered}
zh: 已学习 {studied}/{total} · 已掌握 {mastered}
zh_hant: 已學習 {studied}/{total} · 已掌握 {mastered}

source: Question not found.
ja: 問題が見つかりません。
pt: Questão não encontrada.
zh: 未找到题目。
zh_hant: 未找到題目。

source: Review
ja: 復習
pt: Revisão
zh: 复习
zh_hant: 複習

# theoryLearning
source: Theory
ja: 理論
pt: Teoria
zh: 理论
zh_hant: 理論

# learningComplete
source: Complete
ja: 完了
pt: Concluído
zh: 完成
zh_hant: 完成

# wrongAnswer
source: Incorrect
ja: 不正解
pt: Incorreto
zh: 错误
zh_hant: 錯誤

source: Quiz
ja: クイズ
zh: 测验
zh_hant: 測驗

source: Show Hint
ja: ヒントを見る
pt: Mostrar Dica
zh: 显示提示
zh_hant: 顯示提示

# imageLoadFailed
source: Failed to load image
ja: 画像の読み込みに失敗
pt: Falha ao carregar imagem
zh: 图片加载失败
zh_hant: 圖片載入失敗

# sourceDocument
source: Source
ja: 出典
pt: Fonte
zh: 来源
zh_hant: 來源

# newShort
source: New
ja: 新規
pt: Novo
zh: 新
zh_hant: 新

source: Premium
ja: プレミアム
zh: 高级版
zh_hant: 高級版

source: Remove Ads
ja: 広告を削除
pt: Remover Anúncios
zh: 移除广告
zh_hant: 移除廣告

source: Premium activated
ja: プレミアム有効
pt: Premium ativado
zh: 高级版已激活
zh_hant: 高級版已啟用

source: Purchase
ja: 購入
pt: Comprar
zh: 购买
zh_hant: 購買

source: Restore Purchases
ja: 購入を復元
pt: Restaurar Compras
zh: 恢复购买
zh_hant: 恢復購買

source: Purchase failed
ja: 購入に失敗しました
pt: Compra falhou
zh: 购买失败
zh_hant: 購買失敗

source: Purchases restored
ja: 購入が復元されました
pt: Compras restauradas
zh: 购买已恢复
zh_hant: 購買已恢復

source: Product not available
ja: 商品が利用できません
pt: Produto não disponível
zh: 产品不可用
zh_hant: 產品不可用

# oneChapter
source: 1 Chapter
ja: 1チャプター
pt: 1 Capítulo
zh: 1个章节
zh_hant: 1個章節

# twoChapters
source: 2 Chapters
ja: 2チャプター
pt: 2 Capítulos
zh: 2个章节
zh_hant: 2個章節

# threeChapters
source: 3 Chapters
ja: 3チャプター
pt: 3 Capítulos
zh: 3个章节
zh_hant: 3個章節

# notificationPermissionRequired
source: Notification permission is required. Please allow notifications in settings.
ja: 通知の許可が必要です。設定で通知を許可してください。
pt: Permissão de notificação necessária. Por favor, permita notificações nas configurações.
zh: 需要通知权限。请在设置中允许通知。
zh_hant: 需要通知權限。請在設定中允許通知。

# notificationSettingError
source: Error occurred while setting notification.
ja: 通知設定中にエラーが発生しました。
pt: Ocorreu um erro ao configurar a notificação.
zh: 设置通知时发生错误。
zh_hant: 設定通知時發生錯誤。

# notificationTimeSettingError
source: Error occurred while setting notification time.
ja: 通知時刻設定中にエラーが発生しました。
pt: Ocorreu um erro ao configurar o horário da notificação.
zh: 设置通知时间时发生错误。
zh_hant: 設定通知時間時發生錯誤。

source: Language
ja: 言語
pt: Idioma
zh: 语言
zh_hant: 語言

source: Select Language
ja: 言語を選択
pt: Selecionar Idioma
zh: 选择语言
zh_hant: 選擇語言

# languageSystem
source: System Default
ja: システム設定
pt: Padrão do Sistema
zh: 跟随系统
zh_hant: 跟隨系統

# languageChangeRestart
source: Restart the app to apply the language change.
ja: 言語変更を適用するにはアプリを再起動してください。
pt: Reinicie o app para aplicar a alteração de idioma.
zh: 重启应用以应用语言更改。
zh_hant: 重新啟動應用程式以套用語言變更。

# soundAndVibration
source: Sound & Vibration
ja: サウンドと振動
pt: Som e Vibração
zh: 声音与振动

source: Sound Effects
ja: 効果音
pt: Efeitos Sonoros
zh: 音效

# soundEffectsDesc
source: Play sound on correct/wrong answers
ja: 正解/不正解時に効果音を再生
pt: Reproduzir som ao acertar/errar
zh: 正确/错误时播放音效

source: Vibration
ja: 振動
pt: Vibração
zh: 振动

# vibrationDesc
source: Haptic feedback on correct/wrong answers
ja: 正解/不正解時に振動フィードバック
pt: Feedback tátil ao acertar/errar
zh: 正确/错误时振动反馈
